&НаСервере
Процедура ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, КодОшибки = "")
	
	НоваяСтрока = ТаблицаОшибок.Добавить();
	НоваяСтрока.НомерСтроки = НомерСтроки;
	НоваяСтрока.НомерВРеестреСРО = КПК.НомерВРеестреСРО;  
	НоваяСтрока.КПК = КПК;
	НоваяСтрока.НазваниеТаблицы = НазваниеТаблицы;
	НоваяСтрока.ОписаниеУсловия = ОписаниеУсловия;
	НоваяСтрока.ОписаниеОшибки = ОписаниеОшибки; 
	НоваяСтрока.КоличествоОшибок = 1;
	НоваяСтрока.ПорядокСортировки = ТаблицаОшибок.Количество();
	НоваяСтрока.КодОшибки = КодОшибки;
	
КонецПроцедуры

//&НаСервере
Процедура ПроверкаНаОшибку(ТаблицаОшибок, КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, ЗнакСравнения, ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибкиГрафа, КоличествоОшибокПоГрафе, СтрокаРазделитель, КодОшибки = "")
	
	Разница = ЗначениеЛевое - ЗначениеПравое;
	Если ?(Разница > 0, Разница, -Разница) > 1 Тогда		
		Если ОписаниеОшибки = "" Тогда
			ОписаниеОшибки = Строка(ЗначениеЛевое) + " " + ЗнакСравнения + " " + Строка(ЗначениеПравое);
		КонецЕсли;
		
		ОписаниеОшибкиГрафа = ОписаниеОшибкиГрафа + ?(ОписаниеОшибкиГрафа="", "", СтрокаРазделитель) + ОписаниеУсловия + "  |  " + ОписаниеОшибки;  
		ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, КодОшибки);         			
		
		КоличествоОшибокПоГрафе = КоличествоОшибокПоГрафе + 1; 
	Иначе
		ОписаниеОшибки = "";
	КонецЕсли; 
	//	
КонецПроцедуры


Функция СформироватьТабличныеДокументы(СтруктураПараметров) Экспорт     
	
	Если НЕ СтруктураПараметров.Свойство("ОтчетностьСРО") Тогда
		СтруктураПараметров.Вставить("ОтчетностьСРО", Неопределено);		
	КонецЕсли;
	
	Если НЕ СтруктураПараметров.Свойство("ПредварительнаяПроверка") Тогда
		СтруктураПараметров.Вставить("ПредварительнаяПроверка", Ложь);		
	КонецЕсли;
	
	Если НЕ СтруктураПараметров.Свойство("ПроверятьПриЗагрузке") Тогда
		СтруктураПараметров.Вставить("ПроверятьПриЗагрузке", Ложь);		
	КонецЕсли;
	
	Если НЕ СтруктураПараметров.Свойство("ВидОтчета") Тогда
		СтруктураПараметров.Вставить("ВидОтчета", 1);		
	КонецЕсли;
		
	Если НЕ СтруктураПараметров.Свойство("ВыводитьТолькоКПКСОтчетностью") Тогда
		СтруктураПараметров.Вставить("ВыводитьТолькоКПКСОтчетностью", Ложь);		
	КонецЕсли;      	
	
	Если НЕ СтруктураПараметров.Свойство("ТаблицаОшибок") Тогда                    		
		ВремТаблицаОшибок = СРО_ЗагрузкаОтчетности.ИнициализироватьТаблицуОшибок();
		СтруктураПараметров.Вставить("ТаблицаОшибок", ВремТаблицаОшибок);		
	КонецЕсли;
	
	Если НЕ СтруктураПараметров.Свойство("ОтчетВЦБ") Тогда                    		
		СтруктураПараметров.Вставить("ОтчетВЦБ", Ложь);		
	КонецЕсли;
	
	Если НЕ СтруктураПараметров.Свойство("ФормированиеОтчетаПользователю") Тогда                    		
		СтруктураПараметров.Вставить("ФормированиеОтчетаПользователю", Ложь);		
	КонецЕсли;   
		
	Если НЕ СтруктураПараметров.Свойство("ВидКодовТриггеров") Тогда                    		
		СтруктураПараметров.Вставить("ВидКодовТриггеров", 0);		
	КонецЕсли; 
	
	Если НЕ СтруктураПараметров.Свойство("МассивУправленияГУ") Тогда                    		
		СтруктураПараметров.Вставить("МассивУправленияГУ", Новый Массив);		
	КонецЕсли; 
	
	Если НЕ СтруктураПараметров.Свойство("ВидОтбора_КПК_УправлениеГУ") Тогда                    		
		СтруктураПараметров.Вставить("ВидОтбора_КПК_УправлениеГУ", "");		
	КонецЕсли; 
	
	//СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("МассивКПК", ?(ВидОтчета = 0, МассивКПК, СписокКПК.ВыгрузитьЗначения()));
	//СтруктураПараметров.Вставить("ДатаНачалаОтчета", ПериодОтчета.ДатаНачала);
	//СтруктураПараметров.Вставить("ДатаОкончанияОтчета", КонецКвартала(ПериодОтчета.ДатаОкончания)); 	
	// --- СтруктураПараметров.Вставить("ОтчетностьСРО", Отчет.ОтчетностьСРО); 	
	// --- СтруктураПараметров.Вставить("ПредварительнаяПроверка", Отчет.ПредварительнаяПроверка); 
	// --- СтруктураПараметров.Вставить("ВидОтчета", ВидОтчета); 
	// --- СтруктураПараметров.Вставить("ВыводитьТолькоКПКСОтчетностью", ВыводитьТолькоКПКСОтчетностью);     	
	// --- СтруктураПараметров.Вставить("ТаблицаОшибок", Отчет.ТаблицаОшибок.Выгрузить());  	
	// --- СтруктураПараметров.Вставить("ОтчетВЦБ", ОтчетВЦБ); 
	// --- СтруктураПараметров.Вставить("ФормированиеОтчетаПользователю", Ложь); 	
	//--- СтруктураПараметров.Вставить("Ти7пОтчета",Перечисления.ТипыОчетаПроверки.ПоРазделам);			

	
	
	Если НЕ СтруктураПараметров.Свойство("ТипОтчета") Тогда   		
		СтруктураПараметров.Вставить("ТипОтчета", Перечисления.ТипыОчетаПроверки.СводныйОтчет);		
	КонецЕсли;         
	
	
	Если СтруктураПараметров.ТипОтчета = Перечисления.ТипыОчетаПроверки.ПоРазделам Тогда
		СтруктураТабличныхДокументов = СформироватьНаСервере(СтруктураПараметров);
	Иначе   
		СтруктураТабличныхДокументов = СформироватьНаСервере_Сводный(СтруктураПараметров);    		
	КонецЕсли;  	
	
	Возврат СтруктураТабличныхДокументов;  	
	
КонецФункции


#Область ОбычныйОтчет

Функция СформироватьНаСервере(СтруктураПараметров)
	
	СтруктураПараметров.ДатаОкончанияОтчета = КонецКвартала(СтруктураПараметров.ДатаОкончанияОтчета);	
	ДатаОкончанияОтчета = СтруктураПараметров.ДатаОкончанияОтчета;
	
	ТабличныйДокумент = Новый ТабличныйДокумент; 
	
	Если НачалоДня(ДатаОкончанияОтчета) < Дата(2018, 12, 31) Тогда
		СтруктураТабличныхДокументов = СформироватьНаСервере_До4кв2018(СтруктураПараметров, ТабличныйДокумент);
	Иначе
		СтруктураТабличныхДокументов = СформироватьНаСервере_От4кв2018(СтруктураПараметров, ТабличныйДокумент);
	КонецЕсли;
	
	Возврат СтруктураТабличныхДокументов;
	
КонецФункции


Функция СформироватьНаСервере_До4кв2018(СтруктураПараметров, ТабличныйДокумент)
	//	
	//	Отчет.ТаблицаОшибок.Очистить();  	
	//	
	//	ОтчетОбъект = РеквизитФормыВЗначение("Отчет"); 	
	//	
	
	Если СтруктураПараметров.Свойство("ТаблицаОшибок") Тогда   		
		ТаблицаОшибок = СтруктураПараметров.ТаблицаОшибок;
	Иначе
		ТаблицаОшибок = СРО_ЗагрузкаОтчетности.ИнициализироватьТаблицуОшибок();	
	КонецЕсли;   
	
	ДатаНачалаОтчетногоПериода = СтруктураПараметров.ДатаНачалаОтчета;
	ДатаОкончанияОтчетногоПериода = СтруктураПараметров.ДатаОкончанияОтчета;   	                                                                        
	
	Если СтруктураПараметров.Свойство("СписокКПК") Тогда
		МассивКПК = СтруктураПараметров.СписокКПК.ВыгрузитьЗначения();  
	Иначе		
		МассивКПК = СтруктураПараметров.МассивКПК;  
	КонецЕсли;
	
	ВидОтчета = СтруктураПараметров.ВидОтчета;
	ВыводитьТолькоКПКСОтчетностью = СтруктураПараметров.ВыводитьТолькоКПКСОтчетностью;
	
	
	СтруктураТабличныхДокументов = Новый Структура;
	
	
	РезультатНадзорныеСоотношения = Новый ТабличныйДокумент;
	РезультатКС = Новый ТабличныйДокумент;    	
	РезультатНормативы = Новый ТабличныйДокумент;
	
	ЗапросПоПСК = Новый Запрос;
	МВТ = Новый МенеджерВременныхТаблиц;
	ЗапросПоПСК.МенеджерВременныхТаблиц = МВТ;
	ЗапросПоПСК.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗначенияПСК.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ДокументПСК
	|ИЗ
	|	Документ.ЗначенияПСК КАК ЗначенияПСК
	|ГДЕ
	|	ЗначенияПСК.Проведен = ИСТИНА
	|	И ЗначенияПСК.ДатаОкончанияОтчетногоПериода >= &ДатаОкончания
	|	И ЗначенияПСК.ДатаОкончанияОтчетногоПериода <= &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияПСКРазделыПСК.Раздел КАК Раздел,
	|	ЗначенияПСКРазделыПСК.ЗначениеПСК КАК ЗначениеПСК,
	|	ЗначенияПСКРазделыПСК.ПредельноеЗначениеПСК КАК ПредельноеЗначениеПСК,
	|	ВТ_ДокументПСК.Ссылка.ДатаОкончанияОтчетногоПериода КАК СсылкаДатаОкончанияОтчетногоПериода
	|ПОМЕСТИТЬ ВТ_ЗначенияПСК
	|ИЗ
	|	Документ.ЗначенияПСК.РазделыПСК КАК ЗначенияПСКРазделыПСК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДокументПСК КАК ВТ_ДокументПСК
	|		ПО ЗначенияПСКРазделыПСК.Ссылка = ВТ_ДокументПСК.Ссылка
	|ГДЕ
	|	ЗначенияПСКРазделыПСК.ЗначениеПСК > 0
	|	И ЗначенияПСКРазделыПСК.Ссылка.Проведен = ИСТИНА"; 
	
	Если ВидОтчета = 0 Тогда		
		НачалоПериода = НачалоКвартала(ДатаОкончанияОтчетногоПериода);
		ОкончаниеПериода = КонецКвартала(ДатаОкончанияОтчетногоПериода);
		
		ЗапросПоПСК.УстановитьПараметр("ДатаНачала", ДатаОкончанияОтчетногоПериода);
		ЗапросПоПСК.УстановитьПараметр("ДатаОкончания", ДатаОкончанияОтчетногоПериода);		
		КолДопКолонок = 0;
	Иначе
		НачалоПериода = НачалоМесяца(ДатаНачалаОтчетногоПериода);
		ОкончаниеПериода = КонецМесяца(ДатаОкончанияОтчетногоПериода);    
		
		ЗапросПоПСК.УстановитьПараметр("ДатаНачала", ДатаНачалаОтчетногоПериода);
		ЗапросПоПСК.УстановитьПараметр("ДатаОкончания", ДатаОкончанияОтчетногоПериода);	
		КолДопКолонок = 1;
	КонецЕсли;
	
	ЗапросПоПСК.УстановитьПараметр("Раздел6", Справочники.Разделы.Раздел6);
	
	ТЗПоПСК = ЗапросПоПСК.Выполнить().Выгрузить(); 	
	
	Если 1 = 1 Тогда // Текст запроса скрываю
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел.Код = ""2_1""
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел.Код = ""2_1_1""
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_1_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_1_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_1_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_1_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_1_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_1_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_2_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_2_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_2_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_2_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_2_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_2_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_3_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_3_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_3_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_3_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_4)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_4,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_4_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_4_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_4_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_4_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_5)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_5,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_5_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_5_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_5_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_5_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_6)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_6,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_7)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_7,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_7_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_7_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_7_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_7_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_7_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_7_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_8)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_8,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_8_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_8_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_8_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_8_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_8_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_8_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_9)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_9,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_10)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_10,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_11)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_11,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_12)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_12,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_12_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_12_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_12_1_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_12_1_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_12_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_12_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_12_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_12_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_12_4)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_12_4,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_13)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_1_13,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_2_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_1_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_2_1_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_1_1_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_2_1_1_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_1_1_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_2_1_1_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_1_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_2_1_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_1_2_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_2_1_2_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_1_2_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_2_1_2_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_2_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_2_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_3_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_2_3_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_4)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_2_4,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_1_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_1_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_1_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_1_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_1_2_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_1_2_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_1_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_1_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_1_3_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_1_3_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_1_3_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_1_3_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_1_3_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_1_3_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_2_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_2_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_2_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_2_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_2_2_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_2_2_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_2_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_2_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_2_3_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_2_3_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_2_3_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_2_3_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_2_3_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_2_3_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_3_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_3_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_3_1_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_3_1_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_3_1_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_3_1_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_3_1_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_3_1_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_3_1_4)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_3_1_4,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_3_1_5)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_3_1_5,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_3_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел2_3_3_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_4)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_4,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_4_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_4_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_4_1_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_4_1_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_4_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_4_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_4_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_4_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_4_4)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_4_4,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_4_5)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_4_5,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_5)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_5,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_5_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_5_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_5_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_5_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_5_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_5_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_5_3_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_5_3_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_5_4)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_5_4,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_5_5)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_5_5,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_5_6)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_5_6,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_9)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_9,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_9_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_9_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_9_1_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_9_1_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_9_1_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_9_1_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_10)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_10,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_10_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_10_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_10_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел3_10_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_11)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_11,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_11_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_11_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_11_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_11_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_12)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_12,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_12_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_12_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_12_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_12_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_13)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_13,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_13_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_13_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_13_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_13_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_14)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_14,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_14_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_14_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_14_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_14_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_14_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_14_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_14_3_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_14_3_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_14_3_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_14_3_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_15)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_15,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_15_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_15_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_15_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_15_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_15_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_15_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_17)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_17,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_17_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_17_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_17_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_17_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_17_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_17_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_17_4)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_17_4,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_17_5)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_17_5,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_18)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_18,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_18_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_18_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_18_1_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_18_1_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_18_1_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_18_1_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_18_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_18_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_18_2_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_18_2_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_18_2_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_18_2_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_19,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_19_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_1_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_19_1_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_19_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_2_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_19_2_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_19_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_3_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_19_3_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_3_1_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_19_3_1_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_3_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_19_3_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_3_2_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_19_3_2_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_3_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_19_3_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_3_3_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_19_3_3_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_20)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_20,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_21)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_21,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_22)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_22,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_22_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_22_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_22_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_22_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_23,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_23_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_1_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_23_1_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_23_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_2_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_23_2_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_23_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_3_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_23_3_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_3_1_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_23_3_1_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_3_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_23_3_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_3_2_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_23_3_2_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_3_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_23_3_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_3_3_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_23_3_3_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_24)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_24,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_24_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_24_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_24_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_24_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_24_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_24_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_25)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_25,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_25_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_25_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_25_1_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_25_1_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_25_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_25_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_25_2_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_25_2_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_26)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_26,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_27)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_27,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_29)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_29,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_29_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_29_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_29_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_29_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_29_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_29_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_30)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_30,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_30_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_30_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_30_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_30_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_30_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_30_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_31)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_31,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_31_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_31_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_31_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_31_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_31_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_31_3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_32)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_32,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_32_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_32_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_32_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_32_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_33)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_33,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_35)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_35,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_35_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_35_1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_35_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел4_35_2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел11_1)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел11_ФН1,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел11_2)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел11_ФН2,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел11_3)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел11_ФН3,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел11_4)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел11_ФН4,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел11_5)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел11_ФН5,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел11_6)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел11_ФН6,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел11_7)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел11_ФН7,
		|	СУММА(ВЫБОР
		|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел11_8)
		|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Раздел11_ФН8,
		|	ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК КАК КПК,
		|	ЕСТЬNULL(ОтчетностьКПКТаблицаПоказателей.Ссылка, НЕОПРЕДЕЛЕНО) КАК ДокументОтчетности
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	Документ.ОтчетностьКПК.ТаблицаПоказателей КАК ОтчетностьКПКТаблицаПоказателей
		|ГДЕ
		|	ОтчетностьКПКТаблицаПоказателей.Ссылка.ДатаОкончанияОтчетногоПериода МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ОтчетностьКПКТаблицаПоказателей.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ОтчетностьКПКТаблицаПоказателей.Ссылка.ИспользоватьДокумент = ИСТИНА
		|	#ОтборПоКПК#
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК,
		|	ЕСТЬNULL(ОтчетностьКПКТаблицаПоказателей.Ссылка, НЕОПРЕДЕЛЕНО)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК КПК,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1, 0)) КАК Раздел2_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_1, 0)) КАК Раздел2_1_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_1_1, 0)) КАК Раздел2_1_1_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_1_2, 0)) КАК Раздел2_1_1_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_1_3, 0)) КАК Раздел2_1_1_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_2, 0)) КАК Раздел2_1_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_2_1, 0)) КАК Раздел2_1_2_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_2_2, 0)) КАК Раздел2_1_2_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_2_3, 0)) КАК Раздел2_1_2_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_3, 0)) КАК Раздел2_1_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_3_1, 0)) КАК Раздел2_1_3_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_3_2, 0)) КАК Раздел2_1_3_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_4, 0)) КАК Раздел2_1_4,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_4_1, 0)) КАК Раздел2_1_4_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_4_2, 0)) КАК Раздел2_1_4_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_5, 0)) КАК Раздел2_1_5,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_5_1, 0)) КАК Раздел2_1_5_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_5_2, 0)) КАК Раздел2_1_5_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_6, 0)) КАК Раздел2_1_6,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_7, 0)) КАК Раздел2_1_7,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_7_1, 0)) КАК Раздел2_1_7_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_7_2, 0)) КАК Раздел2_1_7_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_7_3, 0)) КАК Раздел2_1_7_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_8, 0)) КАК Раздел2_1_8,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_8_1, 0)) КАК Раздел2_1_8_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_8_2, 0)) КАК Раздел2_1_8_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_8_3, 0)) КАК Раздел2_1_8_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_9, 0)) КАК Раздел2_1_9,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_10, 0)) КАК Раздел2_1_10,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_11, 0)) КАК Раздел2_1_11,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_12, 0)) КАК Раздел2_1_12,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_12_1, 0)) КАК Раздел2_1_12_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_12_1_1, 0)) КАК Раздел2_1_12_1_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_12_2, 0)) КАК Раздел2_1_12_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_12_3, 0)) КАК Раздел2_1_12_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_12_4, 0)) КАК Раздел2_1_12_4,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_13, 0)) КАК Раздел2_1_13,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2, 0)) КАК Раздел2_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_1, 0)) КАК Раздел2_2_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_1_1, 0)) КАК Раздел2_2_1_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_1_1_1, 0)) КАК Раздел2_2_1_1_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_1_1_2, 0)) КАК Раздел2_2_1_1_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_1_2, 0)) КАК Раздел2_2_1_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_1_2_1, 0)) КАК Раздел2_2_1_2_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_1_2_2, 0)) КАК Раздел2_2_1_2_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_2, 0)) КАК Раздел2_2_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_3, 0)) КАК Раздел2_2_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_3_1, 0)) КАК Раздел2_2_3_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_4, 0)) КАК Раздел2_2_4,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3, 0)) КАК Раздел2_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_1, 0)) КАК Раздел2_3_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_1_1, 0)) КАК Раздел2_3_1_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_1_2, 0)) КАК Раздел2_3_1_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_1_2_1, 0)) КАК Раздел2_3_1_2_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_1_3, 0)) КАК Раздел2_3_1_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_1_3_1, 0)) КАК Раздел2_3_1_3_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_1_3_2, 0)) КАК Раздел2_3_1_3_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_1_3_3, 0)) КАК Раздел2_3_1_3_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_2, 0)) КАК Раздел2_3_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_2_1, 0)) КАК Раздел2_3_2_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_2_2, 0)) КАК Раздел2_3_2_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_2_2_1, 0)) КАК Раздел2_3_2_2_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_2_3, 0)) КАК Раздел2_3_2_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_2_3_1, 0)) КАК Раздел2_3_2_3_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_2_3_2, 0)) КАК Раздел2_3_2_3_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_2_3_3, 0)) КАК Раздел2_3_2_3_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_3, 0)) КАК Раздел2_3_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_3_1, 0)) КАК Раздел2_3_3_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_3_1_1, 0)) КАК Раздел2_3_3_1_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_3_1_2, 0)) КАК Раздел2_3_3_1_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_3_1_3, 0)) КАК Раздел2_3_3_1_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_3_1_4, 0)) КАК Раздел2_3_3_1_4,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_3_1_5, 0)) КАК Раздел2_3_3_1_5,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_3_2, 0)) КАК Раздел2_3_3_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_4, 0)) КАК Раздел3_4,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_4_1, 0)) КАК Раздел3_4_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_4_1_1, 0)) КАК Раздел3_4_1_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_4_2, 0)) КАК Раздел3_4_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_4_3, 0)) КАК Раздел3_4_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_4_4, 0)) КАК Раздел3_4_4,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_4_5, 0)) КАК Раздел3_4_5,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_5, 0)) КАК Раздел3_5,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_5_1, 0)) КАК Раздел3_5_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_5_2, 0)) КАК Раздел3_5_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_5_3, 0)) КАК Раздел3_5_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_5_3_1, 0)) КАК Раздел3_5_3_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_5_4, 0)) КАК Раздел3_5_4,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_5_5, 0)) КАК Раздел3_5_5,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_5_6, 0)) КАК Раздел3_5_6,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_9, 0)) КАК Раздел3_9,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_9_1, 0)) КАК Раздел3_9_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_9_1_1, 0)) КАК Раздел3_9_1_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_9_1_2, 0)) КАК Раздел3_9_1_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_10, 0)) КАК Раздел3_10,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_10_1, 0)) КАК Раздел3_10_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_10_2, 0)) КАК Раздел3_10_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_11, 0)) КАК Раздел4_11,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_11_1, 0)) КАК Раздел4_11_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_11_2, 0)) КАК Раздел4_11_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_12, 0)) КАК Раздел4_12,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_12_1, 0)) КАК Раздел4_12_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_12_2, 0)) КАК Раздел4_12_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_13, 0)) КАК Раздел4_13,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_13_1, 0)) КАК Раздел4_13_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_13_2, 0)) КАК Раздел4_13_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_14, 0)) КАК Раздел4_14,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_14_1, 0)) КАК Раздел4_14_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_14_2, 0)) КАК Раздел4_14_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_14_3, 0)) КАК Раздел4_14_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_14_3_1, 0)) КАК Раздел4_14_3_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_14_3_2, 0)) КАК Раздел4_14_3_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_15, 0)) КАК Раздел4_15,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_15_1, 0)) КАК Раздел4_15_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_15_2, 0)) КАК Раздел4_15_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_15_3, 0)) КАК Раздел4_15_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_17, 0)) КАК Раздел4_17,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_17_1, 0)) КАК Раздел4_17_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_17_2, 0)) КАК Раздел4_17_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_17_3, 0)) КАК Раздел4_17_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_17_4, 0)) КАК Раздел4_17_4,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_17_5, 0)) КАК Раздел4_17_5,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_18, 0)) КАК Раздел4_18,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_18_1, 0)) КАК Раздел4_18_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_18_1_1, 0)) КАК Раздел4_18_1_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_18_1_2, 0)) КАК Раздел4_18_1_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_18_2, 0)) КАК Раздел4_18_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_18_2_1, 0)) КАК Раздел4_18_2_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_18_2_2, 0)) КАК Раздел4_18_2_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19, 0)) КАК Раздел4_19,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_1, 0)) КАК Раздел4_19_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_1_1, 0)) КАК Раздел4_19_1_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_2, 0)) КАК Раздел4_19_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_2_1, 0)) КАК Раздел4_19_2_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_3, 0)) КАК Раздел4_19_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_3_1, 0)) КАК Раздел4_19_3_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_3_1_1, 0)) КАК Раздел4_19_3_1_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_3_2, 0)) КАК Раздел4_19_3_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_3_2_1, 0)) КАК Раздел4_19_3_2_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_3_3, 0)) КАК Раздел4_19_3_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_3_3_1, 0)) КАК Раздел4_19_3_3_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_20, 0)) КАК Раздел4_20,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_21, 0)) КАК Раздел4_21,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_22, 0)) КАК Раздел4_22,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_22_1, 0)) КАК Раздел4_22_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_22_2, 0)) КАК Раздел4_22_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23, 0)) КАК Раздел4_23,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_1, 0)) КАК Раздел4_23_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_1_1, 0)) КАК Раздел4_23_1_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_2, 0)) КАК Раздел4_23_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_2_1, 0)) КАК Раздел4_23_2_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_3, 0)) КАК Раздел4_23_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_3_1, 0)) КАК Раздел4_23_3_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_3_1_1, 0)) КАК Раздел4_23_3_1_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_3_2, 0)) КАК Раздел4_23_3_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_3_2_1, 0)) КАК Раздел4_23_3_2_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_3_3, 0)) КАК Раздел4_23_3_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_3_3_1, 0)) КАК Раздел4_23_3_3_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_24, 0)) КАК Раздел4_24,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_24_1, 0)) КАК Раздел4_24_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_24_2, 0)) КАК Раздел4_24_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_24_3, 0)) КАК Раздел4_24_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_25, 0)) КАК Раздел4_25,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_25_1, 0)) КАК Раздел4_25_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_25_1_1, 0)) КАК Раздел4_25_1_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_25_2, 0)) КАК Раздел4_25_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_25_2_1, 0)) КАК Раздел4_25_2_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_26, 0)) КАК Раздел4_26,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_27, 0)) КАК Раздел4_27,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_29, 0)) КАК Раздел4_29,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_29_1, 0)) КАК Раздел4_29_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_29_2, 0)) КАК Раздел4_29_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_29_3, 0)) КАК Раздел4_29_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_30, 0)) КАК Раздел4_30,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_30_1, 0)) КАК Раздел4_30_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_30_2, 0)) КАК Раздел4_30_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_30_3, 0)) КАК Раздел4_30_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_31, 0)) КАК Раздел4_31,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_31_1, 0)) КАК Раздел4_31_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_31_2, 0)) КАК Раздел4_31_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_31_3, 0)) КАК Раздел4_31_3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_32, 0)) КАК Раздел4_32,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_32_1, 0)) КАК Раздел4_32_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_32_2, 0)) КАК Раздел4_32_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_33, 0)) КАК Раздел4_33,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_35, 0)) КАК Раздел4_35,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_35_1, 0)) КАК Раздел4_35_1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_35_2, 0)) КАК Раздел4_35_2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел11_ФН1, 0)) КАК Раздел11_ФН1,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел11_ФН2, 0)) КАК Раздел11_ФН2,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел11_ФН3, 0)) КАК Раздел11_ФН3,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел11_ФН4, 0)) КАК Раздел11_ФН4,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел11_ФН5, 0)) КАК Раздел11_ФН5,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел11_ФН6, 0)) КАК Раздел11_ФН6,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел11_ФН7, 0)) КАК Раздел11_ФН7,
		|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел11_ФН8, 0)) КАК Раздел11_ФН8,
		|	Контрагенты.НомерВРеестреСРО КАК НомерВРеестреСРО,
		|	НЕ ВременнаяТаблица.КПК ЕСТЬ NULL КАК ЕстьДокумент,
		|	ВременнаяТаблица.ДокументОтчетности КАК ДокументОтчетности
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		#СоединениеПоКПК# СОЕДИНЕНИЕ ВременнаяТаблица КАК ВременнаяТаблица
		|		ПО (ВременнаяТаблица.КПК = Контрагенты.Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	Контрагенты.Ссылка,
		|	Контрагенты.НомерВРеестреСРО,
		|	НЕ ВременнаяТаблица.КПК ЕСТЬ NULL,
		|	ВременнаяТаблица.ДокументОтчетности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.КПК КАК КПК,
		|	СУММА(ВТ.Раздел11_ФН1) КАК Раздел11_ФН1,
		|	СУММА(ВТ.Раздел11_ФН2) КАК Раздел11_ФН2,
		|	СУММА(ВТ.Раздел11_ФН3) КАК Раздел11_ФН3,
		|	СУММА(ВТ.Раздел11_ФН4) КАК Раздел11_ФН4,
		|	СУММА(ВТ.Раздел11_ФН5) КАК Раздел11_ФН5,
		|	СУММА(ВТ.Раздел11_ФН6) КАК Раздел11_ФН6,
		|	СУММА(ВТ.Раздел11_ФН7) КАК Раздел11_ФН7,
		|	СУММА(ВТ.Раздел11_ФН8) КАК Раздел11_ФН8,
		|	СУММА(ВТ.НомерВРеестреСРО) КАК НомерВРеестреСРО,
		|	ВЫБОР
		|		КОГДА СУММА(ВТ.Раздел2_3_1_1) + СУММА(ВТ.Раздел2_3_1_2) + СУММА(ВТ.Раздел2_3_2_1) + СУММА(ВТ.Раздел2_3_2_2) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ВТ.Раздел2_2_2) / (СУММА(ВТ.Раздел2_3_1_1) + СУММА(ВТ.Раздел2_3_1_2) + СУММА(ВТ.Раздел2_3_2_1) + СУММА(ВТ.Раздел2_3_2_2)) * 100 КАК ЧИСЛО(15, 1))
		|	КОНЕЦ КАК ФН1Расчетный,
		|	ВЫБОР
		|		КОГДА СУММА(ВТ.Раздел2_3_1_1) + СУММА(ВТ.Раздел2_3_1_2) + СУММА(ВТ.Раздел2_3_2_1) + СУММА(ВТ.Раздел2_3_2_2) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ((СУММА(ВТ.Раздел4_20) - СУММА(ВТ.Раздел4_21)) / (СУММА(ВТ.Раздел2_3_1_1) + СУММА(ВТ.Раздел2_3_1_2) + СУММА(ВТ.Раздел2_3_2_1) + СУММА(ВТ.Раздел2_3_2_2)) * 100 КАК ЧИСЛО(15, 1))
		|	КОНЕЦ КАК ФН2Расчетный,
		|	ВЫБОР
		|		КОГДА СУММА(ВТ.Раздел2_1_1) + СУММА(ВТ.Раздел2_1_2) + СУММА(ВТ.Раздел4_35_1) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ((СУММА(ВТ.Раздел4_26) - СУММА(ВТ.Раздел4_27)) / (СУММА(ВТ.Раздел2_1_1) + СУММА(ВТ.Раздел2_1_2) + СУММА(ВТ.Раздел4_35_1)) * 100 КАК ЧИСЛО(15, 1))
		|	КОНЕЦ КАК ФН3Расчетный,
		|	ВЫБОР
		|		КОГДА СУММА(ВТ.Раздел2_3_1_1) + СУММА(ВТ.Раздел2_3_1_2) + СУММА(ВТ.Раздел2_3_2_1) + СУММА(ВТ.Раздел2_3_2_2) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ВТ.Раздел2_2_1) / (СУММА(ВТ.Раздел2_3_1_1) + СУММА(ВТ.Раздел2_3_1_2) + СУММА(ВТ.Раздел2_3_2_1) + СУММА(ВТ.Раздел2_3_2_2)) * 100 КАК ЧИСЛО(15, 1))
		|	КОНЕЦ КАК ФН4Расчетный,
		|	ВЫБОР
		|		КОГДА СУММА(ВТ.Раздел2_3_1_1) + СУММА(ВТ.Раздел2_3_1_2) + СУММА(ВТ.Раздел2_3_2_1) + СУММА(ВТ.Раздел2_3_2_2) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ((СУММА(ВТ.Раздел2_3_1_3) + СУММА(ВТ.Раздел2_3_2_3)) / (СУММА(ВТ.Раздел2_3_1_1) + СУММА(ВТ.Раздел2_3_1_2) + СУММА(ВТ.Раздел2_3_2_1) + СУММА(ВТ.Раздел2_3_2_2)) * 100 КАК ЧИСЛО(15, 1))
		|	КОНЕЦ КАК ФН5Расчетный,
		|	ВЫБОР
		|		КОГДА СУММА(ВТ.Раздел2_2_1) + СУММА(ВТ.Раздел2_3_1) + СУММА(ВТ.Раздел2_3_2) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ((СУММА(ВТ.Раздел2_1_1_3) + СУММА(ВТ.Раздел2_1_2_3)) / (СУММА(ВТ.Раздел2_2_1) + СУММА(ВТ.Раздел2_3_1) + СУММА(ВТ.Раздел2_3_2)) * 100 КАК ЧИСЛО(15, 1))
		|	КОНЕЦ КАК ФН6Расчетный,
		|	ВЫБОР
		|		КОГДА СУММА(ВТ.Раздел2_3_1) + СУММА(ВТ.Раздел2_3_2) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ((СУММА(ВТ.Раздел2_1_1) + СУММА(ВТ.Раздел2_1_2) + СУММА(ВТ.Раздел2_1_3_2) + СУММА(ВТ.Раздел2_1_4_2) + СУММА(ВТ.Раздел2_1_12_1_1) + СУММА(ВТ.Раздел2_1_12_2) + СУММА(ВТ.Раздел2_1_12_3) + СУММА(ВТ.Раздел2_1_12_4)) / (СУММА(ВТ.Раздел2_3_1) + СУММА(ВТ.Раздел2_3_2)) * 100 КАК ЧИСЛО(15, 1))
		|	КОНЕЦ КАК ФН7Расчетный,
		|	ВЫБОР
		|		КОГДА СУММА(ВТ.Раздел2_3_1) + СУММА(ВТ.Раздел2_3_3) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ((СУММА(ВТ.Раздел2_1_1) + СУММА(ВТ.Раздел2_1_3) + СУММА(ВТ.Раздел2_1_8)) / (СУММА(ВТ.Раздел2_3_1) + СУММА(ВТ.Раздел2_3_3)) * 100 КАК ЧИСЛО(15, 1))
		|	КОНЕЦ КАК ФН8Расчетный,
		|	ВТ.ЕстьДокумент КАК ЕстьДокумент,
		|	СУММА(ВТ.Раздел2_1) КАК Раздел2_1,
		|	СУММА(ВТ.Раздел2_1_1) КАК Раздел2_1_1,
		|	СУММА(ВТ.Раздел2_1_1_1) КАК Раздел2_1_1_1,
		|	СУММА(ВТ.Раздел2_1_1_2) КАК Раздел2_1_1_2,
		|	СУММА(ВТ.Раздел2_1_1_3) КАК Раздел2_1_1_3,
		|	СУММА(ВТ.Раздел2_1_2) КАК Раздел2_1_2,
		|	СУММА(ВТ.Раздел2_1_2_1) КАК Раздел2_1_2_1,
		|	СУММА(ВТ.Раздел2_1_2_2) КАК Раздел2_1_2_2,
		|	СУММА(ВТ.Раздел2_1_2_3) КАК Раздел2_1_2_3,
		|	СУММА(ВТ.Раздел2_1_3) КАК Раздел2_1_3,
		|	СУММА(ВТ.Раздел2_1_3_1) КАК Раздел2_1_3_1,
		|	СУММА(ВТ.Раздел2_1_3_2) КАК Раздел2_1_3_2,
		|	СУММА(ВТ.Раздел2_1_4) КАК Раздел2_1_4,
		|	СУММА(ВТ.Раздел2_1_4_1) КАК Раздел2_1_4_1,
		|	СУММА(ВТ.Раздел2_1_4_2) КАК Раздел2_1_4_2,
		|	СУММА(ВТ.Раздел2_1_5) КАК Раздел2_1_5,
		|	СУММА(ВТ.Раздел2_1_5_1) КАК Раздел2_1_5_1,
		|	СУММА(ВТ.Раздел2_1_5_2) КАК Раздел2_1_5_2,
		|	СУММА(ВТ.Раздел2_1_6) КАК Раздел2_1_6,
		|	СУММА(ВТ.Раздел2_1_7) КАК Раздел2_1_7,
		|	СУММА(ВТ.Раздел2_1_7_1) КАК Раздел2_1_7_1,
		|	СУММА(ВТ.Раздел2_1_7_2) КАК Раздел2_1_7_2,
		|	СУММА(ВТ.Раздел2_1_7_3) КАК Раздел2_1_7_3,
		|	СУММА(ВТ.Раздел2_1_8) КАК Раздел2_1_8,
		|	СУММА(ВТ.Раздел2_1_8_1) КАК Раздел2_1_8_1,
		|	СУММА(ВТ.Раздел2_1_8_2) КАК Раздел2_1_8_2,
		|	СУММА(ВТ.Раздел2_1_8_3) КАК Раздел2_1_8_3,
		|	СУММА(ВТ.Раздел2_1_9) КАК Раздел2_1_9,
		|	СУММА(ВТ.Раздел2_1_10) КАК Раздел2_1_10,
		|	СУММА(ВТ.Раздел2_1_11) КАК Раздел2_1_11,
		|	СУММА(ВТ.Раздел2_1_12) КАК Раздел2_1_12,
		|	СУММА(ВТ.Раздел2_1_12_1) КАК Раздел2_1_12_1,
		|	СУММА(ВТ.Раздел2_1_12_1_1) КАК Раздел2_1_12_1_1,
		|	СУММА(ВТ.Раздел2_1_12_2) КАК Раздел2_1_12_2,
		|	СУММА(ВТ.Раздел2_1_12_3) КАК Раздел2_1_12_3,
		|	СУММА(ВТ.Раздел2_1_12_4) КАК Раздел2_1_12_4,
		|	СУММА(ВТ.Раздел2_1_13) КАК Раздел2_1_13,
		|	СУММА(ВТ.Раздел2_2) КАК Раздел2_2,
		|	СУММА(ВТ.Раздел2_2_1) КАК Раздел2_2_1,
		|	СУММА(ВТ.Раздел2_2_1_1) КАК Раздел2_2_1_1,
		|	СУММА(ВТ.Раздел2_2_1_1_1) КАК Раздел2_2_1_1_1,
		|	СУММА(ВТ.Раздел2_2_1_1_2) КАК Раздел2_2_1_1_2,
		|	СУММА(ВТ.Раздел2_2_1_2) КАК Раздел2_2_1_2,
		|	СУММА(ВТ.Раздел2_2_1_2_1) КАК Раздел2_2_1_2_1,
		|	СУММА(ВТ.Раздел2_2_1_2_2) КАК Раздел2_2_1_2_2,
		|	СУММА(ВТ.Раздел2_2_2) КАК Раздел2_2_2,
		|	СУММА(ВТ.Раздел2_2_3) КАК Раздел2_2_3,
		|	СУММА(ВТ.Раздел2_2_3_1) КАК Раздел2_2_3_1,
		|	СУММА(ВТ.Раздел2_2_4) КАК Раздел2_2_4,
		|	СУММА(ВТ.Раздел2_3) КАК Раздел2_3,
		|	СУММА(ВТ.Раздел2_3_1) КАК Раздел2_3_1,
		|	СУММА(ВТ.Раздел2_3_1_1) КАК Раздел2_3_1_1,
		|	СУММА(ВТ.Раздел2_3_1_2) КАК Раздел2_3_1_2,
		|	СУММА(ВТ.Раздел2_3_1_2_1) КАК Раздел2_3_1_2_1,
		|	СУММА(ВТ.Раздел2_3_1_3) КАК Раздел2_3_1_3,
		|	СУММА(ВТ.Раздел2_3_1_3_1) КАК Раздел2_3_1_3_1,
		|	СУММА(ВТ.Раздел2_3_1_3_2) КАК Раздел2_3_1_3_2,
		|	СУММА(ВТ.Раздел2_3_1_3_3) КАК Раздел2_3_1_3_3,
		|	СУММА(ВТ.Раздел2_3_2) КАК Раздел2_3_2,
		|	СУММА(ВТ.Раздел2_3_2_1) КАК Раздел2_3_2_1,
		|	СУММА(ВТ.Раздел2_3_2_2) КАК Раздел2_3_2_2,
		|	СУММА(ВТ.Раздел2_3_2_2_1) КАК Раздел2_3_2_2_1,
		|	СУММА(ВТ.Раздел2_3_2_3) КАК Раздел2_3_2_3,
		|	СУММА(ВТ.Раздел2_3_2_3_1) КАК Раздел2_3_2_3_1,
		|	СУММА(ВТ.Раздел2_3_2_3_2) КАК Раздел2_3_2_3_2,
		|	СУММА(ВТ.Раздел2_3_2_3_3) КАК Раздел2_3_2_3_3,
		|	СУММА(ВТ.Раздел2_3_3) КАК Раздел2_3_3,
		|	СУММА(ВТ.Раздел2_3_3_1) КАК Раздел2_3_3_1,
		|	СУММА(ВТ.Раздел2_3_3_1_1) КАК Раздел2_3_3_1_1,
		|	СУММА(ВТ.Раздел2_3_3_1_2) КАК Раздел2_3_3_1_2,
		|	СУММА(ВТ.Раздел2_3_3_1_3) КАК Раздел2_3_3_1_3,
		|	СУММА(ВТ.Раздел2_3_3_1_4) КАК Раздел2_3_3_1_4,
		|	СУММА(ВТ.Раздел2_3_3_1_5) КАК Раздел2_3_3_1_5,
		|	СУММА(ВТ.Раздел2_3_3_2) КАК Раздел2_3_3_2,
		|	СУММА(ВТ.Раздел3_4) КАК Раздел3_4,
		|	СУММА(ВТ.Раздел3_4_1) КАК Раздел3_4_1,
		|	СУММА(ВТ.Раздел3_4_1_1) КАК Раздел3_4_1_1,
		|	СУММА(ВТ.Раздел3_4_2) КАК Раздел3_4_2,
		|	СУММА(ВТ.Раздел3_4_3) КАК Раздел3_4_3,
		|	СУММА(ВТ.Раздел3_4_4) КАК Раздел3_4_4,
		|	СУММА(ВТ.Раздел3_4_5) КАК Раздел3_4_5,
		|	СУММА(ВТ.Раздел3_5) КАК Раздел3_5,
		|	СУММА(ВТ.Раздел3_5_1) КАК Раздел3_5_1,
		|	СУММА(ВТ.Раздел3_5_2) КАК Раздел3_5_2,
		|	СУММА(ВТ.Раздел3_5_3) КАК Раздел3_5_3,
		|	СУММА(ВТ.Раздел3_5_3_1) КАК Раздел3_5_3_1,
		|	СУММА(ВТ.Раздел3_5_4) КАК Раздел3_5_4,
		|	СУММА(ВТ.Раздел3_5_5) КАК Раздел3_5_5,
		|	СУММА(ВТ.Раздел3_5_6) КАК Раздел3_5_6,
		|	СУММА(ВТ.Раздел3_9) КАК Раздел3_9,
		|	СУММА(ВТ.Раздел3_9_1) КАК Раздел3_9_1,
		|	СУММА(ВТ.Раздел3_9_1_1) КАК Раздел3_9_1_1,
		|	СУММА(ВТ.Раздел3_9_1_2) КАК Раздел3_9_1_2,
		|	СУММА(ВТ.Раздел3_10) КАК Раздел3_10,
		|	СУММА(ВТ.Раздел3_10_1) КАК Раздел3_10_1,
		|	СУММА(ВТ.Раздел3_10_2) КАК Раздел3_10_2,
		|	СУММА(ВТ.Раздел4_11) КАК Раздел4_11,
		|	СУММА(ВТ.Раздел4_11_1) КАК Раздел4_11_1,
		|	СУММА(ВТ.Раздел4_11_2) КАК Раздел4_11_2,
		|	СУММА(ВТ.Раздел4_12) КАК Раздел4_12,
		|	СУММА(ВТ.Раздел4_12_1) КАК Раздел4_12_1,
		|	СУММА(ВТ.Раздел4_12_2) КАК Раздел4_12_2,
		|	СУММА(ВТ.Раздел4_13) КАК Раздел4_13,
		|	СУММА(ВТ.Раздел4_13_1) КАК Раздел4_13_1,
		|	СУММА(ВТ.Раздел4_13_2) КАК Раздел4_13_2,
		|	СУММА(ВТ.Раздел4_14) КАК Раздел4_14,
		|	СУММА(ВТ.Раздел4_14_1) КАК Раздел4_14_1,
		|	СУММА(ВТ.Раздел4_14_2) КАК Раздел4_14_2,
		|	СУММА(ВТ.Раздел4_14_3) КАК Раздел4_14_3,
		|	СУММА(ВТ.Раздел4_14_3_1) КАК Раздел4_14_3_1,
		|	СУММА(ВТ.Раздел4_14_3_2) КАК Раздел4_14_3_2,
		|	СУММА(ВТ.Раздел4_15) КАК Раздел4_15,
		|	СУММА(ВТ.Раздел4_15_1) КАК Раздел4_15_1,
		|	СУММА(ВТ.Раздел4_15_2) КАК Раздел4_15_2,
		|	СУММА(ВТ.Раздел4_15_3) КАК Раздел4_15_3,
		|	СУММА(ВТ.Раздел4_17) КАК Раздел4_17,
		|	СУММА(ВТ.Раздел4_17_1) КАК Раздел4_17_1,
		|	СУММА(ВТ.Раздел4_17_2) КАК Раздел4_17_2,
		|	СУММА(ВТ.Раздел4_17_3) КАК Раздел4_17_3,
		|	СУММА(ВТ.Раздел4_17_4) КАК Раздел4_17_4,
		|	СУММА(ВТ.Раздел4_17_5) КАК Раздел4_17_5,
		|	СУММА(ВТ.Раздел4_18) КАК Раздел4_18,
		|	СУММА(ВТ.Раздел4_18_1) КАК Раздел4_18_1,
		|	СУММА(ВТ.Раздел4_18_1_1) КАК Раздел4_18_1_1,
		|	СУММА(ВТ.Раздел4_18_1_2) КАК Раздел4_18_1_2,
		|	СУММА(ВТ.Раздел4_18_2) КАК Раздел4_18_2,
		|	СУММА(ВТ.Раздел4_18_2_1) КАК Раздел4_18_2_1,
		|	СУММА(ВТ.Раздел4_18_2_2) КАК Раздел4_18_2_2,
		|	СУММА(ВТ.Раздел4_19) КАК Раздел4_19,
		|	СУММА(ВТ.Раздел4_19_1) КАК Раздел4_19_1,
		|	СУММА(ВТ.Раздел4_19_1_1) КАК Раздел4_19_1_1,
		|	СУММА(ВТ.Раздел4_19_2) КАК Раздел4_19_2,
		|	СУММА(ВТ.Раздел4_19_2_1) КАК Раздел4_19_2_1,
		|	СУММА(ВТ.Раздел4_19_3) КАК Раздел4_19_3,
		|	СУММА(ВТ.Раздел4_19_3_1) КАК Раздел4_19_3_1,
		|	СУММА(ВТ.Раздел4_19_3_1_1) КАК Раздел4_19_3_1_1,
		|	СУММА(ВТ.Раздел4_19_3_2) КАК Раздел4_19_3_2,
		|	СУММА(ВТ.Раздел4_19_3_2_1) КАК Раздел4_19_3_2_1,
		|	СУММА(ВТ.Раздел4_19_3_3) КАК Раздел4_19_3_3,
		|	СУММА(ВТ.Раздел4_19_3_3_1) КАК Раздел4_19_3_3_1,
		|	СУММА(ВТ.Раздел4_20) КАК Раздел4_20,
		|	СУММА(ВТ.Раздел4_21) КАК Раздел4_21,
		|	СУММА(ВТ.Раздел4_22) КАК Раздел4_22,
		|	СУММА(ВТ.Раздел4_22_1) КАК Раздел4_22_1,
		|	СУММА(ВТ.Раздел4_22_2) КАК Раздел4_22_2,
		|	СУММА(ВТ.Раздел4_23) КАК Раздел4_23,
		|	СУММА(ВТ.Раздел4_23_1) КАК Раздел4_23_1,
		|	СУММА(ВТ.Раздел4_23_1_1) КАК Раздел4_23_1_1,
		|	СУММА(ВТ.Раздел4_23_2) КАК Раздел4_23_2,
		|	СУММА(ВТ.Раздел4_23_2_1) КАК Раздел4_23_2_1,
		|	СУММА(ВТ.Раздел4_23_3) КАК Раздел4_23_3,
		|	СУММА(ВТ.Раздел4_23_3_1) КАК Раздел4_23_3_1,
		|	СУММА(ВТ.Раздел4_23_3_1_1) КАК Раздел4_23_3_1_1,
		|	СУММА(ВТ.Раздел4_23_3_2) КАК Раздел4_23_3_2,
		|	СУММА(ВТ.Раздел4_23_3_2_1) КАК Раздел4_23_3_2_1,
		|	СУММА(ВТ.Раздел4_23_3_3) КАК Раздел4_23_3_3,
		|	СУММА(ВТ.Раздел4_23_3_3_1) КАК Раздел4_23_3_3_1,
		|	СУММА(ВТ.Раздел4_24) КАК Раздел4_24,
		|	СУММА(ВТ.Раздел4_24_1) КАК Раздел4_24_1,
		|	СУММА(ВТ.Раздел4_24_2) КАК Раздел4_24_2,
		|	СУММА(ВТ.Раздел4_24_3) КАК Раздел4_24_3,
		|	СУММА(ВТ.Раздел4_25) КАК Раздел4_25,
		|	СУММА(ВТ.Раздел4_25_1) КАК Раздел4_25_1,
		|	СУММА(ВТ.Раздел4_25_1_1) КАК Раздел4_25_1_1,
		|	СУММА(ВТ.Раздел4_25_2) КАК Раздел4_25_2,
		|	СУММА(ВТ.Раздел4_25_2_1) КАК Раздел4_25_2_1,
		|	СУММА(ВТ.Раздел4_26) КАК Раздел4_26,
		|	СУММА(ВТ.Раздел4_27) КАК Раздел4_27,
		|	СУММА(ВТ.Раздел4_29) КАК Раздел4_29,
		|	СУММА(ВТ.Раздел4_29_1) КАК Раздел4_29_1,
		|	СУММА(ВТ.Раздел4_29_2) КАК Раздел4_29_2,
		|	СУММА(ВТ.Раздел4_29_3) КАК Раздел4_29_3,
		|	СУММА(ВТ.Раздел4_30) КАК Раздел4_30,
		|	СУММА(ВТ.Раздел4_30_1) КАК Раздел4_30_1,
		|	СУММА(ВТ.Раздел4_30_2) КАК Раздел4_30_2,
		|	СУММА(ВТ.Раздел4_30_3) КАК Раздел4_30_3,
		|	СУММА(ВТ.Раздел4_31) КАК Раздел4_31,
		|	СУММА(ВТ.Раздел4_31_1) КАК Раздел4_31_1,
		|	СУММА(ВТ.Раздел4_31_2) КАК Раздел4_31_2,
		|	СУММА(ВТ.Раздел4_32) КАК Раздел4_32,
		|	СУММА(ВТ.Раздел4_32_1) КАК Раздел4_32_1,
		|	СУММА(ВТ.Раздел4_32_2) КАК Раздел4_32_2,
		|	СУММА(ВТ.Раздел4_33) КАК Раздел4_33,
		|	СУММА(ВТ.Раздел4_31_3) КАК Раздел4_31_3,
		|	СУММА(ВТ.Раздел4_35) КАК Раздел4_35,
		|	СУММА(ВТ.Раздел4_35_1) КАК Раздел4_35_1,
		|	СУММА(ВТ.Раздел4_35_2) КАК Раздел4_35_2,
		|	СУММА(ВТ.Раздел11_ФН1) КАК Раздел11_ФН11,
		|	СУММА(ВТ.Раздел11_ФН2) КАК Раздел11_ФН21,
		|	СУММА(ВТ.Раздел11_ФН3) КАК Раздел11_ФН31,
		|	СУММА(ВТ.Раздел11_ФН4) КАК Раздел11_ФН41,
		|	СУММА(ВТ.Раздел11_ФН5) КАК Раздел11_ФН51,
		|	СУММА(ВТ.Раздел11_ФН6) КАК Раздел11_ФН61,
		|	СУММА(ВТ.Раздел11_ФН7) КАК Раздел11_ФН71,
		|	СУММА(ВТ.Раздел11_ФН8) КАК Раздел11_ФН81,
		|	ВТ.НомерВРеестреСРО КАК НомерВРеестреСРО1,
		|	ВТ.ДокументОтчетности КАК ДокументОтчетности,
		|	ВТ.ДокументОтчетности.ДатаОкончанияОтчетногоПериода КАК ДатаОкончанияОтчетногоПериода
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.КПК,
		|	ВТ.ЕстьДокумент,
		|	ВТ.НомерВРеестреСРО,
		|	ВТ.ДокументОтчетности,
		|	ВТ.ДокументОтчетности.ДатаОкончанияОтчетногоПериода
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерВРеестреСРО,
		|	ДатаОкончанияОтчетногоПериода";
	КонецЕсли;
	ОтборПоКПК = "";
	
	Если ВидОтчета = 0 Тогда		
		СоединениеПоКПК = "ЛЕВОЕ";
		Запрос.УстановитьПараметр("ДатаНачала", ДатаОкончанияОтчетногоПериода);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончанияОтчетногоПериода);	
	Иначе                                            		
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаОтчетногоПериода);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончанияОтчетногоПериода);	
		Запрос.УстановитьПараметр("МассивКПК", МассивКПК);	    
		
		ОтборПоКПК = "И ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК В (&МассивКПК)";
		СоединениеПоКПК = "ВНУТРЕННЕЕ";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ОтборПоКПК#", ОтборПоКПК);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#СоединениеПоКПК#", СоединениеПоКПК);
	
	
	РезультатЗапроса = Запрос.Выполнить(); 	
	
	// Запрос для раздлелов 7 и 8
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка КАК ДокументОтчетности,
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.ДатаОкончанияОтчетногоПериода КАК ДатаОкончанияОтчетногоПериода,
	|	ОтчетностьКПКТаблицаПоказателей.Раздел КАК Раздел,
	|	СУММА(ЕСТЬNULL(ОтчетностьКПКТаблицаПоказателей.Показатель1, 0)) КАК Графа3,
	|	СУММА(ЕСТЬNULL(ОтчетностьКПКТаблицаПоказателей.Показатель2, 0)) КАК Графа4,
	|	СУММА(ЕСТЬNULL(ОтчетностьКПКТаблицаПоказателей.Показатель3, 0)) КАК Графа5,
	|	СУММА(ЕСТЬNULL(ОтчетностьКПКТаблицаПоказателей.Показатель4, 0)) КАК Графа6,
	|	СУММА(ЕСТЬNULL(ОтчетностьКПКТаблицаПоказателей.Показатель5, 0)) КАК Графа7,
	|	СУММА(ЕСТЬNULL(ОтчетностьКПКТаблицаПоказателей.Показатель6, 0)) КАК Графа8,
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК КАК КПК,
	|	ОтчетностьКПКТаблицаПоказателей.Раздел КАК РазделДляРасчета
	|ИЗ
	|	Документ.ОтчетностьКПК.ТаблицаПоказателей КАК ОтчетностьКПКТаблицаПоказателей
	|ГДЕ
	|	ОтчетностьКПКТаблицаПоказателей.Раздел В(&СписокРазделов)
	|	И ОтчетностьКПКТаблицаПоказателей.Ссылка.ДатаОкончанияОтчетногоПериода МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ОтчетностьКПКТаблицаПоказателей.Ссылка.Проведен = ИСТИНА
	|	#ОтборПоКПК#
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка,
	|	ОтчетностьКПКТаблицаПоказателей.Раздел,
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК,
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.ДатаОкончанияОтчетногоПериода,
	|	ОтчетностьКПКТаблицаПоказателей.Раздел
	
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК.НомерВРеестреСРО,
	|	ДатаОкончанияОтчетногоПериода"; 		
	
	СписокРазделов = Новый Массив;
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_1_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_2_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_3_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_4_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_5_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_6_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_7_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_8_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_9_1);
	
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_1_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_2_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_3_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_4_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_5_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_6_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_7_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_8_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_9_2);
	
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_1_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_2_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_3_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_4_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_5_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_6_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_7_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_8_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_9_1);
	
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_1_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_2_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_3_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_4_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_5_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_6_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_7_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_8_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_9_2);
	
	ОтборПоКПК = "";
	Если ВидОтчета = 0 Тогда			
		Запрос.УстановитьПараметр("ДатаНачала", ДатаОкончанияОтчетногоПериода);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончанияОтчетногоПериода);	
	Иначе                                            		
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаОтчетногоПериода);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончанияОтчетногоПериода);	
		Запрос.УстановитьПараметр("МассивКПК", МассивКПК);	    
		
		ОтборПоКПК = "И ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК В (&МассивКПК)";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ОтборПоКПК#", ОтборПоКПК);
	
	Запрос.УстановитьПараметр("СписокРазделов", СписокРазделов);       	
	
	
	ТЗразделы7_8 = Запрос.Выполнить().Выгрузить();
	
	// добавляем строку для посик КПК и ДатаОкончания
	СРО_ЗагрузкаОтчетности.ЗаполнитьКОлонкуДЛляПоиска(ТЗразделы7_8);
	
	
	
	
	ЗапросРаздел10 = Новый Запрос;
	ЗапросРаздел10.Текст = "ВЫБРАТЬ
	|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Ссылка КАК ДокументОтчетности,
	|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Ссылка.КПК КАК КПК,
	|	СУММА(ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.РазмерОбязательствНаКонецОтчетногоПериода) КАК РазмерОбязательствНаКонецОтчетногоПериода,
	|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.ВидДоговора КАК ВидДоговора,
	|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.КодРаздела КАК КодРаздела,
	|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Ссылка.ДатаОкончанияОтчетногоПериода КАК ДатаОкончанияОтчетногоПериода
	|ИЗ
	|	Документ.ОтчетностьКПК.ТаблицаДоговоровОдобренныхОбщимСобранием КАК ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием
	|ГДЕ
	|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Ссылка.ДатаОкончанияОтчетногоПериода МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Ссылка.Проведен = ИСТИНА
	|	И ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.КодРаздела <> """"
	|	#ОтборПоКПК#
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Ссылка,
	|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.ВидДоговора,
	|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.КодРаздела,
	|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Ссылка.ДатаОкончанияОтчетногоПериода";
	
	
	ОтборПоКПК = "";
	Если ВидОтчета = 0 Тогда			
		ЗапросРаздел10.УстановитьПараметр("ДатаНачала", ДатаОкончанияОтчетногоПериода);
		ЗапросРаздел10.УстановитьПараметр("ДатаОкончания", ДатаОкончанияОтчетногоПериода);	
	Иначе                                            		
		ЗапросРаздел10.УстановитьПараметр("ДатаНачала", ДатаНачалаОтчетногоПериода);
		ЗапросРаздел10.УстановитьПараметр("ДатаОкончания", ДатаОкончанияОтчетногоПериода);	
		ЗапросРаздел10.УстановитьПараметр("МассивКПК", МассивКПК);	    	
		ОтборПоКПК = "И ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Ссылка.КПК В (&МассивКПК)";
	КонецЕсли;
	
	ЗапросРаздел10.Текст = СтрЗаменить(ЗапросРаздел10.Текст, "#ОтборПоКПК#", ОтборПоКПК);
	
	
	ТЗРаздел10 = ЗапросРаздел10.Выполнить().Выгрузить();
	СРО_ЗагрузкаОтчетности.ЗаполнитьКОлонкуДЛляПоиска(ТЗРаздел10);
	
	
	
	
	// 2 Надзорное соотношение
	Цвет_ОшибкаВПоказателях = Новый Цвет(255, 203, 203);
	
	
	Если ВидОтчета = 0 Тогда
		Макет = Отчеты.СРО_ПроверкаОтчетностиСРассылкойПисем.ПолучитьМакет("МакетКонтрольныеСоотношения");
	Иначе	
		Макет = Отчеты.СРО_ПроверкаОтчетностиСРассылкойПисем.ПолучитьМакет("МакетКонтрольныеСоотношенияПериод");
	КонецЕсли;
	
	ОбластьШапка = Макет.получитьОбласть("Шапка");
	
	ОбластьШапка.Параметры.ПредставлениеПериода = ПредставлениеПериода(НачалоПериода, ОкончаниеПериода);
	РезультатНадзорныеСоотношения.Вывести(ОбластьШапка);
	
	ОбластьСтрока = Макет.получитьОбласть("Строка"); 	
	
	// 3. КС
	
	РезультатКС.Очистить();
	
	Если ВидОтчета = 0 Тогда
		Макет = Отчеты.СРО_ПроверкаОтчетностиСРассылкойПисем.ПолучитьМакет("МакетКС");
	Иначе
		Макет = Отчеты.СРО_ПроверкаОтчетностиСРассылкойПисем.ПолучитьМакет("МакетКСПериод");		
	КонецЕсли;
	
	ОбластьШапка = Макет.получитьОбласть("Шапка");
	
	ОбластьШапка.Параметры.ПредставлениеПериода = ПредставлениеПериода(НачалоПериода, ОкончаниеПериода);
	РезультатКС.Вывести(ОбластьШапка);
	ОбластьСтрокаКС = Макет.получитьОбласть("Строка"); 	
	
	
	// Графа 4 раздел 6
	
	ЗапроРаздел6Графа4 = Новый Запрос;
	ЗапроРаздел6Графа4.Текст = "ВЫБРАТЬ
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка КАК ДокументОтчетности,
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК КАК КПК,
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.ДатаОкончанияОтчетногоПериода КАК ДатаОкончанияОтчетногоПериода,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Показатель2 = -99999
	|				ТОГДА 0
	|			ИНАЧЕ ОтчетностьКПКТаблицаПоказателей.Показатель2
	|		КОНЕЦ) КАК Графа4
	|ИЗ
	|	Документ.ОтчетностьКПК.ТаблицаПоказателей КАК ОтчетностьКПКТаблицаПоказателей
	|ГДЕ
	|	ОтчетностьКПКТаблицаПоказателей.Раздел В ИЕРАРХИИ(&Раздел)
	|	И ОтчетностьКПКТаблицаПоказателей.Ссылка.ДатаОкончанияОтчетногоПериода МЕЖДУ &ДатаНачала И &ДатаОкончания  
	|	#ОтборПоКПК#
	
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка";
	
	ОтборПоКПК = "";
	Если ВидОтчета = 0 Тогда			
		ЗапроРаздел6Графа4.УстановитьПараметр("ДатаНачала", ДатаОкончанияОтчетногоПериода);
		ЗапроРаздел6Графа4.УстановитьПараметр("ДатаОкончания", ДатаОкончанияОтчетногоПериода);	
	Иначе                                            		
		ЗапроРаздел6Графа4.УстановитьПараметр("ДатаНачала", ДатаНачалаОтчетногоПериода);
		ЗапроРаздел6Графа4.УстановитьПараметр("ДатаОкончания", ДатаОкончанияОтчетногоПериода);	
		ЗапроРаздел6Графа4.УстановитьПараметр("МассивКПК", МассивКПК);	    	
		ОтборПоКПК = "И ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК В (&МассивКПК)";
	КонецЕсли;
	
	ЗапроРаздел6Графа4.Текст = СтрЗаменить(ЗапроРаздел6Графа4.Текст, "#ОтборПоКПК#", ОтборПоКПК); 	
	ЗапроРаздел6Графа4.УстановитьПараметр("Раздел", Справочники.Разделы.Раздел6);
	
	ТЗРаздел6Графа4 = ЗапроРаздел6Графа4.Выполнить().Выгрузить();
	СРО_ЗагрузкаОтчетности.ЗаполнитьКОлонкуДЛляПоиска(ТЗРаздел6Графа4);
	
	
	
	// выводим строки
	
	
	СтрокаЧетная = Ложь;
	
	НомерСтроки = 0;
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		Если ВыводитьТолькоКПКСОтчетностью И  НЕ Выборка.ЕстьДокумент Тогда
			Продолжить;			
		КонецЕсли;
		
		НомерСтроки = НомерСтроки +1;
		
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		
		ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
		ОбластьСтрока.Параметры.КраткоеНазваниеКПК = Выборка.КПК.НаименованиеКраткое;
		
		Если ВидОтчета = 1 Тогда
			ОбластьСтрока.Параметры.ПериодОтчетности = СРО_ЗагрузкаОтчетности.ПолучитьПредставлениеДатыотчета(Выборка.ДатаОкончанияОтчетногоПериода);
		КонецЕсли;
		
		
		Если СтрокаЧетная Тогда
			ЦветФонаСтроки = WebЦвета.ШелковыйОттенок;
		Иначе
			ЦветФонаСтроки = WebЦвета.Белый;
		КонецЕсли;
		
		СтрокаЧетная = ?(СтрокаЧетная, Ложь, Истина);  	
		ОбластьСтрока.Область(1, 1, 1, 66 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;	
		
		Если Выборка.ДокументОтчетности = null Тогда   			
			ОбластьСтрока.Параметры.ДокументОтчетности  = "Нет документа";
			ОбластьСтрока.Область(1, 3, 1, 3).ЦветТекста = WebЦвета.Черный;				
		Иначе	
			ОбластьСтрока.Параметры.ДокументОтчетности  = Выборка.ДокументОтчетности;
			ОбластьСтрока.Область(1, 3, 1, 3).ЦветТекста =  WebЦвета.Синий;
		КонецЕсли;
		
		
		
		// проверки
		
		ВсегоОшибок = 0;
		
		НазваниеТаблицы = "НадзорныеСоотношения";
		
		// 1) (строка 3.3.1 раздела II) < (строки 3.3.1.1+ 3.3.1.2+ 3.3.1.3+ 3.3.1.4+ 3.3.1.5 раздела II)
		Если Выборка.Раздел2_3_3_1 < Выборка.Раздел2_3_3_1_1 + Выборка.Раздел2_3_3_1_2 + Выборка.Раздел2_3_3_1_3 + Выборка.Раздел2_3_3_1_4 + Выборка.Раздел2_3_3_1_5 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Параметры.Проверка1 = "1";
			ОбластьСтрока.Область(1, 5 + КолДопКолонок, 1, 5 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
			
			
			ОписаниеУсловия = "(строка 3.3.1 раздела II) < (строки 3.3.1.1+ 3.3.1.2+ 3.3.1.3+ 3.3.1.4+ 3.3.1.5 раздела II)";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_3_1 )+" < " + Строка(Выборка.Раздел2_3_3_1_1) + " + " +Строка(Выборка.Раздел2_3_3_1_2) + " + " +Строка(Выборка.Раздел2_3_3_1_3) + " + " + Строка(Выборка.Раздел2_3_3_1_4) + " + " + Строка(Выборка.Раздел2_3_3_1_5);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);
			
		Иначе
			ОбластьСтрока.Параметры.Проверка1 = "0";
		КонецЕсли; 	
		
		// 2) если (строка 3.3.1.1 раздела II > 0), то (строки 3.1.1+ 3.2.1) =0
		//ОбластьСтрока.Параметры.Раздел2_3_3_1_1 = Выборка.Раздел2_3_3_1_1;
		ОбластьСтрока.Параметры.Сумма_311_321 = Выборка.Раздел2_3_1_1 + Выборка.Раздел2_3_2_1;
		
		Если Выборка.Раздел2_3_3_1_1 > 0 И (Выборка.Раздел2_3_1_1 + Выборка.Раздел2_3_2_1 = 0) Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 6 + КолДопКолонок, 1, 7 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;       			
			
			ОписаниеУсловия = "если (строка 3.3.1.1 раздела II > 0), то (строки 3.1.1+ 3.2.1) = 0";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_3_1_1 )+" > 0; строки 3.1.1+ 3.2.1 = " + Строка(Выборка.Раздел2_3_1_1) + " + " + Строка(Выборка.Раздел2_3_2_1);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);
			
		КонецЕсли;
		
		// 3) если (строка 3.3.1.2 раздела II > 0), то (строки 3.1.2+ 3.2.2) =0
		//ОбластьСтрока.Параметры.Раздел2_3_3_1_2 = Выборка.Раздел2_3_3_1_2;
		ОбластьСтрока.Параметры.Сумма_312_322 = Выборка.Раздел2_3_1_2 + Выборка.Раздел2_3_2_2;
		
		Если Выборка.Раздел2_3_3_1_2 > 0 И (Выборка.Раздел2_3_1_2 + Выборка.Раздел2_3_2_2 = 0) Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   			
			ОбластьСтрока.Область(1, 8 + КолДопКолонок, 1, 9 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
			
			ОписаниеУсловия = " если (строка 3.3.1.2 раздела II > 0), то (строки 3.1.2+ 3.2.2) = 0";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_3_1_2 )+" > 0; (строки 3.1.2+ 3.2.2) = " + Строка(Выборка.Раздел2_3_1_2) + " + " + Строка(Выборка.Раздел2_3_2_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);
			
		КонецЕсли;
		
		
		// 4) если (строка 3.3.1.3 раздела II > 0), то (строки 3.1.3.1+ 3.2.3.1) =0
		//ОбластьСтрока.Параметры.Раздел2_3_3_1_3 = Выборка.Раздел2_3_3_1_3;
		ОбластьСтрока.Параметры.Сумма_3131_3231 = Выборка.Раздел2_3_1_3_1 + Выборка.Раздел2_3_2_3_1;
		
		Если Выборка.Раздел2_3_3_1_3 > 0 И (Выборка.Раздел2_3_1_3_1 + Выборка.Раздел2_3_2_3_1 = 0) Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 10 + КолДопКолонок, 1, 11 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;  
			
			ОписаниеУсловия = "если (строка 3.3.1.3 раздела II > 0), то (строки 3.1.3.1+ 3.2.3.1) = 0";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_3_1_3 )+" > 0; строки 3.1.3.1+ 3.2.3.1 = " + Строка(Выборка.Раздел2_3_1_3_1) + " + " + Строка(Выборка.Раздел2_3_2_3_1);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);
			
		КонецЕсли;
		
		// 5) если (строка 3.3.1.4 раздела II > 0), то (строки 3.1.3.2+ 3.2.3.2) =0
		//ОбластьСтрока.Параметры.Раздел2_3_3_1_4 = Выборка.Раздел2_3_3_1_4;
		ОбластьСтрока.Параметры.Сумма_3132_3232 = Выборка.Раздел2_3_1_3_2 + Выборка.Раздел2_3_2_3_2;
		
		Если Выборка.Раздел2_3_3_1_4 > 0 И (Выборка.Раздел2_3_1_3_2 + Выборка.Раздел2_3_2_3_2 = 0) Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 12 + КолДопКолонок, 1, 13 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
			
			ОписаниеУсловия = "если (строка 3.3.1.4 раздела II > 0), то (строки 3.1.3.2+ 3.2.3.2) =0";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_3_1_4 )+" > 0; строки 3.1.3.2+ 3.2.3.2 = " + Строка(Выборка.Раздел2_3_1_3_2) + " + " + Строка(Выборка.Раздел2_3_2_3_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);
			
		КонецЕсли;
		
		// 6) если (строка 3.3.1.5 раздела II > 0), то (строки 3.1.3.3+ 3.2.3.3) =0
		//ОбластьСтрока.Параметры.Раздел2_3_3_1_5 = Выборка.Раздел2_3_3_1_5;
		ОбластьСтрока.Параметры.Сумма_3133_3233 = Выборка.Раздел2_3_1_3_3 + Выборка.Раздел2_3_2_3_3;
		
		Если Выборка.Раздел2_3_3_1_5 > 0 И (Выборка.Раздел2_3_1_3_3 + Выборка.Раздел2_3_2_3_3 = 0) Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 14 + КолДопКолонок, 1, 15 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;
			
			ОписаниеУсловия = "если (строка 3.3.1.5 раздела II > 0), то (строки 3.1.3.3+ 3.2.3.3) =0";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_3_1_5 )+" > 0; строки  3.1.3.3+ 3.2.3.3 = " + Строка(Выборка.Раздел2_3_1_3_3) + " + " + Строка(Выборка.Раздел2_3_2_3_3);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);
			
		КонецЕсли; 		
		
		
		// 7)если (строки 3.1 + 3.2 раздела II) > 0, то строка 14 раздела IV = 0
		ОбластьСтрока.Параметры.Сумма_31_32 = Выборка.Раздел2_3_1 + Выборка.Раздел2_3_2;
		//ОбластьСтрока.Параметры.Раздел4_14 = Выборка.Раздел4_14;
		
		Если (Выборка.Раздел2_3_1 + Выборка.Раздел2_3_2) > 0 И Выборка.Раздел4_14 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 16 + КолДопКолонок, 1, 17 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
			
			ОписаниеУсловия = "если (строки 3.1 + 3.2 раздела II) > 0, то строка 14 раздела IV = 0";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_1 ) + " + " + сТРОКА(Строка(Выборка.Раздел2_3_2 ))+" > 0; строка 14 = " + Строка(Выборка.Раздел4_14) ;
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);  	
			
		КонецЕсли;
		
		// 8) если (строки 3.1.1 + 3.2.1 раздела II) > 0, то строка 14.1 раздела IV = 0
		ОбластьСтрока.Параметры.Сумма_311_321 = Выборка.Раздел2_3_1_1 + Выборка.Раздел2_3_2_1;
		//ОбластьСтрока.Параметры.Раздел4_14_1 = Выборка.Раздел4_14_1;
		
		Если (Выборка.Раздел2_3_1_1 + Выборка.Раздел2_3_2_1) > 0 И Выборка.Раздел4_14_1 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 18 + КолДопКолонок, 1, 19 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
			
			ОписаниеУсловия = "если (строки 3.1.1 + 3.2.1 раздела II) > 0, то строка 14.1 раздела IV = 0";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_1_1 ) + " + " + Строка(Строка(Выборка.Раздел2_3_1_1 ))+" > 0; строка 14.1 = " + Строка(Выборка.Раздел4_14_1) ;
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);  	
		КонецЕсли;
		
		// 9) если (строки 3.1.2 + 3.2.2 раздела II) > 0, то строка 14.2 раздела IV = 0
		ОбластьСтрока.Параметры.Сумма_312_322 = Выборка.Раздел2_3_1_2 + Выборка.Раздел2_3_2_2;
		//ОбластьСтрока.Параметры.Раздел4_14_2 = Выборка.Раздел4_14_2;
		
		Если (Выборка.Раздел2_3_1_2 + Выборка.Раздел2_3_2_2) > 0 И Выборка.Раздел4_14_2 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 20 + КолДопКолонок, 1, 21 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;
			
			ОписаниеУсловия = "если (строки 3.1.2 + 3.2.2 раздела II) > 0, то строка 14.2 раздела IV = 0";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_1_2 ) + " + " + Строка(Строка(Выборка.Раздел2_3_2_2 ))+" > 0; строка 14.2 = " + Строка(Выборка.Раздел4_14_2) ;
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);  	
		КонецЕсли;
		
		
		// 10) если (строки 3.1.3 + 3.2.3 раздела II) > 0, то строка 14.3 раздела IV = 0
		ОбластьСтрока.Параметры.Сумма_313_323 = Выборка.Раздел2_3_1_3 + Выборка.Раздел2_3_2_3;
		//ОбластьСтрока.Параметры.Раздел4_14_3 = Выборка.Раздел4_14_3;
		
		Если (Выборка.Раздел2_3_1_3 + Выборка.Раздел2_3_2_3) > 0 И Выборка.Раздел4_14_3 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 22 + КолДопКолонок, 1, 23 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   		
			
			ОписаниеУсловия = "если (строки 3.1.3 + 3.2.3 раздела II) > 0, то строка 14.3 раздела IV = 0";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_1_3 ) + " + " + Строка(Строка(Выборка.Раздел2_3_2_3 ))+" > 0; строка 14.3 = " + Строка(Выборка.Раздел4_14_3) ;
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);  	
		КонецЕсли;
		
		// 11) если (строки 3.1.3.1 + 3.2.3.1  раздела II) > 0, то строка 14.3.1 раздела IV = 0
		ОбластьСтрока.Параметры.Сумма_3131_3231 = Выборка.Раздел2_3_1_3_1 + Выборка.Раздел2_3_2_3_1;
		//ОбластьСтрока.Параметры.Раздел4_14_3_1 = Выборка.Раздел4_14_3_1;
		
		Если (Выборка.Раздел2_3_1_3_1 + Выборка.Раздел2_3_2_3_1) > 0 И Выборка.Раздел4_14_3_1 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 24 + КолДопКолонок, 1, 25 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   		
			
			ОписаниеУсловия = "если (строки 3.1.3.1 + 3.2.3.1  раздела II) > 0, то строка 14.3.1 раздела IV = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_1_3_1 ) + " + " + Строка(Строка(Выборка.Раздел2_3_2_3_1 ))+" > 0; строка 14.3.1 = " + Строка(Выборка.Раздел4_14_3_1) ;
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);  	
		КонецЕсли;
		
		// 12) если (строки 3.1.3.2 + 3.2.3.2  раздела II) > 0, то строка 14.3.2 раздела IV = 0
		ОбластьСтрока.Параметры.Сумма_3132_3232 = Выборка.Раздел2_3_1_3_2 + Выборка.Раздел2_3_2_3_2;
		//ОбластьСтрока.Параметры.Раздел4_14_3_2 = Выборка.Раздел4_14_3_2;
		
		Если (Выборка.Раздел2_3_1_3_2 + Выборка.Раздел2_3_2_3_2) > 0 И Выборка.Раздел4_14_3_2 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 26 + КолДопКолонок, 1, 27 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
			
			ОписаниеУсловия = "если (строки 3.1.3.2 + 3.2.3.2  раздела II) > 0, то строка 14.3.2 раздела IV = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_1_3_2 ) + " + " + Строка(Строка(Выборка.Раздел2_3_2_3_2 ))+" > 0; строка 14.3.1 = " + Строка(Выборка.Раздел4_14_3_2) ;
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);  
		КонецЕсли;
		
		// 13) если (строка 14 раздела IV > 0), то (строки 3.1 + 3.2 раздела II) = 0
		Если Выборка.Раздел4_14 > 0 И Выборка.Раздел2_3_1 + Выборка.Раздел2_3_2 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 28 + КолДопКолонок, 1, 29 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
			
			ОписаниеУсловия = "если (строка 14 раздела IV > 0), то (строки 3.1 + 3.2 раздела II) = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел4_14 ) +" > 0; строки 3.1 + 3.2 раздела II) = " + Строка(Выборка.Раздел2_3_1) +" + " + Строка(Выборка.Раздел2_3_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
		КонецЕсли;
		
		// 14) если (строка 14.1 раздела IV > 0), то (строки 3.1.1 + 3.2.1 раздела II) = 0  		
		Если Выборка.Раздел4_14_1 > 0 И Выборка.Раздел2_3_1_1 + Выборка.Раздел2_3_2_1 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 30 + КолДопКолонок, 1, 31 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
			
			ОписаниеУсловия = "если (строка 14.1 раздела IV > 0), то (строки 3.1.1 + 3.2.1 раздела II) = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел4_14_1 ) +" > 0; строки 3.1.1 + 3.2.1 раздела II) = " + Строка(Выборка.Раздел2_3_1_1) +" + " + Строка(Выборка.Раздел2_3_2_1);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
			
		КонецЕсли;
		
		// 15) если (строка 14.2 раздела IV > 0), то (строки 3.1.2 + 3.2.2 раздела II) = 0
		Если Выборка.Раздел4_14_2 > 0 И Выборка.Раздел2_3_1_2 + Выборка.Раздел2_3_2_2 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 32 + КолДопКолонок, 1, 33 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;  
			
			ОписаниеУсловия = "если (строка 14.2 раздела IV > 0), то (строки 3.1.2 + 3.2.2 раздела II) = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел4_14_2 ) +" > 0; строки 3.1.2 + 3.2.2 раздела II) = " + Строка(Выборка.Раздел2_3_1_2) +" + " + Строка(Выборка.Раздел2_3_2_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
			
		КонецЕсли;
		
		// 16) если (строка 14.3 раздела IV > 0), то (строки 3.1.3 + 3.2.3 раздела II) = 0
		Если Выборка.Раздел4_14_3 > 0 И Выборка.Раздел2_3_1_3 + Выборка.Раздел2_3_2_3 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 34 + КолДопКолонок, 1, 35 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   	
			
			ОписаниеУсловия = "если (строка 14.3 раздела IV > 0), то (строки 3.1.3 + 3.2.3 раздела II) = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел4_14_3 ) +" > 0; строки 3.1.3 + 3.2.3 раздела II) = " + Строка(Выборка.Раздел2_3_1_3) +" + " + Строка(Выборка.Раздел2_3_2_3);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
			
		КонецЕсли;
		
		// 17) если (строка 14.3.1 раздела IV > 0), то (строки 3.1.3.1 + 3.2.3.1 раздела II) = 0
		Если Выборка.Раздел4_14_3_1 > 0 И Выборка.Раздел2_3_1_3_1 + Выборка.Раздел2_3_2_3_1 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 36 + КолДопКолонок, 1, 37 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   	
			
			ОписаниеУсловия = "если (строка 14.3.1 раздела IV > 0), то (строки 3.1.3.1 + 3.2.3.1 раздела II) = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел4_14_3_1 ) +" > 0; строки 3.1.3 + 3.2.3 раздела II) = " + Строка(Выборка.Раздел2_3_1_3_1) +" + " + Строка(Выборка.Раздел2_3_2_3_1);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
			
		КонецЕсли;
		
		// 18) если (строка 14.3.2 раздела IV > 0), то (строки 3.1.3.2 + 3.2.3.2 раздела II) = 0
		Если Выборка.Раздел4_14_3_2 > 0 И Выборка.Раздел4_3_1_3_2 + Выборка.Раздел4_3_2_3_2 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 38 + КолДопКолонок, 1, 39 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
			
			ОписаниеУсловия = "если (строка 14.3.2 раздела IV > 0), то (строки 3.1.3.2 + 3.2.3.2 раздела II) = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел4_14_3_2 ) +" > 0; строки 3.1.3 + 3.2.3 раздела II) = " + Строка(Выборка.Раздел4_3_1_3_2) +" + " + Строка(Выборка.Раздел4_3_2_3_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
			
		КонецЕсли;
		
		// 19) если (строка 14.1 раздела IV) > 0, то строка 11.1 раздела IV = 0
		//ОбластьСтрока.Параметры.Раздел4_11_1 = Выборка.Раздел4_11_1;
		
		Если Выборка.Раздел4_14_1 > 0 И Выборка.Раздел4_11_1 = 0 Тогда  	 
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 40 + КолДопКолонок, 1, 41 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;  
			
			ОписаниеУсловия = "если (строка 14.1 раздела IV) > 0, то строка 11.1 раздела IV = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел4_14_1 ) +" > 0; строка 11.1 раздела IV = " + Строка(Выборка.Раздел4_11_1);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
			
		КонецЕсли;
		
		// 20) если (строка 14.2 раздела IV) > 0, то строка 11.2 раздела IV = 0
		//ОбластьСтрока.Параметры.Раздел4_11_2 = Выборка.Раздел4_11_2;
		
		Если Выборка.Раздел4_14_2 > 0 И Выборка.Раздел4_11_2 = 0 Тогда  	 
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 42 + КолДопКолонок, 1, 43 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
			
			ОписаниеУсловия = "если (строка 14.2 раздела IV) > 0, то строка 11.2 раздела IV = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел4_14_2 ) +" > 0; строка 11.2 раздела IV = " + Строка(Выборка.Раздел4_11_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
			
		КонецЕсли;
		
		// 21) если (строка 15.1 раздела IV) > 0, то строка 11.1 раздела IV = 0
		//ОбластьСтрока.Параметры.Раздел4_11_2 = Выборка.Раздел4_11_2;
		
		Если Выборка.Раздел4_15_1 > 0 И Выборка.Раздел4_11_1 = 0 Тогда  	 
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 44 + КолДопКолонок, 1, 45 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;  
			
			ОписаниеУсловия = "если (строка 15.1 раздела IV) > 0, то строка 11.1 раздела IV = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел4_15_1 ) +" > 0; строка 11.1 раздела IV = " + Строка(Выборка.Раздел4_11_1);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
			
		КонецЕсли;
		
		// 22) если (строка 15.2 раздела IV) > 0, то строка 11.2 раздела IV = 0
		//ОбластьСтрока.Параметры.Раздел4_11_2 = Выборка.Раздел4_11_2;
		
		Если Выборка.Раздел4_15_2 > 0 И Выборка.Раздел4_11_2 = 0 Тогда  	 
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 46 + КолДопКолонок, 1, 47 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
			
			ОписаниеУсловия = "если (строка 15.2 раздела IV) > 0, то строка 11.2 раздела IV = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел4_15_2 ) +" > 0; строка 11.2 раздела IV = " + Строка(Выборка.Раздел4_11_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
			
		КонецЕсли; 		
		
		Если НЕ Выборка.ЕстьДокумент Тогда
			РезультатНадзорныеСоотношения.Вывести(ОбластьСтрока);			
			Продолжить;
		КонецЕсли;
		
		// сравнение разделы 7 и 8  		
		
		СтруктураСтрок = Новый Структура;
		
		НайденныеСтроки = ТЗразделы7_8.НайтиСтроки(Новый Структура("КодКПК_ДатаОтчетности", СокрЛП(Выборка.КПК.Код) + "_" + Строка(Выборка.ДатаОкончанияОтчетногоПериода))); 			
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			// Добавляем графы *.1
			Если НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_1_1 Тогда
				СтруктураСтрок.Вставить("Раздел7_1_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_2_1 Тогда
				СтруктураСтрок.Вставить("Раздел7_2_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_3_1 Тогда
				СтруктураСтрок.Вставить("Раздел7_3_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_4_1 Тогда
				СтруктураСтрок.Вставить("Раздел7_4_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_5_1 Тогда
				СтруктураСтрок.Вставить("Раздел7_5_1", НайденнаяСтрока);	
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_6_1 Тогда
				СтруктураСтрок.Вставить("Раздел7_6_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_7_1 Тогда
				СтруктураСтрок.Вставить("Раздел7_7_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_8_1 Тогда
				СтруктураСтрок.Вставить("Раздел7_8_1", НайденнаяСтрока);	
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_9_1 Тогда
				СтруктураСтрок.Вставить("Раздел7_9_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_1_1 Тогда
				СтруктураСтрок.Вставить("Раздел8_1_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_2_1 Тогда
				СтруктураСтрок.Вставить("Раздел8_2_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_3_1 Тогда
				СтруктураСтрок.Вставить("Раздел8_3_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_4_1 Тогда
				СтруктураСтрок.Вставить("Раздел8_4_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_5_1 Тогда
				СтруктураСтрок.Вставить("Раздел8_5_1", НайденнаяСтрока);	
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_6_1 Тогда
				СтруктураСтрок.Вставить("Раздел8_6_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_7_1 Тогда
				СтруктураСтрок.Вставить("Раздел8_7_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_8_1 Тогда
				СтруктураСтрок.Вставить("Раздел8_8_1", НайденнаяСтрока);	
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_9_1 Тогда
				СтруктураСтрок.Вставить("Раздел8_9_1", НайденнаяСтрока);	
				
				// Добавляем графы *.2
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_1_2 Тогда
				СтруктураСтрок.Вставить("Раздел7_1_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_2_2 Тогда
				СтруктураСтрок.Вставить("Раздел7_2_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_3_2 Тогда
				СтруктураСтрок.Вставить("Раздел7_3_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_4_2 Тогда
				СтруктураСтрок.Вставить("Раздел7_4_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_5_2 Тогда
				СтруктураСтрок.Вставить("Раздел7_5_2", НайденнаяСтрока);	
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_6_2 Тогда
				СтруктураСтрок.Вставить("Раздел7_6_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_7_2 Тогда
				СтруктураСтрок.Вставить("Раздел7_7_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_8_2 Тогда
				СтруктураСтрок.Вставить("Раздел7_8_2", НайденнаяСтрока);	
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_9_2 Тогда
				СтруктураСтрок.Вставить("Раздел7_9_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_1_2 Тогда
				СтруктураСтрок.Вставить("Раздел8_1_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_2_2 Тогда
				СтруктураСтрок.Вставить("Раздел8_2_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_3_2 Тогда
				СтруктураСтрок.Вставить("Раздел8_3_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_4_2 Тогда
				СтруктураСтрок.Вставить("Раздел8_4_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_5_2 Тогда
				СтруктураСтрок.Вставить("Раздел8_5_2", НайденнаяСтрока);	
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_6_2 Тогда
				СтруктураСтрок.Вставить("Раздел8_6_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_7_2 Тогда
				СтруктураСтрок.Вставить("Раздел8_7_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_8_2 Тогда
				СтруктураСтрок.Вставить("Раздел8_8_2", НайденнаяСтрока);	
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_9_2 Тогда
				СтруктураСтрок.Вставить("Раздел8_9_2", НайденнаяСтрока);		
			КонецЕсли; 	  			
		КонецЦикла;
		
		
		//////////////////////////////////////////////////////
		//    Основной долг                                 //
		//////////////////////////////////////////////////////
		
		// 1) 1.1(графы 3,4,5,6)РазделаVIII<>0  - создание резерва для данных категорий не предусмотрено;
		
		ОписаниеУсловия = "1.1 (графы 3,4,5,6) РазделаVIII <> 0  - создание резерва для данных категорий не предусмотрено";
		ОписаниеОшибки = "";
		Если СтруктураСтрок.Раздел8_1_1.Графа3 <> 0 ИЛИ СтруктураСтрок.Раздел8_1_1.Графа4 <> 0 ИЛИ СтруктураСтрок.Раздел8_1_1.Графа5 <> 0 ИЛИ СтруктураСтрок.Раздел8_1_1.Графа6 <> 0 Тогда
			Если СтруктураСтрок.Раздел8_1_1.Графа3 <> 0 Тогда
				ОписаниеОшибки = ?(ОписаниеОшибки = "", "", Символы.ПС) + ОписаниеОшибки + "1.1 РазделаVIII Графа 3 = " + Строка(СтруктураСтрок.Раздел8_1_1.Графа3);
				ВсегоОшибок = ВсегоОшибок + 1;      
			КонецЕсли;
			
			Если СтруктураСтрок.Раздел8_1_1.Графа4 <> 0 Тогда
				ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "1.1 РазделаVIII Графа 4 = " + Строка(СтруктураСтрок.Раздел8_1_1.Графа4);	
				ВсегоОшибок = ВсегоОшибок + 1;   
			КонецЕсли;
			
			Если СтруктураСтрок.Раздел8_1_1.Графа5 <> 0 Тогда
				ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "1.1 РазделаVIII Графа 5 = " + Строка(СтруктураСтрок.Раздел8_1_1.Графа5);		
				ВсегоОшибок = ВсегоОшибок + 1;   
			КонецЕсли;
			
			Если СтруктураСтрок.Раздел8_1_1.Графа6 <> 0 Тогда
				ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "1.1 РазделаVIII Графа 6 = " + Строка(СтруктураСтрок.Раздел8_1_1.Графа6);		
				ВсегоОшибок = ВсегоОшибок + 1;   
			КонецЕсли;
			
			ОбластьСтрока.Область(1, 48 + КолДопКолонок, 1, 48 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 			
		КонецЕсли;
		
		Проверка5_1 =  ОписаниеУсловия+?(ОписаниеОшибки="", "", Символы.ПС + ОписаниеОшибки);
		ОбластьСтрока.Параметры.Проверка5_1 = Проверка5_1;
		
		Если ОписаниеОшибки <> "" Тогда
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
		КонецЕсли;         
		
		
		// 2) 1.1(графа7)РазделаVII*2% <>1.1(графа7)РазделаVIII;     		
		ОписаниеУсловия = "1.1 (графа7) РазделаVII * 2% <> 1.1 (графа7) РазделаVIII";
		ОписаниеОшибки = "";
		Если Окр(СтруктураСтрок.Раздел7_1_1.Графа7 *2 /100, 3) <> СтруктураСтрок.Раздел8_1_1.Графа7 Тогда		
			ОписаниеОшибки = Строка(Окр(СтруктураСтрок.Раздел7_1_1.Графа7 *2 /100, 3)) + " <> " + Строка(СтруктураСтрок.Раздел8_1_1.Графа7);
			ОбластьСтрока.Область(1, 49 + КолДопКолонок, 1, 49 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
			ВсегоОшибок = ВсегоОшибок + 1;   
		КонецЕсли;
		
		Проверка5_2 = ОписаниеУсловия+?(ОписаниеОшибки="", "", Символы.ПС+ОписаниеОшибки);					
		ОбластьСтрока.Параметры.Проверка5_2 = Проверка5_2;
		
		Если ОписаниеОшибки <> "" Тогда
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);    		
		КонецЕсли;
		
		// 3) 1.1(графа8)РазделаVII*5%<>1.1(графа8)РазделаVIII    		
		ОписаниеУсловия = "1.1 (графа8) РазделаVII * 5% <> 1.1 (графа8) РазделаVIII";
		ОписаниеОшибки = "";
		Если Окр(СтруктураСтрок.Раздел7_1_1.Графа8 *5 /100, 3) <> СтруктураСтрок.Раздел8_1_1.Графа8 Тогда		
			ОписаниеОшибки = Строка(Окр(СтруктураСтрок.Раздел7_1_1.Графа8 *5 /100, 3)) + " <> " + Строка(СтруктураСтрок.Раздел8_1_1.Графа8);
			ОбластьСтрока.Область(1, 50 + КолДопКолонок, 1, 50 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 	
			ВсегоОшибок = ВсегоОшибок + 1;   
			
		КонецЕсли;
		
		Проверка5_3 = ОписаниеУсловия+?(ОписаниеОшибки="", "", Символы.ПС+ОписаниеОшибки);
		ОбластьСтрока.Параметры.Проверка5_3 = Проверка5_3; 
		
		Если ОписаниеОшибки <> "" Тогда
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);     
		КонецЕсли;
		
		// ------------------------------------------------------------
		// 3 графа 
		ОписаниеОшибки3Графа = "";
		КоличествоОшибокПо3Графе = 0;
		СтрокаРазделитель = Символы.ПС + "   ";
		
		// 4) 2.1(графа3)РазделаVII*1,5%<>2.1(графа3)РазделаVIII    		
		ОписаниеУсловия = "2.1 (графа3) РазделаVII * 1,5% <> 2.1(графа3)РазделаVIII";   	
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_2_1.Графа3 *1.5 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_2_1.Графа3; 
		ОписаниеОшибки = "";
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель);
		
		// 5) 3.1(графа3)РазделаVII*7%<>3.1(графа3)РазделаVIII    		
		ОписаниеУсловия = "3.1 (графа3) РазделаVII * 7% <> 3.1 (графа3) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_3_1.Графа3 *7 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_3_1.Графа3 ;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель);
		
		
		// 6) 4.1(графа3)РазделаVII*15%<>4.1(графа3)РазделаVIII   		
		ОписаниеУсловия = "4.1 (графа3) РазделаVII * 15% <> 3.1 (графа3) РазделаVIII";
		ЗначениеЛевое =  Окр(СтруктураСтрок.Раздел7_4_1.Графа3 *15 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_4_1.Графа3 ;   
		ОписаниеОшибки = "";  
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель);
		
		// 7) 5.1(графа3)РазделаVII*30%<>5.1(графа3)РазделаVIII   		
		ОписаниеУсловия = "5.1 (графа3) РазделаVII * 30% <> 5.1 (графа3) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_5_1.Графа3 *30 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_5_1.Графа3;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель);
		
		// 8) 6.1(графа3)РазделаVII*45%<>6.1(графа3)РазделаVIII  		
		ОписаниеУсловия = "6.1 (графа3) РазделаVII * 45% <> 6.1 (графа3) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_6_1.Графа3 *45 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_6_1.Графа3;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель);
		
		
		// 9) 7.1(графа3)РазделаVII*60%<>7.1(графа3)РазделаVIII  		
		ОписаниеУсловия = "7.1 (графа3) РазделаVII * 60% <> 7.1 (графа3) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_7_1.Графа3 *60 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_7_1.Графа3;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель);
		
		// 10) 8.1(графа3)РазделаVII*75%<>8.1(графа3)РазделаVIII  		
		ОписаниеУсловия = "8.1 (графа3) РазделаVII * 75 <> 8.1 (графа3) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_8_1.Графа3 *75 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_8_1.Графа3;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель);
		
		
		// 11) 9.1(графа3)РазделаVII*100%<>9.1(графа3)РазделаVIII  		
		ОписаниеУсловия = "9.1 (графа3) РазделаVII * 100% <> 9.1 (графа3) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_9_1.Графа3 *100 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_9_1.Графа3;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель);
		
		Если КоличествоОшибокПо3Графе > 0 Тогда
			ОбластьСтрока.Область(1, 51 + КолДопКолонок, 1, 51 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо3Графе = ?(КоличествоОшибокПо3Графе = 0, "", КоличествоОшибокПо3Графе);				
		ОбластьСтрока.Параметры.ОписаниеОшибки3Графа = ОписаниеОшибки3Графа; 
		
		//// ------------------------------------------------------------
		//// 4 графа
		ОписаниеОшибки4Графа = "";
		КоличествоОшибокПо4Графе = 0;	
		
		// 12) 2.1(графа4)РазделаVII*3%<>2.1(графа4)РазделаVIII  		
		ОписаниеУсловия = "2.1 (графа4) РазделаVII * 3% <> 2.1 (графа4) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_2_1.Графа4 *3 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_2_1.Графа4;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель);
		
		// 13) 3.1(графа4)РазделаVII*10%<>3.1(графа4)РазделаVIII  				
		ОписаниеУсловия = "3.1 (графа4) РазделаVII * 10% <> 3.1 (графа4) РазделаVIII";		
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_3_1.Графа4 *10 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_3_1.Графа4;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель);
		
		// 14) 4.1(графа4)РазделаVII*20%<>4.1(графа4)РазделаVIII  		
		ОписаниеУсловия = "4.1 (графа4) РазделаVII * 20% <> 4.1 (графа4) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_4_1.Графа4 *20 /100, 3);
		ЗначениеПравое =  СтруктураСтрок.Раздел8_4_1.Графа4;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель);
		
		// 15) 5.1(графа4)РазделаVII*40%<>5.1(графа4)РазделаVIII 		
		ОписаниеУсловия = "5.1 (графа4) РазделаVII * 40% <> 5.1 (графа4) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_5_1.Графа4 *40 /100, 3);
		ЗначениеПравое =  СтруктураСтрок.Раздел8_5_1.Графа4;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель);
		
		// 16) 6.1(графа4)РазделаVII*50%<>6.1(графа4)РазделаVIII 		
		ОписаниеУсловия = "6.1 (графа4) РазделаVII * 50% <> 6.1 (графа4) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_6_1.Графа4 *50 /100, 3);
		ЗначениеПравое =  СтруктураСтрок.Раздел8_6_1.Графа4;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель);
		
		// 17) 7.1(графа4)РазделаVII*65%<>7.1(графа4)РазделаVIII 		
		ОписаниеУсловия = "7.1 (графа4) РазделаVII * 65% <> 7.1 (графа4) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_7_1.Графа4 *65 /100, 3) ;
		ЗначениеПравое =  СтруктураСтрок.Раздел8_7_1.Графа4;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель);
		
		// 18) 8.1(графа4)РазделаVII*80%<>8.1(графа4)РазделаVIII		
		ОписаниеУсловия = "8.1 (графа4) РазделаVII * 80% <> 8.1 (графа4) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_8_1.Графа4 *80 /100, 3);
		ЗначениеПравое =  СтруктураСтрок.Раздел8_8_1.Графа4;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель);
		
		
		// 19) 9.1(графа4)РазделаVII*100%<>9.1(графа4)РазделаVIII		
		ОписаниеУсловия = "9.1 (графа4) РазделаVII * 100% <> 9.1 (графа4) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_9_1.Графа4 *100 /100, 3);
		ЗначениеПравое =  СтруктураСтрок.Раздел8_9_1.Графа4;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель);
		
		
		Если КоличествоОшибокПо4Графе > 0 Тогда
			ОбластьСтрока.Область(1, 52 + КолДопКолонок, 1, 52 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо4Графе = ?(КоличествоОшибокПо4Графе = 0, "", КоличествоОшибокПо4Графе);				
		ОбластьСтрока.Параметры.ОписаниеОшибки4Графа = ОписаниеОшибки4Графа; 
		
		
		// ------------------------------------------------------------
		// 5 графа   		
		
		ОписаниеОшибки5Графа = "";
		КоличествоОшибокПо5Графе = 0;
		
		// 20) 2.1(графа5)РазделаVII*1,5%<>2.1(графа5)РазделаVIII 		
		ОписаниеУсловия = "2.1 (графа5) РазделаVII * 1,5% <> 2.1 (графа5) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_2_1.Графа5 *1.5 /100, 3);
		ЗначениеПравое =  СтруктураСтрок.Раздел8_2_1.Графа5;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель);
		
		
		// 21) 3.1(графа5)РазделаVII*7%<>3.1(графа5)РазделаVIII 		
		ОписаниеУсловия = "3.1 (графа5) РазделаVII * 7% <> 3.1 (графа5) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_3_1.Графа5 *7 /100, 3);
		ЗначениеПравое =  СтруктураСтрок.Раздел8_3_1.Графа5;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель);
		
		// 22) 4.1(графа5)РазделаVII*15%<>4.1(графа5)РазделаVIII		
		ОписаниеУсловия = "4.1 (графа5) РазделаVII * 15% <> 4.1 (графа5) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_4_1.Графа5 *15 /100, 3);
		ЗначениеПравое =  СтруктураСтрок.Раздел8_4_1.Графа5;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель);
		
		// 23) 5.1(графа5)РазделаVII*35%<>5.1(графа5)РазделаVIII 		
		ОписаниеУсловия = "5.1 (графа5) РазделаVII * 35% <> 5.1 (графа5) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_5_1.Графа5 *35 /100, 3);
		ЗначениеПравое =  СтруктураСтрок.Раздел8_5_1.Графа5;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель);
		
		// 24) 6.1(графа5)РазделаVII*55%<>6.1(графа5)РазделаVIII 		
		ОписаниеУсловия = "6.1 (графа5) РазделаVII * 55% <> 6.1 (графа5) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_6_1.Графа5 *55 /100, 3);
		ЗначениеПравое =  СтруктураСтрок.Раздел8_6_1.Графа5;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель);
		
		// 25) 7.1(графа5)РазделаVII*75%<>7.1(графа5)РазделаVIII		
		ОписаниеУсловия = "7.1 (графа5) РазделаVII * 75% <> 7.1 (графа5) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_7_1.Графа5 *75 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_7_1.Графа5;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель);
		
		// 26) 8.1(графа5)РазделаVII*95%<>8.1(графа5)РазделаVIII		
		ОписаниеУсловия = "8.1 (графа5) РазделаVII * 95% <> 8.1 (графа5) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_8_1.Графа5 *95 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_8_1.Графа5;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель);
		
		// 27) 9.1(графа5)РазделаVII*100%<>9.1(графа5)РазделаVIII		
		ОписаниеУсловия = "9.1 (графа5) РазделаVII * 100% <> 9.1 (графа5) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_9_1.Графа5 *100 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_9_1.Графа5;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель);
		
		Если КоличествоОшибокПо5Графе > 0 Тогда
			ОбластьСтрока.Область(1, 53 + КолДопКолонок, 1, 53 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо5Графе = ?(КоличествоОшибокПо5Графе = 0, "", КоличествоОшибокПо5Графе);				
		ОбластьСтрока.Параметры.ОписаниеОшибки5Графа = ОписаниеОшибки5Графа; 
		
		
		// ------------------------------------------------------------
		// 6 графа
		
		ОписаниеОшибки6Графа = "";
		КоличествоОшибокПо6Графе = 0;
		
		// 28) 2.1(графа6)РазделаVII*3%<>2.1(графа6)РазделаVIII		
		ОписаниеУсловия = "2.1 (графа6) РазделаVII * 3% <> 2.1 (графа6) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_2_1.Графа6 *3 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_2_1.Графа6;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель);
		
		// 29) 3.1(графа6)РазделаVII*10%<>3.1(графа6)РазделаVIII		
		ОписаниеУсловия = "3.1 (графа6) РазделаVII * 10% <> 3.1 (графа6) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_3_1.Графа6 *10 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_3_1.Графа6;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель);
		
		// 30) 4.1(графа6)РазделаVII*20%<>4.1(графа6)РазделаVIII		
		ОписаниеУсловия = "4.1 (графа6) РазделаVII * 20% <> 4.1 (графа6) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_4_1.Графа6 *20 /100, 3) ;
		ЗначениеПравое = СтруктураСтрок.Раздел8_4_1.Графа6;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель);
		
		// 31) 5.1(графа6)РазделаVII*45%<>5.1(графа6)РазделаVIII 		
		ОписаниеУсловия = "5.1 (графа6) РазделаVII * 45% <> 5.1 (графа6) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_5_1.Графа6 *45 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_5_1.Графа6;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель);
		
		// 32) 6.1(графа6)РазделаVII*70%<>6.1(графа6)РазделаVIII 		
		ОписаниеУсловия = "6.1 (графа6) РазделаVII * 70% <> 6.1 (графа6) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_6_1.Графа6 *70 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_6_1.Графа6;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель);
		
		// 33) 7.1(графа6)РазделаVII*90%<>7.1(графа6)РазделаVIII		
		ОписаниеУсловия = "7.1 (графа6) РазделаVII * 90% <> 7.1 (графа6) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_7_1.Графа6 *90 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_7_1.Графа6;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель);
		
		// 34) 8.1(графа6)РазделаVII*100%<>8.1(графа6)РазделаVIII		
		ОписаниеУсловия = "8.1 (графа6) РазделаVII * 100% <> 8.1 (графа6) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_8_1.Графа6 *100 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_8_1.Графа6;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель);
		
		// 35) 9.1(графа6)РазделаVII*100%<>9.1(графа6)РазделаVIII		
		ОписаниеУсловия = "9.1 (графа6) РазделаVII * 100% <> 9.1 (графа6) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_9_1.Графа6 *100 /100, 3) ;
		ЗначениеПравое = СтруктураСтрок.Раздел8_9_1.Графа6;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель);
		
		Если КоличествоОшибокПо6Графе > 0 Тогда
			ОбластьСтрока.Область(1, 54 + КолДопКолонок, 1, 54 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо6Графе = ?(КоличествоОшибокПо6Графе = 0, "", КоличествоОшибокПо6Графе);				
		ОбластьСтрока.Параметры.ОписаниеОшибки6Графа = ОписаниеОшибки6Графа; 
		
		
		// ------------------------------------------------------------
		// 7 графа
		
		ОписаниеОшибки7Графа = "";
		КоличествоОшибокПо7Графе = 0;
		
		// 36) 2.1(графа6)РазделаVII*3%<>2.1(графа6)РазделаVIII		
		ОписаниеУсловия = "2.1 (графа7) РазделаVII * 5% <> 2.1 (графа7) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_2_1.Графа7 *5 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_2_1.Графа7;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель);
		
		// 37) 3.1(графа7)РазделаVII*20%<>3.1(графа7)РазделаVIII		
		ОписаниеУсловия = "3.1 (графа7) РазделаVII * 20% <> 3.1 (графа7) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_3_1.Графа7 *20 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_3_1.Графа7;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель);
		
		// 38) 4.1(графа7)РазделаVII*40%<>4.1(графа7)РазделаVIIII		
		ОписаниеУсловия = "4.1 (графа7) РазделаVII * 40% <> 4.1 (графа7) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_4_1.Графа7 *40 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_4_1.Графа7;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель);
		
		// 39) 5.1(графа7)РазделаVII*60%<>5.1(графа7)РазделаVIII		
		ОписаниеУсловия = "5.1 (графа7) РазделаVII * 60% <> 5.1 (графа7) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_5_1.Графа7 *60 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_5_1.Графа7;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель);
		
		// 40) 6.1(графа7)РазделаVII*80%<>6.1(графа7)РазделаVIII 		
		ОписаниеУсловия = "6.1 (графа7) РазделаVII * 80% <> 6.1 (графа7) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_6_1.Графа7 *80 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_6_1.Графа7;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель);
		
		// 41) 7.1(графа7)РазделаVII*95%<>7.1(графа7)РазделаVIII		
		ОписаниеУсловия = "7.1 (графа7) РазделаVII * 95% <> 7.1 (графа7) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_7_1.Графа7 *95 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_7_1.Графа7;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель);
		
		// 42) 8.1(графа7)РазделаVII*100%<>8.1(графа7)РазделаVIIII		
		ОписаниеУсловия = "8.1 (графа7) РазделаVII * 100% <> 8.1 (графа7) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_8_1.Графа7 *100 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_8_1.Графа7;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель);
		
		// 43) 9.1(графа7)РазделаVII*100%<>9.1(графа7)РазделаVIII		
		ОписаниеУсловия = "9.1 (графа7) РазделаVII * 100% <> 9.1 (графа7) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_9_1.Графа7 *100 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_9_1.Графа7;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель);
		
		Если КоличествоОшибокПо7Графе > 0 Тогда
			ОбластьСтрока.Область(1, 55 + КолДопКолонок, 1, 55 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо7Графе = ?(КоличествоОшибокПо7Графе = 0, "", КоличествоОшибокПо7Графе);				
		ОбластьСтрока.Параметры.ОписаниеОшибки7Графа = ОписаниеОшибки7Графа; 
		
		// ------------------------------------------------------------
		// 8 графа
		
		ОписаниеОшибки8Графа = "";
		КоличествоОшибокПо8Графе = 0;
		
		// 44) 2.1(графа8)РазделаVII*10%<>2.1(графа8)РазделаVIII
		ОписаниеУсловия = "2.1 (графа8) РазделаVII * 10% <> 2.1 (графа8) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_2_1.Графа8 *10 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_2_1.Графа8;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель);
		
		// 45) 3.1(графа8)РазделаVII*30%<>3.1(графа8)РазделаVIII		
		ОписаниеУсловия = "3.1 (графа8) РазделаVII * 30% <> 3.1 (графа8) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_3_1.Графа8 *30 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_3_1.Графа8;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель);
		
		// 46) 4.1(графа8)РазделаVII*50%<>4.1(графа8)РазделаVIII		
		ОписаниеУсловия = "4.1 (графа8) РазделаVII * 50% <> 4.1 (графа8) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_4_1.Графа8 *50 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_4_1.Графа8;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель);
		
		// 47) 5.1(графа8)РазделаVII*70%<>5.1(графа8)РазделаVIII		
		ОписаниеУсловия = "5.1 (графа8) РазделаVII * 70% <> 5.1 (графа8) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_5_1.Графа8 *70 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_5_1.Графа8;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель);
		
		// 48) 6.1(графа8)РазделаVII*90%<>6.1(графа8)РазделаVIII		
		ОписаниеУсловия = "6.1 (графа8) РазделаVII * 90% <> 6.1 (графа8) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_6_1.Графа8 *90 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_6_1.Графа8;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель);
		
		// 49) 7.1(графа8)РазделаVII*100%<>7.1(графа8)РазделаVIII		
		ОписаниеУсловия = "7.1 (графа8) РазделаVII * 100% <> 7.1 (графа8) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_7_1.Графа8 *100 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_7_1.Графа8;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель);
		
		// 50) 8.1(графа8)РазделаVII*100%<>8.1(графа8)РазделаVIIII		
		ОписаниеУсловия = "8.1 (графа8) РазделаVII * 100% <> 8.1 (графа8) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_8_1.Графа8 *100 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_8_1.Графа8;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель);
		
		// 51) 9.1(графа8)РазделаVII*100%<>9.1(графа8)РазделаVIII		
		ОписаниеУсловия = "9.1 (графа8) РазделаVII * 100% <> 9.1 (графа8) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_9_1.Графа8 *100 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_9_1.Графа8;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель);
		
		Если КоличествоОшибокПо8Графе > 0 Тогда
			ОбластьСтрока.Область(1, 56 + КолДопКолонок, 1, 56 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо8Графе = ?(КоличествоОшибокПо8Графе = 0, "", КоличествоОшибокПо8Графе);				
		ОбластьСтрока.Параметры.ОписаниеОшибки8Графа = ОписаниеОшибки8Графа; 
		
		
		
		//////////////////////////////////////////////////////
		//    Проценты                                      //
		//////////////////////////////////////////////////////
		
		// 1) 1.2(графы 3,4,5,6)РазделаVIII<>0  - создание резерва для данных категорий не предусмотрено;
		
		ОписаниеУсловия = "1.2 (графы 3,4,5,6) РазделаVIII <> 0  - создание резерва для данных категорий не предусмотрено";
		ОписаниеОшибки = "";
		Если СтруктураСтрок.Раздел8_1_2.Графа3 <> 0 ИЛИ СтруктураСтрок.Раздел8_1_2.Графа4 <> 0 ИЛИ СтруктураСтрок.Раздел8_1_2.Графа5 <> 0 ИЛИ СтруктураСтрок.Раздел8_1_2.Графа6 <> 0 Тогда
			Если СтруктураСтрок.Раздел8_1_2.Графа3 <> 0 Тогда
				ОписаниеОшибки = ?(ОписаниеОшибки = "", "", Символы.ПС) + ОписаниеОшибки + "1.2 РазделаVIII Графа 3 = " + Строка(СтруктураСтрок.Раздел8_1_2.Графа3);
				ВсегоОшибок = ВсегоОшибок + 1;   
			КонецЕсли;
			
			Если СтруктураСтрок.Раздел8_1_2.Графа4 <> 0 Тогда
				ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "1.2 РазделаVIII Графа 4 = " + Строка(СтруктураСтрок.Раздел8_1_2.Графа4);	
				ВсегоОшибок = ВсегоОшибок + 1;   
			КонецЕсли;
			
			Если СтруктураСтрок.Раздел8_1_2.Графа5 <> 0 Тогда
				ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "1.2 РазделаVIII Графа 5 = " + Строка(СтруктураСтрок.Раздел8_1_2.Графа5);		
				ВсегоОшибок = ВсегоОшибок + 1;   
			КонецЕсли;
			
			Если СтруктураСтрок.Раздел8_1_2.Графа6 <> 0 Тогда
				ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "1.2 РазделаVIII Графа 6 = " + Строка(СтруктураСтрок.Раздел8_1_2.Графа6);		
				ВсегоОшибок = ВсегоОшибок + 1;   
			КонецЕсли;
			
			ОбластьСтрока.Область(1, 57 + КолДопКолонок, 1, 57 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		Проверка5_4 =  ОписаниеУсловия+?(ОписаниеОшибки="", "", Символы.ПС + ОписаниеОшибки);
		ОбластьСтрока.Параметры.Проверка5_4 = Проверка5_4;
		
		Если ОписаниеОшибки <> "" Тогда
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
		КонецЕсли;
		
		
		// 2) 1.1(графа7)РазделаVIII/1.1(графа7)РазделаVII*100<>1.2(графа7)Раздела VIII/1.2(графа7)РазделаVII*100
		ОписаниеУсловия = "1.1 (графа7) РазделаVIII / 1.1 (графа7) РазделаVII * 100 <> 1.2 (графа7) Раздела VIII / 1.2 (графа7) Раздела VII * 100";
		ОписаниеОшибки = "";
		
		Если СтруктураСтрок.Раздел7_1_1.Графа7 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_1_1.Графа7 / СтруктураСтрок.Раздел7_1_1.Графа7*100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_1_2.Графа7 = 0 Тогда
			Если СтруктураСтрок.Раздел8_1_2.Графа7 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе	 			
				ЗначениеПравое = 0;	
			КонецЕсли;
		Иначе
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_1_2.Графа7  / СтруктураСтрок.Раздел7_1_2.Графа7*100, 0);	
		КонецЕсли; 		     		
		
		Если ЗначениеЛевое <> ЗначениеПравое Тогда		
			ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_1_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_1_1.Графа7) + " * 100 <> " + Строка(СтруктураСтрок.Раздел8_1_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_1_2.Графа7) + " * 100";
			ОбластьСтрока.Область(1, 58 + КолДопКолонок, 1, 58 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
			ВсегоОшибок = ВсегоОшибок + 1;   
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
		КонецЕсли;
		
		Проверка5_5 = ОписаниеУсловия+?(ОписаниеОшибки="", "", Символы.ПС+ОписаниеОшибки);					
		ОбластьСтрока.Параметры.Проверка5_5 = Проверка5_5;
		
		// 3) 1.1(графа8)РазделаVIII/1.1(графа8)РазделаVII*100<>1.2(графа8)Раздела VIII/1.2(графа8)РазделаVII*100   		
		ОписаниеУсловия = "1.1 (графа8) РазделаVIII / 1.1(графа8)РазделаVII * 100 <> 1.2 (графа8) Раздела VIII / 1.2 (графа8) РазделаVII * 100";
		ОписаниеОшибки = "";
		
		Если СтруктураСтрок.Раздел7_1_1.Графа8 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_1_1.Графа8 / СтруктураСтрок.Раздел7_1_1.Графа8*100, 0) ;
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_1_2.Графа8 = 0 Тогда
			Если СтруктураСтрок.Раздел8_1_2.Графа8 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе	 
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_1_2.Графа8 / СтруктураСтрок.Раздел7_1_2.Графа8*100, 0);
		КонецЕсли;    		
		
		Если ЗначениеЛевое <> ЗначениеПравое Тогда		
			
			ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_1_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_1_1.Графа8) + " * 100 <> " + Строка(СтруктураСтрок.Раздел8_1_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_1_2.Графа8) + " * 100";
			
			ОбластьСтрока.Область(1, 59 + КолДопКолонок, 1, 59 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
			ВсегоОшибок = ВсегоОшибок + 1;   
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);    		
		КонецЕсли;
		
		Проверка5_6 = ОписаниеУсловия+?(ОписаниеОшибки="", "", Символы.ПС+ОписаниеОшибки);
		ОбластьСтрока.Параметры.Проверка5_6 = Проверка5_6; 
		
		
		// ------------------------------------------------------------
		// 3 графа проценты
		ОписаниеОшибки3Графа = "(Проценты) ";
		КоличествоОшибокПо3ГрафеПроценты = 0;
		
		
		// 4) 2.1 (графа3) РазделаVIII / 2.1 (графа3) РазделаVII*100 <> 2.2 (графа3) РазделаVIII / 2.2 (графа3) РазделаVII*100   		
		ОписаниеУсловия = "2.1 (графа3) РазделаVIII / 2.1 (графа3) РазделаVII*100 <> 2.2 (графа3) РазделаVIII / 2.2 (графа3) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_2_1.Графа3 = 0 Тогда  
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_2_1.Графа3 / СтруктураСтрок.Раздел7_2_1.Графа3 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_2_2.Графа3 = 0 Тогда    					
			Если СтруктураСтрок.Раздел8_2_2.Графа3 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе	
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_2_2.Графа3 / СтруктураСтрок.Раздел7_2_2.Графа3 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_2_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_2_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_2_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_2_2.Графа3) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель);
		
		// 5) 3.1 (графа3) РазделаVIII / 3.1 (графа3) РазделаVII*100 <> 3.2 (графа3) РазделаVIII / 3.2 (графа3) РазделаVII*100   		
		ОписаниеУсловия = "3.1 (графа3) РазделаVIII / 3.1 (графа3) РазделаVII*100 <> 3.2 (графа3) РазделаVIII / 3.2 (графа3) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_3_1.Графа3 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_3_1.Графа3 / СтруктураСтрок.Раздел7_3_1.Графа3 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_3_2.Графа3 = 0 Тогда
			Если СтруктураСтрок.Раздел8_3_2.Графа3 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе	
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_3_2.Графа3 / СтруктураСтрок.Раздел7_3_2.Графа3 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_3_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_3_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_3_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_3_2.Графа3) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель);
		
		// 6) 4.1 (графа3) РазделаVIII / 4.1 (графа3) РазделаVII*100 <> 4.2 (графа3) РазделаVIII / 4.2 (графа3) РазделаVII*100   		
		ОписаниеУсловия = "4.1 (графа3) РазделаVIII / 4.1 (графа3) РазделаVII*100 <> 4.2 (графа3) РазделаVIII / 4.2 (графа3) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_4_1.Графа3 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_4_1.Графа3 / СтруктураСтрок.Раздел7_4_1.Графа3 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_4_2.Графа3 = 0 Тогда
			Если СтруктураСтрок.Раздел8_4_2.Графа3 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе	  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_4_2.Графа3 / СтруктураСтрок.Раздел7_4_2.Графа3 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_4_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_4_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_4_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_4_2.Графа3) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель);
		
		// 7) 5.1 (графа3) РазделаVIII / 5.1 (графа3) РазделаVII*100 <> 5.2 (графа3) РазделаVIII / 5.2 (графа3) РазделаVII*100   		
		ОписаниеУсловия = "5.1 (графа3) РазделаVIII / 5.1 (графа3) РазделаVII*100 <> 5.2 (графа3) РазделаVIII / 5.2 (графа3) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_5_1.Графа3 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_5_1.Графа3 / СтруктураСтрок.Раздел7_5_1.Графа3 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_5_2.Графа3 = 0 Тогда
			Если СтруктураСтрок.Раздел8_5_2.Графа3 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе	  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_5_2.Графа3 / СтруктураСтрок.Раздел7_5_2.Графа3 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_5_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_5_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_5_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_5_2.Графа3) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель);
		
		// 8) 6.1 (графа3) РазделаVIII / 6.1 (графа3) РазделаVII*100 <> 6.2 (графа3) РазделаVIII / 6.2 (графа3) РазделаVII*100   		
		ОписаниеУсловия = "6.1 (графа3) РазделаVIII / 6.1 (графа3) РазделаVII*100 <> 6.2 (графа3) РазделаVIII / 6.2 (графа3) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_6_1.Графа3 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_6_1.Графа3 / СтруктураСтрок.Раздел7_6_1.Графа3 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_6_2.Графа3 = 0 Тогда
			Если СтруктураСтрок.Раздел8_6_2.Графа3 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе	  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_6_2.Графа3 / СтруктураСтрок.Раздел7_6_2.Графа3 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_6_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_6_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_6_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_6_2.Графа3) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель);
		
		// 9) 7.1 (графа3) РазделаVIII / 7.1 (графа3) РазделаVII*100 <> 7.2 (графа3) РазделаVIII / 7.2 (графа3) РазделаVII*100   		
		ОписаниеУсловия = "7.1 (графа3) РазделаVIII / 7.1 (графа3) РазделаVII*100 <> 7.2 (графа3) РазделаVIII / 7.2 (графа3) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_7_1.Графа3 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_7_1.Графа3 / СтруктураСтрок.Раздел7_7_1.Графа3 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_7_2.Графа3 = 0 Тогда
			Если СтруктураСтрок.Раздел8_7_2.Графа3 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_7_2.Графа3 / СтруктураСтрок.Раздел7_7_2.Графа3 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_7_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_7_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_7_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_7_2.Графа3) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель);
		
		// 10) 8.1 (графа3) РазделаVIII / 8.1 (графа3) РазделаVII*100 <> 8.2 (графа3) РазделаVIII / 8.2 (графа3) РазделаVII*100   		
		ОписаниеУсловия = "8.1 (графа3) РазделаVIII / 8.1 (графа3) РазделаVII*100 <> 8.2 (графа3) РазделаVIII / 8.2 (графа3) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_8_1.Графа3 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_8_1.Графа3 / СтруктураСтрок.Раздел7_8_1.Графа3 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_8_2.Графа3 = 0 Тогда
			Если СтруктураСтрок.Раздел8_8_2.Графа3 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_8_2.Графа3 / СтруктураСтрок.Раздел7_8_2.Графа3 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_8_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_8_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_8_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_8_2.Графа3) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель);
		
		// 11) 9.1 (графа3) РазделаVIII / 9.1 (графа3) РазделаVII*100 <> 9.2 (графа3) РазделаVIII / 9.2 (графа3) РазделаVII*100   		
		ОписаниеУсловия = "9.1 (графа3) РазделаVIII / 9.1 (графа3) РазделаVII*100 <> 9.2 (графа3) РазделаVIII / 9.2 (графа3) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_9_1.Графа3 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_9_1.Графа3 / СтруктураСтрок.Раздел7_9_1.Графа3 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_9_2.Графа3 = 0 Тогда
			Если СтруктураСтрок.Раздел8_9_2.Графа3 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_9_2.Графа3 / СтруктураСтрок.Раздел7_9_2.Графа3 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_9_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_9_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_9_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_9_2.Графа3) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель);
		
		Если КоличествоОшибокПо3ГрафеПроценты > 0 Тогда
			ОбластьСтрока.Область(1, 60 + КолДопКолонок, 1, 60 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо3ГрафеПроценты = ?(КоличествоОшибокПо3ГрафеПроценты = 0, "", КоличествоОшибокПо3ГрафеПроценты);				
		ОбластьСтрока.Параметры.ОписаниеОшибки3Графа = ОписаниеОшибки3Графа; 
		
		// 4 графа проценты
		ОписаниеОшибки4Графа = "(Проценты) ";
		КоличествоОшибокПо4ГрафеПроценты = 0;
		
		
		// 12) 2.1 (Графа4) РазделаVIII / 2.1 (графа4) РазделаVII*100 <> 2.2 (графа4) РазделаVIII / 2.2 (графа4) РазделаVII*100   		
		ОписаниеУсловия = "2.1 (графа4) РазделаVIII / 2.1 (графа4) РазделаVII*100 <> 2.2 (графа4) РазделаVIII / 2.2 (графа4) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_2_1.Графа4 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_2_1.Графа4 / СтруктураСтрок.Раздел7_2_1.Графа4 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_2_2.Графа4 = 0 Тогда
			Если СтруктураСтрок.Раздел8_2_2.Графа4 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_2_2.Графа4 / СтруктураСтрок.Раздел7_2_2.Графа4 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_2_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_2_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_2_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_2_2.Графа4) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель);
		
		// 13) 3.1 (графа4) РазделаVIII / 3.1 (графа4) РазделаVII*100 <> 3.2 (графа4) РазделаVIII / 3.2 (графа4) РазделаVII*100   		
		ОписаниеУсловия = "3.1 (графа4) РазделаVIII / 3.1 (графа4) РазделаVII*100 <> 3.2 (графа4) РазделаVIII / 3.2 (графа4) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_3_1.Графа4 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_3_1.Графа4 / СтруктураСтрок.Раздел7_3_1.Графа4 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_3_2.Графа4 = 0 Тогда
			Если СтруктураСтрок.Раздел8_3_2.Графа4 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_3_2.Графа4 / СтруктураСтрок.Раздел7_3_2.Графа4 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_3_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_3_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_3_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_3_2.Графа4) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель);
		
		// 14) 4.1 (графа4) РазделаVIII / 4.1 (графа4) РазделаVII*100 <> 4.2 (графа4) РазделаVIII / 4.2 (графа4) РазделаVII*100   		
		ОписаниеУсловия = "4.1 (графа4) РазделаVIII / 4.1 (графа4) РазделаVII*100 <> 4.2 (графа4) РазделаVIII / 4.2 (графа4) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_4_1.Графа4 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_4_1.Графа4 / СтруктураСтрок.Раздел7_4_1.Графа4 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_4_2.Графа4 = 0 Тогда
			Если СтруктураСтрок.Раздел8_4_2.Графа4 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_4_2.Графа4 / СтруктураСтрок.Раздел7_4_2.Графа4 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_4_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_4_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_4_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_4_2.Графа4) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель);
		
		// 15) 5.1 (графа4) РазделаVIII / 5.1 (графа4) РазделаVII*100 <> 5.2 (графа4) РазделаVIII / 5.2 (графа4) РазделаVII*100   		
		ОписаниеУсловия = "5.1 (графа4) РазделаVIII / 5.1 (графа4) РазделаVII*100 <> 5.2 (графа4) РазделаVIII / 5.2 (графа4) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_5_1.Графа4 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_5_1.Графа4 / СтруктураСтрок.Раздел7_5_1.Графа4 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_5_2.Графа4 = 0 Тогда
			Если СтруктураСтрок.Раздел8_5_2.Графа4 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_5_2.Графа4 / СтруктураСтрок.Раздел7_5_2.Графа4 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_5_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_5_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_5_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_5_2.Графа4) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель);
		
		// 16) 6.1 (графа4) РазделаVIII / 6.1 (графа4) РазделаVII*100 <> 6.2 (графа4) РазделаVIII / 6.2 (графа4) РазделаVII*100   		
		ОписаниеУсловия = "6.1 (графа4) РазделаVIII / 6.1 (графа4) РазделаVII*100 <> 6.2 (графа4) РазделаVIII / 6.2 (графа4) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_6_1.Графа4 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_6_1.Графа4 / СтруктураСтрок.Раздел7_6_1.Графа4 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_6_2.Графа4 = 0 Тогда
			Если СтруктураСтрок.Раздел8_6_2.Графа4 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе    
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_6_2.Графа4 / СтруктураСтрок.Раздел7_6_2.Графа4 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_6_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_6_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_6_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_6_2.Графа4) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель);
		
		// 17) 7.1 (графа4) РазделаVIII / 7.1 (графа4) РазделаVII*100 <> 7.2 (графа4) РазделаVIII / 7.2 (графа4) РазделаVII*100   		
		ОписаниеУсловия = "7.1 (графа4) РазделаVIII / 7.1 (графа4) РазделаVII*100 <> 7.2 (графа4) РазделаVIII / 7.2 (графа4) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_7_1.Графа4 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_7_1.Графа4 / СтруктураСтрок.Раздел7_7_1.Графа4 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_7_2.Графа4 = 0 Тогда
			Если СтруктураСтрок.Раздел8_7_2.Графа4 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_7_2.Графа4 / СтруктураСтрок.Раздел7_7_2.Графа4 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_7_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_7_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_7_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_7_2.Графа4) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель);
		
		// 18) 8.1 (графа4) РазделаVIII / 8.1 (графа4) РазделаVII*100 <> 8.2 (графа4) РазделаVIII / 8.2 (графа4) РазделаVII*100   		
		ОписаниеУсловия = "8.1 (графа4) РазделаVIII / 8.1 (графа4) РазделаVII*100 <> 8.2 (графа4) РазделаVIII / 8.2 (графа4) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_8_1.Графа4 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_8_1.Графа4 / СтруктураСтрок.Раздел7_8_1.Графа4 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_8_2.Графа4 = 0 Тогда
			Если СтруктураСтрок.Раздел8_8_2.Графа4 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_8_2.Графа4 / СтруктураСтрок.Раздел7_8_2.Графа4 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_8_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_8_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_8_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_8_2.Графа4) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель);
		
		// 19) 9.1 (графа4) РазделаVIII / 9.1 (графа4) РазделаVII*100 <> 9.2 (графа4) РазделаVIII / 9.2 (графа4) РазделаVII*100   		
		ОписаниеУсловия = "9.1 (графа4) РазделаVIII / 9.1 (графа4) РазделаVII*100 <> 9.2 (графа4) РазделаVIII / 9.2 (графа4) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_9_1.Графа4 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_9_1.Графа4 / СтруктураСтрок.Раздел7_9_1.Графа4 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_9_2.Графа4 = 0 Тогда
			Если СтруктураСтрок.Раздел8_9_2.Графа4 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_9_2.Графа4 / СтруктураСтрок.Раздел7_9_2.Графа4 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_9_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_9_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_9_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_9_2.Графа4) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель);
		
		Если КоличествоОшибокПо4ГрафеПроценты > 0 Тогда
			ОбластьСтрока.Область(1, 61 + КолДопКолонок, 1, 61 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо4ГрафеПроценты = ?(КоличествоОшибокПо4ГрафеПроценты = 0, "", КоличествоОшибокПо4ГрафеПроценты);				
		ОбластьСтрока.Параметры.ОписаниеОшибки4Графа = ОписаниеОшибки4Графа; 
		
		
		// 5 графа проценты
		ОписаниеОшибки5Графа = "(Проценты) ";
		КоличествоОшибокПо5ГрафеПроценты = 0;
		
		// 20) 2.1 (Графа5) РазделаVIII / 2.1 (Графа5) РазделаVII*100 <> 2.2 (Графа5) РазделаVIII / 2.2 (Графа5) РазделаVII*100   		
		ОписаниеУсловия = "2.1 (Графа5) РазделаVIII / 2.1 (Графа5) РазделаVII*100 <> 2.2 (Графа5) РазделаVIII / 2.2 (Графа5) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_2_1.Графа5 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_2_1.Графа5 / СтруктураСтрок.Раздел7_2_1.Графа5 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_2_2.Графа5 = 0 Тогда
			Если СтруктураСтрок.Раздел8_2_2.Графа5 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе      
				ЗначениеПравое = 0;
			КонецЕсли; 
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_2_2.Графа5 / СтруктураСтрок.Раздел7_2_2.Графа5 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_2_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_2_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_2_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_2_2.Графа5) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель);
		
		// 21) 3.1 (Графа5) РазделаVIII / 3.1 (Графа5) РазделаVII*100 <> 3.2 (Графа5) РазделаVIII / 3.2 (Графа5) РазделаVII*100   		
		ОписаниеУсловия = "3.1 (Графа5) РазделаVIII / 3.1 (Графа5) РазделаVII*100 <> 3.2 (Графа5) РазделаVIII / 3.2 (Графа5) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_3_1.Графа5 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_3_1.Графа5 / СтруктураСтрок.Раздел7_3_1.Графа5 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_3_2.Графа5 = 0 Тогда
			Если СтруктураСтрок.Раздел8_3_2.Графа5 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_3_2.Графа5 / СтруктураСтрок.Раздел7_3_2.Графа5 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_3_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_3_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_3_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_3_2.Графа5) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель);
		
		// 22) 4.1 (Графа5) РазделаVIII / 4.1 (Графа5) РазделаVII*100 <> 4.2 (Графа5) РазделаVIII / 4.2 (Графа5) РазделаVII*100   		
		ОписаниеУсловия = "4.1 (Графа5) РазделаVIII / 4.1 (Графа5) РазделаVII*100 <> 4.2 (Графа5) РазделаVIII / 4.2 (Графа5) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_4_1.Графа5 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_4_1.Графа5 / СтруктураСтрок.Раздел7_4_1.Графа5 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_4_2.Графа5 = 0 Тогда
			Если СтруктураСтрок.Раздел8_4_2.Графа5 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли; 
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_4_2.Графа5 / СтруктураСтрок.Раздел7_4_2.Графа5 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_4_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_4_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_4_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_4_2.Графа5) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель);
		
		// 23) 5.1 (Графа5) РазделаVIII / 5.1 (Графа5) РазделаVII*100 <> 5.2 (Графа5) РазделаVIII / 5.2 (Графа5) РазделаVII*100   		
		ОписаниеУсловия = "5.1 (Графа5) РазделаVIII / 5.1 (Графа5) РазделаVII*100 <> 5.2 (Графа5) РазделаVIII / 5.2 (Графа5) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_5_1.Графа5 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_5_1.Графа5 / СтруктураСтрок.Раздел7_5_1.Графа5 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_5_2.Графа5 = 0 Тогда
			Если СтруктураСтрок.Раздел8_5_2.Графа5 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_5_2.Графа5 / СтруктураСтрок.Раздел7_5_2.Графа5 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_5_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_5_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_5_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_5_2.Графа5) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель);
		
		// 24) 6.1 (Графа5) РазделаVIII / 6.1 (Графа5) РазделаVII*100 <> 6.2 (Графа5) РазделаVIII / 6.2 (Графа5) РазделаVII*100   		
		ОписаниеУсловия = "6.1 (Графа5) РазделаVIII / 6.1 (Графа5) РазделаVII*100 <> 6.2 (Графа5) РазделаVIII / 6.2 (Графа5) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_6_1.Графа5 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_6_1.Графа5 / СтруктураСтрок.Раздел7_6_1.Графа5 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_6_2.Графа5 = 0 Тогда
			Если СтруктураСтрок.Раздел8_6_2.Графа5 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_6_2.Графа5 / СтруктураСтрок.Раздел7_6_2.Графа5 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_6_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_6_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_6_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_6_2.Графа5) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель);
		
		// 25) 7.1 (Графа5) РазделаVIII / 7.1 (Графа5) РазделаVII*100 <> 7.2 (Графа5) РазделаVIII / 7.2 (Графа5) РазделаVII*100   		
		ОписаниеУсловия = "7.1 (Графа5) РазделаVIII / 7.1 (Графа5) РазделаVII*100 <> 7.2 (Графа5) РазделаVIII / 7.2 (Графа5) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_7_1.Графа5 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_7_1.Графа5 / СтруктураСтрок.Раздел7_7_1.Графа5 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_7_2.Графа5 = 0 Тогда
			Если СтруктураСтрок.Раздел8_7_2.Графа5 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_7_2.Графа5 / СтруктураСтрок.Раздел7_7_2.Графа5 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_7_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_7_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_7_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_7_2.Графа5) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель);
		
		// 26) 8.1 (Графа5) РазделаVIII / 8.1 (Графа5) РазделаVII*100 <> 8.2 (Графа5) РазделаVIII / 8.2 (Графа5) РазделаVII*100   		
		ОписаниеУсловия = "8.1 (Графа5) РазделаVIII / 8.1 (Графа5) РазделаVII*100 <> 8.2 (Графа5) РазделаVIII / 8.2 (Графа5) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_8_1.Графа5 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_8_1.Графа5 / СтруктураСтрок.Раздел7_8_1.Графа5 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_8_2.Графа5 = 0 Тогда
			Если СтруктураСтрок.Раздел8_8_2.Графа5 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_8_2.Графа5 / СтруктураСтрок.Раздел7_8_2.Графа5 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_8_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_8_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_8_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_8_2.Графа5) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель);
		
		// 27) 9.1 (Графа5) РазделаVIII / 9.1 (Графа5) РазделаVII*100 <> 9.2 (Графа5) РазделаVIII / 9.2 (Графа5) РазделаVII*100   		
		ОписаниеУсловия = "9.1 (Графа5) РазделаVIII / 9.1 (Графа5) РазделаVII*100 <> 9.2 (Графа5) РазделаVIII / 9.2 (Графа5) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_9_1.Графа5 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_9_1.Графа5 / СтруктураСтрок.Раздел7_9_1.Графа5 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_9_2.Графа5 = 0 Тогда  			
			Если СтруктураСтрок.Раздел8_9_2.Графа5 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     	
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_9_2.Графа5 / СтруктураСтрок.Раздел7_9_2.Графа5 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_9_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_9_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_9_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_9_2.Графа5) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель);
		
		Если КоличествоОшибокПо5ГрафеПроценты > 0 Тогда
			ОбластьСтрока.Область(1, 62 + КолДопКолонок, 1, 62 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо5ГрафеПроценты = ?(КоличествоОшибокПо5ГрафеПроценты = 0, "", КоличествоОшибокПо5ГрафеПроценты);				
		ОбластьСтрока.Параметры.ОписаниеОшибки5Графа = ОписаниеОшибки5Графа; 
		
		// 6 графа проценты
		ОписаниеОшибки6Графа = "(Проценты) ";
		КоличествоОшибокПо6ГрафеПроценты = 0;
		
		// 28) 2.1 (Графа6) РазделаVIII / 2.1 (Графа6) РазделаVII*100 <> 2.2 (Графа6) РазделаVIII / 2.2 (Графа6) РазделаVII*100   		
		ОписаниеУсловия = "2.1 (Графа6) РазделаVIII / 2.1 (Графа6) РазделаVII*100 <> 2.2 (Графа6) РазделаVIII / 2.2 (Графа6) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_2_1.Графа6 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_2_1.Графа6 / СтруктураСтрок.Раздел7_2_1.Графа6 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_2_2.Графа6 = 0 Тогда
			Если СтруктураСтрок.Раздел8_2_2.Графа6 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_2_2.Графа6 / СтруктураСтрок.Раздел7_2_2.Графа6 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_2_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_2_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_2_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_2_2.Графа6) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель);
		
		// 29) 3.1 (Графа6) РазделаVIII / 3.1 (Графа6) РазделаVII*100 <> 3.2 (Графа6) РазделаVIII / 3.2 (Графа6) РазделаVII*100   		
		ОписаниеУсловия = "3.1 (Графа6) РазделаVIII / 3.1 (Графа6) РазделаVII*100 <> 3.2 (Графа6) РазделаVIII / 3.2 (Графа6) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_3_1.Графа6 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_3_1.Графа6 / СтруктураСтрок.Раздел7_3_1.Графа6 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_3_2.Графа6 = 0 Тогда
			Если СтруктураСтрок.Раздел8_3_2.Графа6 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе    
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_3_2.Графа6 / СтруктураСтрок.Раздел7_3_2.Графа6 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_3_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_3_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_3_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_3_2.Графа6) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель);
		
		// 30) 4.1 (Графа6) РазделаVIII / 4.1 (Графа6) РазделаVII*100 <> 4.2 (Графа6) РазделаVIII / 4.2 (Графа6) РазделаVII*100   		
		ОписаниеУсловия = "4.1 (Графа6) РазделаVIII / 4.1 (Графа6) РазделаVII*100 <> 4.2 (Графа6) РазделаVIII / 4.2 (Графа6) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_4_1.Графа6 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_4_1.Графа6 / СтруктураСтрок.Раздел7_4_1.Графа6 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_4_2.Графа6 = 0 Тогда
			Если СтруктураСтрок.Раздел8_4_2.Графа6 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе 
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_4_2.Графа6 / СтруктураСтрок.Раздел7_4_2.Графа6 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_4_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_4_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_4_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_4_2.Графа6) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель);
		
		// 31) 5.1 (Графа6) РазделаVIII / 5.1 (Графа6) РазделаVII*100 <> 5.2 (Графа6) РазделаVIII / 5.2 (Графа6) РазделаVII*100   		
		ОписаниеУсловия = "5.1 (Графа6) РазделаVIII / 5.1 (Графа6) РазделаVII*100 <> 5.2 (Графа6) РазделаVIII / 5.2 (Графа6) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_5_1.Графа6 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_5_1.Графа6 / СтруктураСтрок.Раздел7_5_1.Графа6 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_5_2.Графа6 = 0 Тогда
			Если СтруктураСтрок.Раздел8_5_2.Графа6 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_5_2.Графа6 / СтруктураСтрок.Раздел7_5_2.Графа6 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_5_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_5_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_5_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_5_2.Графа6) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель);
		
		// 32) 6.1 (Графа6) РазделаVIII / 6.1 (Графа6) РазделаVII*100 <> 6.2 (Графа6) РазделаVIII / 6.2 (Графа6) РазделаVII*100   		
		ОписаниеУсловия = "6.1 (Графа6) РазделаVIII / 6.1 (Графа6) РазделаVII*100 <> 6.2 (Графа6) РазделаVIII / 6.2 (Графа6) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_6_1.Графа6 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_6_1.Графа6 / СтруктураСтрок.Раздел7_6_1.Графа6 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_6_2.Графа6 = 0 Тогда
			Если СтруктураСтрок.Раздел8_6_2.Графа6 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_6_2.Графа6 / СтруктураСтрок.Раздел7_6_2.Графа6 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_6_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_6_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_6_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_6_2.Графа6) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель);
		
		// 33) 7.1 (Графа6) РазделаVIII / 7.1 (Графа6) РазделаVII*100 <> 7.2 (Графа6) РазделаVIII / 7.2 (Графа6) РазделаVII*100   		
		ОписаниеУсловия = "7.1 (Графа6) РазделаVIII / 7.1 (Графа6) РазделаVII*100 <> 7.2 (Графа6) РазделаVIII / 7.2 (Графа6) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_7_1.Графа6 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_7_1.Графа6 / СтруктураСтрок.Раздел7_7_1.Графа6 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_7_2.Графа6 = 0 Тогда
			Если СтруктураСтрок.Раздел8_7_2.Графа6 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_7_2.Графа6 / СтруктураСтрок.Раздел7_7_2.Графа6 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_7_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_7_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_7_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_7_2.Графа6) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель);
		
		// 34) 8.1 (Графа6) РазделаVIII / 8.1 (Графа6) РазделаVII*100 <> 8.2 (Графа6) РазделаVIII / 8.2 (Графа6) РазделаVII*100   		
		ОписаниеУсловия = "8.1 (Графа6) РазделаVIII / 8.1 (Графа6) РазделаVII*100 <> 8.2 (Графа6) РазделаVIII / 8.2 (Графа6) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_8_1.Графа6 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_8_1.Графа6 / СтруктураСтрок.Раздел7_8_1.Графа6 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_8_2.Графа6 = 0 Тогда
			Если СтруктураСтрок.Раздел8_8_2.Графа6 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_8_2.Графа6 / СтруктураСтрок.Раздел7_8_2.Графа6 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_8_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_8_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_8_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_8_2.Графа6) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель);
		
		// 35) 9.1 (Графа6) РазделаVIII / 9.1 (Графа6) РазделаVII*100 <> 9.2 (Графа6) РазделаVIII / 9.2 (Графа6) РазделаVII*100   		
		ОписаниеУсловия = "9.1 (Графа6) РазделаVIII / 9.1 (Графа6) РазделаVII*100 <> 9.2 (Графа6) РазделаVIII / 9.2 (Графа6) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_9_1.Графа6 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_9_1.Графа6 / СтруктураСтрок.Раздел7_9_1.Графа6 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_9_2.Графа6 = 0 Тогда
			Если СтруктураСтрок.Раздел8_9_2.Графа6 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_9_2.Графа6 / СтруктураСтрок.Раздел7_9_2.Графа6 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_9_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_9_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_9_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_9_2.Графа6) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель);
		
		Если КоличествоОшибокПо6ГрафеПроценты > 0 Тогда
			ОбластьСтрока.Область(1, 63 + КолДопКолонок, 1, 63 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо6ГрафеПроценты = ?(КоличествоОшибокПо6ГрафеПроценты = 0, "", КоличествоОшибокПо6ГрафеПроценты);				
		ОбластьСтрока.Параметры.ОписаниеОшибки6Графа = ОписаниеОшибки6Графа; 
		
		// 7 графа проценты
		ОписаниеОшибки7Графа = "(Проценты) ";
		КоличествоОшибокПо7ГрафеПроценты = 0;
		
		// 36) 2.1 (Графа7) РазделаVIII / 2.1 (Графа7) РазделаVII*100 <> 2.2 (Графа7) РазделаVIII / 2.2 (Графа7) РазделаVII*100   		
		ОписаниеУсловия = "2.1 (Графа7) РазделаVIII / 2.1 (Графа7) РазделаVII*100 <> 2.2 (Графа7) РазделаVIII / 2.2 (Графа7) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_2_1.Графа7 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_2_1.Графа7 / СтруктураСтрок.Раздел7_2_1.Графа7 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_2_2.Графа7 = 0 Тогда
			Если СтруктураСтрок.Раздел8_2_2.Графа7 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_2_2.Графа7 / СтруктураСтрок.Раздел7_2_2.Графа7 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_2_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_2_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_2_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_2_2.Графа7) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель);
		
		// 37) 3.1 (Графа7) РазделаVIII / 3.1 (Графа7) РазделаVII*100 <> 3.2 (Графа7) РазделаVIII / 3.2 (Графа7) РазделаVII*100   		
		ОписаниеУсловия = "3.1 (Графа7) РазделаVIII / 3.1 (Графа7) РазделаVII*100 <> 3.2 (Графа7) РазделаVIII / 3.2 (Графа7) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_3_1.Графа7 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_3_1.Графа7 / СтруктураСтрок.Раздел7_3_1.Графа7 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_3_2.Графа7 = 0 Тогда
			Если СтруктураСтрок.Раздел8_3_2.Графа7 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе   
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_3_2.Графа7 / СтруктураСтрок.Раздел7_3_2.Графа7 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_3_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_3_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_3_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_3_2.Графа7) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель);
		
		// 38) 4.1 (Графа7) РазделаVIII / 4.1 (Графа7) РазделаVII*100 <> 4.2 (Графа7) РазделаVIII / 4.2 (Графа7) РазделаVII*100   		
		ОписаниеУсловия = "4.1 (Графа7) РазделаVIII / 4.1 (Графа7) РазделаVII*100 <> 4.2 (Графа7) РазделаVIII / 4.2 (Графа7) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_4_1.Графа7 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_4_1.Графа7 / СтруктураСтрок.Раздел7_4_1.Графа7 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_4_2.Графа7 = 0 Тогда
			Если СтруктураСтрок.Раздел8_4_2.Графа7 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_4_2.Графа7 / СтруктураСтрок.Раздел7_4_2.Графа7 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_4_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_4_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_4_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_4_2.Графа7) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель);
		
		// 39) 5.1 (Графа7) РазделаVIII / 5.1 (Графа7) РазделаVII*100 <> 5.2 (Графа7) РазделаVIII / 5.2 (Графа7) РазделаVII*100   		
		ОписаниеУсловия = "5.1 (Графа7) РазделаVIII / 5.1 (Графа7) РазделаVII*100 <> 5.2 (Графа7) РазделаVIII / 5.2 (Графа7) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_5_1.Графа7 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_5_1.Графа7 / СтруктураСтрок.Раздел7_5_1.Графа7 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_5_2.Графа7 = 0 Тогда
			Если СтруктураСтрок.Раздел8_5_2.Графа7 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_5_2.Графа7 / СтруктураСтрок.Раздел7_5_2.Графа7 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_5_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_5_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_5_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_5_2.Графа7) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель);
		
		// 40) 6.1 (Графа7) РазделаVIII / 6.1 (Графа7) РазделаVII*100 <> 6.2 (Графа7) РазделаVIII / 6.2 (Графа7) РазделаVII*100   		
		ОписаниеУсловия = "6.1 (Графа7) РазделаVIII / 6.1 (Графа7) РазделаVII*100 <> 6.2 (Графа7) РазделаVIII / 6.2 (Графа7) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_6_1.Графа7 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_6_1.Графа7 / СтруктураСтрок.Раздел7_6_1.Графа7 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_6_2.Графа7 = 0 Тогда
			Если СтруктураСтрок.Раздел8_6_2.Графа7 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_6_2.Графа7 / СтруктураСтрок.Раздел7_6_2.Графа7 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_6_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_6_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_6_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_6_2.Графа7) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель);
		
		// 41) 7.1 (Графа7) РазделаVIII / 7.1 (Графа7) РазделаVII*100 <> 7.2 (Графа7) РазделаVIII / 7.2 (Графа7) РазделаVII*100   		
		ОписаниеУсловия = "7.1 (Графа7) РазделаVIII / 7.1 (Графа7) РазделаVII*100 <> 7.2 (Графа7) РазделаVIII / 7.2 (Графа7) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_7_1.Графа7 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_7_1.Графа7 / СтруктураСтрок.Раздел7_7_1.Графа7 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_7_2.Графа7 = 0 Тогда
			Если СтруктураСтрок.Раздел8_7_2.Графа7 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_7_2.Графа7 / СтруктураСтрок.Раздел7_7_2.Графа7 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_7_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_7_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_7_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_7_2.Графа7) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель);
		
		// 42) 8.1 (Графа7) РазделаVIII / 8.1 (Графа7) РазделаVII*100 <> 8.2 (Графа7) РазделаVIII / 8.2 (Графа7) РазделаVII*100   		
		ОписаниеУсловия = "8.1 (Графа7) РазделаVIII / 8.1 (Графа7) РазделаVII*100 <> 8.2 (Графа7) РазделаVIII / 8.2 (Графа7) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_8_1.Графа7 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_8_1.Графа7 / СтруктураСтрок.Раздел7_8_1.Графа7 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_8_2.Графа7 = 0 Тогда
			Если СтруктураСтрок.Раздел8_8_2.Графа7 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_8_2.Графа7 / СтруктураСтрок.Раздел7_8_2.Графа7 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_8_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_8_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_8_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_8_2.Графа7) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель);
		
		// 43) 9.1 (Графа7) РазделаVIII / 9.1 (Графа7) РазделаVII*100 <> 9.2 (Графа7) РазделаVIII / 9.2 (Графа7) РазделаVII*100   		
		ОписаниеУсловия = "9.1 (Графа7) РазделаVIII / 9.1 (Графа7) РазделаVII*100 <> 9.2 (Графа7) РазделаVIII / 9.2 (Графа7) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_9_1.Графа7 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_9_1.Графа7 / СтруктураСтрок.Раздел7_9_1.Графа7 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_9_2.Графа7 = 0 Тогда
			Если СтруктураСтрок.Раздел8_9_2.Графа7 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе   
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_9_2.Графа7 / СтруктураСтрок.Раздел7_9_2.Графа7 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_9_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_9_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_9_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_9_2.Графа7) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель);
		
		Если КоличествоОшибокПо7ГрафеПроценты > 0 Тогда
			ОбластьСтрока.Область(1, 64 + КолДопКолонок, 1, 64 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо7ГрафеПроценты = ?(КоличествоОшибокПо7ГрафеПроценты = 0, "", КоличествоОшибокПо7ГрафеПроценты);				
		ОбластьСтрока.Параметры.ОписаниеОшибки7Графа = ОписаниеОшибки7Графа; 
		
		// 8 графа проценты
		ОписаниеОшибки8Графа = "(Проценты) ";
		КоличествоОшибокПо8ГрафеПроценты = 0;
		
		// 36) 2.1 (Графа8) РазделаVIII / 2.1 (Графа8) РазделаVII*100 <> 2.2 (Графа8) РазделаVIII / 2.2 (Графа8) РазделаVII*100   		
		ОписаниеУсловия = "2.1 (Графа8) РазделаVIII / 2.1 (Графа8) РазделаVII*100 <> 2.2 (Графа8) РазделаVIII / 2.2 (Графа8) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_2_1.Графа8 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_2_1.Графа8 / СтруктураСтрок.Раздел7_2_1.Графа8 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_2_2.Графа8 = 0 Тогда   			
			Если СтруктураСтрок.Раздел8_2_2.Графа8 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_2_2.Графа8 / СтруктураСтрок.Раздел7_2_2.Графа8 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_2_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_2_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_2_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_2_2.Графа8) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель);
		
		// 37) 3.1 (Графа8) РазделаVIII / 3.1 (Графа8) РазделаVII*100 <> 3.2 (Графа8) РазделаVIII / 3.2 (Графа8) РазделаVII*100   		
		ОписаниеУсловия = "3.1 (Графа8) РазделаVIII / 3.1 (Графа8) РазделаVII*100 <> 3.2 (Графа8) РазделаVIII / 3.2 (Графа8) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_3_1.Графа8 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_3_1.Графа8 / СтруктураСтрок.Раздел7_3_1.Графа8 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_3_2.Графа8 = 0 Тогда
			Если СтруктураСтрок.Раздел8_3_2.Графа8 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_3_2.Графа8 / СтруктураСтрок.Раздел7_3_2.Графа8 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_3_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_3_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_3_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_3_2.Графа8) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель);
		
		// 38) 4.1 (Графа8) РазделаVIII / 4.1 (Графа8) РазделаVII*100 <> 4.2 (Графа8) РазделаVIII / 4.2 (Графа8) РазделаVII*100   		
		ОписаниеУсловия = "4.1 (Графа8) РазделаVIII / 4.1 (Графа8) РазделаVII*100 <> 4.2 (Графа8) РазделаVIII / 4.2 (Графа8) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_4_1.Графа8 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_4_1.Графа8 / СтруктураСтрок.Раздел7_4_1.Графа8 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_4_2.Графа8 = 0 Тогда
			Если СтруктураСтрок.Раздел8_4_2.Графа8 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_4_2.Графа8 / СтруктураСтрок.Раздел7_4_2.Графа8 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_4_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_4_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_4_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_4_2.Графа8) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель);
		
		// 39) 5.1 (Графа8) РазделаVIII / 5.1 (Графа8) РазделаVII*100 <> 5.2 (Графа8) РазделаVIII / 5.2 (Графа8) РазделаVII*100   		
		ОписаниеУсловия = "5.1 (Графа8) РазделаVIII / 5.1 (Графа8) РазделаVII*100 <> 5.2 (Графа8) РазделаVIII / 5.2 (Графа8) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_5_1.Графа8 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_5_1.Графа8 / СтруктураСтрок.Раздел7_5_1.Графа8 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_5_2.Графа8 = 0 Тогда
			Если СтруктураСтрок.Раздел8_5_2.Графа8 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_5_2.Графа8 / СтруктураСтрок.Раздел7_5_2.Графа8 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_5_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_5_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_5_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_5_2.Графа8) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель);
		
		// 40) 6.1 (Графа8) РазделаVIII / 6.1 (Графа8) РазделаVII*100 <> 6.2 (Графа8) РазделаVIII / 6.2 (Графа8) РазделаVII*100   		
		ОписаниеУсловия = "6.1 (Графа8) РазделаVIII / 6.1 (Графа8) РазделаVII*100 <> 6.2 (Графа8) РазделаVIII / 6.2 (Графа8) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_6_1.Графа8 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_6_1.Графа8 / СтруктураСтрок.Раздел7_6_1.Графа8 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_6_2.Графа8 = 0 Тогда
			Если СтруктураСтрок.Раздел8_6_2.Графа8 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе 
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_6_2.Графа8 / СтруктураСтрок.Раздел7_6_2.Графа8 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_6_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_6_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_6_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_6_2.Графа8) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель);
		
		// 41) 7.1 (Графа8) РазделаVIII / 7.1 (Графа8) РазделаVII*100 <> 7.2 (Графа8) РазделаVIII / 7.2 (Графа8) РазделаVII*100   		
		ОписаниеУсловия = "7.1 (Графа8) РазделаVIII / 7.1 (Графа8) РазделаVII*100 <> 7.2 (Графа8) РазделаVIII / 7.2 (Графа8) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_7_1.Графа8 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_7_1.Графа8 / СтруктураСтрок.Раздел7_7_1.Графа8 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_7_2.Графа8 = 0 Тогда
			Если СтруктураСтрок.Раздел8_7_2.Графа8 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_7_2.Графа8 / СтруктураСтрок.Раздел7_7_2.Графа8 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_7_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_7_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_7_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_7_2.Графа8) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель);
		
		// 42) 8.1 (Графа8) РазделаVIII / 8.1 (Графа8) РазделаVII*100 <> 8.2 (Графа8) РазделаVIII / 8.2 (Графа8) РазделаVII*100   		
		ОписаниеУсловия = "8.1 (Графа8) РазделаVIII / 8.1 (Графа8) РазделаVII*100 <> 8.2 (Графа8) РазделаVIII / 8.2 (Графа8) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_8_1.Графа8 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_8_1.Графа8 / СтруктураСтрок.Раздел7_8_1.Графа8 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_8_2.Графа8 = 0 Тогда
			Если СтруктураСтрок.Раздел8_8_2.Графа8 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_8_2.Графа8 / СтруктураСтрок.Раздел7_8_2.Графа8 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_8_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_8_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_8_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_8_2.Графа8) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель);
		
		// 43) 9.1 (Графа8) РазделаVIII / 9.1 (Графа8) РазделаVII*100 <> 9.2 (Графа8) РазделаVIII / 9.2 (Графа8) РазделаVII*100   		
		ОписаниеУсловия = "9.1 (Графа8) РазделаVIII / 9.1 (Графа8) РазделаVII*100 <> 9.2 (Графа8) РазделаVIII / 9.2 (Графа8) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_9_1.Графа8 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_9_1.Графа8 / СтруктураСтрок.Раздел7_9_1.Графа8 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_9_2.Графа8 = 0 Тогда
			Если СтруктураСтрок.Раздел8_9_2.Графа8 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_9_2.Графа8 / СтруктураСтрок.Раздел7_9_2.Графа8 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_9_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_9_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_9_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_9_2.Графа8) + "*100";    		
		ПроверкаНаОшибку(ТаблицаОшибок, Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель);
		
		Если КоличествоОшибокПо8ГрафеПроценты > 0 Тогда
			ОбластьСтрока.Область(1, 65 + КолДопКолонок, 1, 65 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо8ГрафеПроценты = ?(КоличествоОшибокПо8ГрафеПроценты = 0, "", КоличествоОшибокПо8ГрафеПроценты);				
		ОбластьСтрока.Параметры.ОписаниеОшибки8Графа = ОписаниеОшибки8Графа; 
		
		// проверки по ПСК
		ЗапросПоПСКПоДокументу = Новый Запрос;
		ЗапросПоПСКПоДокументу.МенеджерВременныхТаблиц = МВТ;
		ЗапросПоПСКПоДокументу.Текст = "      
		|ВЫБРАТЬ
		|	ОтчетностьКПКТаблицаПоказателей.Раздел КАК Раздел,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель1 КАК ПСКДокумента,
		|	ЕСТЬNULL(ВТ_ЗначенияПСК.ЗначениеПСК, 0) КАК ЗначениеПСК,
		|	ЕСТЬNULL(ВТ_ЗначенияПСК.ПредельноеЗначениеПСК, 0) КАК ПредельноеЗначениеПСК
		|ИЗ
		|	Документ.ОтчетностьКПК.ТаблицаПоказателей КАК ОтчетностьКПКТаблицаПоказателей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗначенияПСК КАК ВТ_ЗначенияПСК
		|		ПО ОтчетностьКПКТаблицаПоказателей.Раздел = ВТ_ЗначенияПСК.Раздел
		|ГДЕ
		|	ОтчетностьКПКТаблицаПоказателей.Раздел В ИЕРАРХИИ(&Раздел6)
		|	И ОтчетностьКПКТаблицаПоказателей.Ссылка = &Ссылка
		|	И ОтчетностьКПКТаблицаПоказателей.Показатель1 > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОтчетностьКПКТаблицаПоказателей.Раздел.КодРаздела";
		
		ЗапросПоПСКПоДокументу.УстановитьПараметр("Раздел6", Справочники.Разделы.Раздел6);
		ЗапросПоПСКПоДокументу.УстановитьПараметр("Ссылка", Выборка.ДокументОтчетности);
		
		ВыборкаПСК = ЗапросПоПСКПоДокументу.Выполнить().Выбрать();
		
		ОписаниеОшибокПоПСК = "";
		КоличествоОшибокПоПСК = 0;
		
		Пока ВыборкаПСК.Следующий() Цикл
			Если ВыборкаПСК.ПСКДокумента > ВыборкаПСК.ПредельноеЗначениеПСК Тогда
				КоличествоОшибокПоПСК = КоличествоОшибокПоПСК + 1;
				ОписаниеОшибки  = "В строке " + Строка(ВыборкаПСК.Раздел.КодРаздела) + " значение " + Строка(ВыборкаПСК.ПСКДокумента) + " > предельные значение " + Строка(ВыборкаПСК.ПредельноеЗначениеПСК) + " более чем на 1/3";				
				ОписаниеОшибокПоПСК = ОписаниеОшибокПоПСК + ?(ОписаниеОшибокПоПСК="", "", СтрокаРазделитель) + ОписаниеОшибки;  
				ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, "", ОписаниеОшибки);   
			КонецЕсли;			
		КонецЦикла;
		
		Если КоличествоОшибокПоПСК > 0 Тогда
			ОбластьСтрока.Область(1, 66 + КолДопКолонок, 1, 66 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПоПСК = ?(КоличествоОшибокПоПСК = 0, "", КоличествоОшибокПоПСК);				
		ОбластьСтрока.Параметры.ОписаниеОшибокПоПСК = ОписаниеОшибокПоПСК; 	
		
		ВсегоОшибок = ВсегоОшибок + КоличествоОшибокПо3Графе + КоличествоОшибокПо4Графе + КоличествоОшибокПо5Графе + КоличествоОшибокПо6Графе + КоличествоОшибокПо7Графе + КоличествоОшибокПо8Графе + КоличествоОшибокПо3ГрафеПроценты + КоличествоОшибокПо4ГрафеПроценты + КоличествоОшибокПо5ГрафеПроценты + КоличествоОшибокПо6ГрафеПроценты + КоличествоОшибокПо7ГрафеПроценты + КоличествоОшибокПо8ГрафеПроценты + КоличествоОшибокПоПСК;
		
		
		ОбластьСтрока.Параметры.ИтогоОшибок = Строка(ВсегоОшибок);
		
		Если ВсегоОшибок > 0 Тогда
			ОбластьСтрока.Область(1, 4 + КолДопКолонок, 1, 4 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 	
		КонецЕсли;                                                  		
		
		РезультатНадзорныеСоотношения.Вывести(ОбластьСтрока); 		
		
		
		
		
		// 3. КС
		ИтогоОшибокКС = 0;
		НазваниеТаблицы = "КС";
		
		ОбластьСтрокаКС.Параметры.НомерСтроки = НомерСтроки;
		ОбластьСтрокаКС.Параметры.НомерВРеестреСРО = Выборка.НомерВРеестреСРО;
		ОбластьСтрокаКС.Параметры.КраткоеНазваниеКПК = СокрЛП(Выборка.КПК.НаименованиеКраткое);
		
		Если ВидОтчета = 1 Тогда
			ОбластьСтрокаКС.Параметры.ПериодОтчетности = СРО_ЗагрузкаОтчетности.ПолучитьПредставлениеДатыотчета(Выборка.ДатаОкончанияОтчетногоПериода);
		КонецЕсли;
		
		
		ОбластьСтрокаКС.Область(1, 1, 1, 143).ЦветФона = ЦветФонаСтроки;	
		
		Если Выборка.ДокументОтчетности = null Тогда   			
			ОбластьСтрокаКС.Параметры.ДокументОтчетности  = "Нет документа";
			ОбластьСтрокаКС.Область(1, 3, 1, 3).ЦветТекста = WebЦвета.Черный;				
		Иначе	
			ОбластьСтрокаКС.Параметры.ДокументОтчетности  = Выборка.ДокументОтчетности;
			ОбластьСтрокаКС.Область(1, 3, 1, 3).ЦветТекста =  WebЦвета.Синий;
		КонецЕсли;
		
		// Раздел 1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";
		
		СуммаРазделов = Выборка.Раздел2_1_1 + Выборка.Раздел2_1_2 + Выборка.Раздел2_1_3 +Выборка.Раздел2_1_4 + Выборка.Раздел2_1_5 + Выборка.Раздел2_1_6 + Выборка.Раздел2_1_7 + Выборка.Раздел2_1_8 + Выборка.Раздел2_1_9 + Выборка.Раздел2_1_10 + Выборка.Раздел2_1_11 + Выборка.Раздел2_1_12 + Выборка.Раздел2_1_13;
		Если Выборка.Раздел2_1 <>  СуммаРазделов Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1 Раздела II, должно быть равно сумме значений, указанных в строках 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 1.10, 1.11, 1.12 и 1.13.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1) + " <> " + Строка(СуммаРазделов);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 6 + КолДопКолонок, 1, 6 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 6 + КолДопКолонок, 1, 6 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		Разница = Выборка.Раздел2_1 - СуммаРазделов;
		ОбластьСтрокаКС.Параметры.Раздел1 = ?(Разница = 0, "0", Разница);			
		ОбластьСтрокаКС.Параметры.Проверка_Раздел1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		
		// Раздел 1.1 		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";		
		
		СуммаРазделов = Выборка.Раздел2_1_1_1 + Выборка.Раздел2_1_1_2 + Выборка.Раздел2_1_1_3;
		Если Выборка.Раздел2_1_1 <>  СуммаРазделов Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1.1 Раздела II, должно быть равно сумме значений, указанных в строках 1.1.1, 1.1.2 и 1.1.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1_1) + " <> " + Строка(СуммаРазделов);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 7 + КолДопКолонок, 1, 7 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;    	
		Иначе
			ОбластьСтрокаКС.Область(1, 7 + КолДопКолонок, 1, 7 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;  
		КонецЕсли;
		
		Разница = Выборка.Раздел2_1_1 - СуммаРазделов;  
		ОбластьСтрокаКС.Параметры.Раздел1_1 = ?(Разница = 0, "0", Разница);			
		ОбластьСтрокаКС.Параметры.Проверка_Раздел1_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		// Раздел 1.2 		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";		
		
		СуммаРазделов = Выборка.Раздел2_1_2_1 + Выборка.Раздел2_1_2_2 + Выборка.Раздел2_1_2_3;
		Если Выборка.Раздел2_1_2 <>  СуммаРазделов Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1.2 Раздела II, должно быть равно сумме значений, указанных в строках 1.2.1, 1.2.2 и 1.2.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1_2) + " <> " + Строка(СуммаРазделов);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 8 + КолДопКолонок, 1, 8 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;    	
		Иначе
			ОбластьСтрокаКС.Область(1, 8 + КолДопКолонок, 1, 8 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;  
		КонецЕсли;
		
		Разница = Выборка.Раздел2_1_2 - СуммаРазделов;
		ОбластьСтрокаКС.Параметры.Раздел2_1 =  ?(Разница = 0, "0", Разница);		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		// Раздел 1.1.1 и 1.2.1 		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";	
		
		УсловиеРазделов3 = СтруктураСтрок.Раздел7_1_1.Графа3 = 0 И СтруктураСтрок.Раздел7_2_1.Графа3 = 0 И СтруктураСтрок.Раздел7_3_1.Графа3 = 0 И СтруктураСтрок.Раздел7_4_1.Графа3 = 0 И СтруктураСтрок.Раздел7_5_1.Графа3 = 0 И СтруктураСтрок.Раздел7_6_1.Графа3 = 0 И СтруктураСтрок.Раздел7_7_1.Графа3  = 0 И СтруктураСтрок.Раздел7_8_1.Графа3 = 0 И СтруктураСтрок.Раздел7_9_1.Графа3 = 0;
		УсловиеРазделов4 = СтруктураСтрок.Раздел7_1_1.Графа4 = 0 И СтруктураСтрок.Раздел7_2_1.Графа4 = 0 И СтруктураСтрок.Раздел7_3_1.Графа4 = 0 И СтруктураСтрок.Раздел7_4_1.Графа4 = 0 И СтруктураСтрок.Раздел7_5_1.Графа4 = 0 И СтруктураСтрок.Раздел7_6_1.Графа4 = 0 И СтруктураСтрок.Раздел7_7_1.Графа4  = 0 И СтруктураСтрок.Раздел7_8_1.Графа4 = 0 И СтруктураСтрок.Раздел7_9_1.Графа4 = 0;
		УсловиеРазделов7 = СтруктураСтрок.Раздел7_1_1.Графа7 = 0 И СтруктураСтрок.Раздел7_2_1.Графа7 = 0 И СтруктураСтрок.Раздел7_3_1.Графа7 = 0 И СтруктураСтрок.Раздел7_4_1.Графа7 = 0 И СтруктураСтрок.Раздел7_5_1.Графа7 = 0 И СтруктураСтрок.Раздел7_6_1.Графа7 = 0 И СтруктураСтрок.Раздел7_7_1.Графа7  = 0 И СтруктураСтрок.Раздел7_8_1.Графа7 = 0 И СтруктураСтрок.Раздел7_9_1.Графа7 = 0;
		УсловиеРазделов8 = СтруктураСтрок.Раздел7_1_1.Графа8 = 0 И СтруктураСтрок.Раздел7_2_1.Графа8 = 0 И СтруктураСтрок.Раздел7_3_1.Графа8 = 0 И СтруктураСтрок.Раздел7_4_1.Графа8 = 0 И СтруктураСтрок.Раздел7_5_1.Графа8 = 0 И СтруктураСтрок.Раздел7_6_1.Графа8 = 0 И СтруктураСтрок.Раздел7_7_1.Графа8  = 0 И СтруктураСтрок.Раздел7_8_1.Графа8 = 0 И СтруктураСтрок.Раздел7_9_1.Графа8 = 0;
		
		УсловиеРазделов = УсловиеРазделов3 И УсловиеРазделов4 И УсловиеРазделов7 И УсловиеРазделов8;
		
		Если (Выборка.Раздел2_1_1_1 <> 0 ИЛИ Выборка.Раздел2_1_2_1 <> 0) И УсловиеРазделов Тогда
			
			ОписаниеУсловия= "Если в строках 1.1.1 и (или) 1.2.1 указаны значения, отличные от нуля, то как минимум в одной из граф 3, 4, 7, 8 строк 1.1, 2.1, 3.1, 4.1, 5.1, 6.1, 7.1, 8.1 и 9.1 Раздела VII должно быть указано значение, отличное от нуля.";
			//	ОписаниеОшибки = Строка(Выборка.Раздел2_1_2) + " <> " + Строка(СуммаРазделов);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 9 + КолДопКолонок, 1, 9 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;    	
		Иначе
			ОбластьСтрокаКС.Область(1, 9 + КолДопКолонок, 1, 9 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;  
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_1_1 = ОписаниеУсловия;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_1_1 = ОписаниеУсловия;
		
		// Раздел 1.1.2 и 1.2.2 		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";	
		
		УсловиеРазделов5 = СтруктураСтрок.Раздел7_1_1.Графа5 = 0 И СтруктураСтрок.Раздел7_2_1.Графа5 = 0 И СтруктураСтрок.Раздел7_3_1.Графа5 = 0 И СтруктураСтрок.Раздел7_4_1.Графа5 = 0 И СтруктураСтрок.Раздел7_5_1.Графа5 = 0 И СтруктураСтрок.Раздел7_6_1.Графа5 = 0 И СтруктураСтрок.Раздел7_7_1.Графа5  = 0 И СтруктураСтрок.Раздел7_8_1.Графа5 = 0 И СтруктураСтрок.Раздел7_9_1.Графа5 = 0;
		УсловиеРазделов6 = СтруктураСтрок.Раздел7_1_1.Графа6 = 0 И СтруктураСтрок.Раздел7_2_1.Графа6 = 0 И СтруктураСтрок.Раздел7_3_1.Графа6 = 0 И СтруктураСтрок.Раздел7_4_1.Графа6 = 0 И СтруктураСтрок.Раздел7_5_1.Графа6 = 0 И СтруктураСтрок.Раздел7_6_1.Графа6 = 0 И СтруктураСтрок.Раздел7_7_1.Графа6  = 0 И СтруктураСтрок.Раздел7_8_1.Графа6 = 0 И СтруктураСтрок.Раздел7_9_1.Графа6 = 0;
		УсловиеРазделов7 = СтруктураСтрок.Раздел7_1_1.Графа7 = 0 И СтруктураСтрок.Раздел7_2_1.Графа7 = 0 И СтруктураСтрок.Раздел7_3_1.Графа7 = 0 И СтруктураСтрок.Раздел7_4_1.Графа7 = 0 И СтруктураСтрок.Раздел7_5_1.Графа7 = 0 И СтруктураСтрок.Раздел7_6_1.Графа7 = 0 И СтруктураСтрок.Раздел7_7_1.Графа7  = 0 И СтруктураСтрок.Раздел7_8_1.Графа7 = 0 И СтруктураСтрок.Раздел7_9_1.Графа7 = 0;
		УсловиеРазделов8 = СтруктураСтрок.Раздел7_1_1.Графа8 = 0 И СтруктураСтрок.Раздел7_2_1.Графа8 = 0 И СтруктураСтрок.Раздел7_3_1.Графа8 = 0 И СтруктураСтрок.Раздел7_4_1.Графа8 = 0 И СтруктураСтрок.Раздел7_5_1.Графа8 = 0 И СтруктураСтрок.Раздел7_6_1.Графа8 = 0 И СтруктураСтрок.Раздел7_7_1.Графа8  = 0 И СтруктураСтрок.Раздел7_8_1.Графа8 = 0 И СтруктураСтрок.Раздел7_9_1.Графа8 = 0;
		
		УсловиеРазделов = УсловиеРазделов5 И УсловиеРазделов6 И УсловиеРазделов7 И УсловиеРазделов8;
		
		Если (Выборка.Раздел2_1_1_2 <> 0 ИЛИ Выборка.Раздел2_1_2_2 <> 0) И УсловиеРазделов Тогда   			
			ОписаниеУсловия= "Если в строках 1.1.2 и (или) 1.2.2 Раздела II указаны значения, отличные от нуля, то как минимум в одной из граф 5, 6, 7, 8 строк 1.1, 2.1, 3.1, 4.1, 5.1, 6.1, 7.1, 8.1 и 9.1 Раздела VII должно быть указано значение, отличное от нуля.";
			//	ОписаниеОшибки = Строка(Выборка.Раздел2_1_2) + " <> " + Строка(СуммаРазделов);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 10 + КолДопКолонок, 1, 10 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;    	
		Иначе
			ОбластьСтрокаКС.Область(1, 10 + КолДопКолонок, 1, 10 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;  
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_1_2 = ОписаниеУсловия;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_1_2 = ОписаниеУсловия;
		
		
		//  строках 1.1 или 1.2 
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если (Выборка.Раздел2_1_1 <> 0 ИЛИ Выборка.Раздел2_1_2 <> 0) И Выборка.Раздел4_15 = 0 Тогда
			ОписаниеУсловия= "Если в строках 1.1 или 1.2 Раздела II указано значение, отличное от нуля, то и в строке 15 Раздела IV должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "1.1 = " + Строка(Выборка.Раздел2_1_1) +"; 1.2 = " + Строка(Выборка.Раздел2_1_2)+"; строка 15 Раздела IV = " + Строка(Выборка.Раздел4_15);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 11 + КолДопКолонок, 1, 12 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 11 + КолДопКолонок, 1, 12 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Сумма_1_1_и_1_2 = Выборка.Раздел2_1_1 + Выборка.Раздел2_1_2;
		ОбластьСтрокаКС.Параметры.Раздел4_15 = Выборка.Раздел4_15;                  		
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_и_1_2 =  ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;  	
		
		//  строках 1.1.1 или 1.2.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если (Выборка.Раздел2_1_1_1 <> 0 ИЛИ Выборка.Раздел2_1_2_1 <> 0) И Выборка.Раздел4_15_1 = 0 Тогда
			ОписаниеУсловия= "Если в строках 1.1.1 или 1.2.1 Раздела II указано значение, отличное от нуля, то и в строке 15.1 Раздела IV должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "1.1.1 = " + Строка(Выборка.Раздел2_1_1_1) +"; 1.2.1 = " + Строка(Выборка.Раздел2_1_2_1)+"; строка 15.1 Раздела IV = " + Строка(Выборка.Раздел4_15_1);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 13 + КолДопКолонок, 1, 14 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 13 + КолДопКолонок, 1, 14 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Сумма_1_1_1_и_1_2_1 = Выборка.Раздел2_1_1_1 + Выборка.Раздел2_1_2_1;
		ОбластьСтрокаКС.Параметры.Раздел4_15_1 = Выборка.Раздел4_15_1;                  		
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_1_и_1_2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;	
		
		
		//  строках 1.1.2 или 1.2.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если (Выборка.Раздел2_1_1_2 <> 0 ИЛИ Выборка.Раздел2_1_2_2 <> 0) И Выборка.Раздел4_15_2 = 0 Тогда
			ОписаниеУсловия= "Если в строках 1.1.2 или 1.2.2 Раздела II указано значение, отличное от нуля, то и в строке 15.2 Раздела IV должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "1.1.2 = " + Строка(Выборка.Раздел2_1_1_2) +"; 1.2.2 = " + Строка(Выборка.Раздел2_1_2_2)+"; строка 15.2 Раздела IV = " + Строка(Выборка.Раздел4_15_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 15 + КолДопКолонок, 1, 16 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 15 + КолДопКолонок, 1, 16 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Сумма_1_1_2_и_1_2_2 = Выборка.Раздел2_1_1_2 + Выборка.Раздел2_1_2_2;
		ОбластьСтрокаКС.Параметры.Раздел4_15_2 = Выборка.Раздел4_15_2;                  		
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_2_и_1_2_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;
		
		// строках 1.1.3 или 1.2.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если (Выборка.Раздел2_1_1_3 <> 0 ИЛИ Выборка.Раздел2_1_2_3 <> 0) И Выборка.Раздел4_15_3 = 0 Тогда
			ОписаниеУсловия= "Если в строках 1.1.3 или 1.2.3 Раздела II указано значение, отличное от нуля, то и в строке 15.3 Раздела IV должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "1.1.3 = " + Строка(Выборка.Раздел2_1_1_3) +"; 1.2.3 = " + Строка(Выборка.Раздел2_1_2_3)+"; строка 15.3 Раздела IV = " + Строка(Выборка.Раздел4_15_3);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 17 + КолДопКолонок, 1, 18 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 17 + КолДопКолонок, 1, 18 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Сумма_1_1_3_и_1_2_3 = Выборка.Раздел2_1_1_3 + Выборка.Раздел2_1_2_3;
		ОбластьСтрокаКС.Параметры.Раздел4_15_3 = Выборка.Раздел4_15_3;                  		
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_3_и_1_2_3 =  ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;
		
		// Раздел 1.8.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";	
		
		УсловиеРазделов3 = СтруктураСтрок.Раздел7_1_2.Графа3 = 0 И СтруктураСтрок.Раздел7_2_2.Графа3 = 0 И СтруктураСтрок.Раздел7_3_2.Графа3 = 0 И СтруктураСтрок.Раздел7_4_2.Графа3 = 0 И СтруктураСтрок.Раздел7_5_2.Графа3 = 0 И СтруктураСтрок.Раздел7_6_2.Графа3 = 0 И СтруктураСтрок.Раздел7_7_2.Графа3  = 0 И СтруктураСтрок.Раздел7_8_2.Графа3 = 0 И СтруктураСтрок.Раздел7_9_2.Графа3 = 0;
		УсловиеРазделов4 = СтруктураСтрок.Раздел7_1_2.Графа4 = 0 И СтруктураСтрок.Раздел7_2_2.Графа4 = 0 И СтруктураСтрок.Раздел7_3_2.Графа4 = 0 И СтруктураСтрок.Раздел7_4_2.Графа4 = 0 И СтруктураСтрок.Раздел7_5_2.Графа4 = 0 И СтруктураСтрок.Раздел7_6_2.Графа4 = 0 И СтруктураСтрок.Раздел7_7_2.Графа4  = 0 И СтруктураСтрок.Раздел7_8_2.Графа4 = 0 И СтруктураСтрок.Раздел7_9_2.Графа4 = 0;
		УсловиеРазделов7 = СтруктураСтрок.Раздел7_1_2.Графа7 = 0 И СтруктураСтрок.Раздел7_2_2.Графа7 = 0 И СтруктураСтрок.Раздел7_3_2.Графа7 = 0 И СтруктураСтрок.Раздел7_4_2.Графа7 = 0 И СтруктураСтрок.Раздел7_5_2.Графа7 = 0 И СтруктураСтрок.Раздел7_6_2.Графа7 = 0 И СтруктураСтрок.Раздел7_7_2.Графа7  = 0 И СтруктураСтрок.Раздел7_8_2.Графа7 = 0 И СтруктураСтрок.Раздел7_9_2.Графа7 = 0;
		УсловиеРазделов8 = СтруктураСтрок.Раздел7_1_2.Графа8 = 0 И СтруктураСтрок.Раздел7_2_2.Графа8 = 0 И СтруктураСтрок.Раздел7_3_2.Графа8 = 0 И СтруктураСтрок.Раздел7_4_2.Графа8 = 0 И СтруктураСтрок.Раздел7_5_2.Графа8 = 0 И СтруктураСтрок.Раздел7_6_2.Графа8 = 0 И СтруктураСтрок.Раздел7_7_2.Графа8  = 0 И СтруктураСтрок.Раздел7_8_2.Графа8 = 0 И СтруктураСтрок.Раздел7_9_2.Графа8 = 0;
		
		УсловиеРазделов = УсловиеРазделов3 И УсловиеРазделов4 И УсловиеРазделов7 И УсловиеРазделов8;
		
		Если Выборка.Раздел2_1_8_1 <> 0  И УсловиеРазделов Тогда
			
			ОписаниеУсловия= "Если в строке 1.8.1 Раздела II указано значение, отличное от нуля, то как минимум в одной из граф 3, 4, 7, 8 строк 1.2, 2.2, 3.2, 4.2, 5.2, 6.2, 7.2, 8.2 и 9.2 Раздела VII должно быть указано значение, отличное от нуля.";
			//	ОписаниеОшибки = Строка(Выборка.Раздел2_1_2) + " <> " + Строка(СуммаРазделов);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 19 + КолДопКолонок, 1, 19 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;    	
		Иначе
			ОбластьСтрокаКС.Область(1, 19 + КолДопКолонок, 1, 19 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;  
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_8_1 = ОписаниеУсловия;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_8_1 = ОписаниеУсловия;
		
		// Раздел 1.8.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";	
		
		УсловиеРазделов5 = СтруктураСтрок.Раздел7_1_2.Графа5 = 0 И СтруктураСтрок.Раздел7_2_2.Графа5 = 0 И СтруктураСтрок.Раздел7_3_2.Графа5 = 0 И СтруктураСтрок.Раздел7_4_2.Графа5 = 0 И СтруктураСтрок.Раздел7_5_2.Графа5 = 0 И СтруктураСтрок.Раздел7_6_2.Графа5 = 0 И СтруктураСтрок.Раздел7_7_2.Графа5  = 0 И СтруктураСтрок.Раздел7_8_2.Графа5 = 0 И СтруктураСтрок.Раздел7_9_2.Графа5 = 0;
		УсловиеРазделов6 = СтруктураСтрок.Раздел7_1_2.Графа6 = 0 И СтруктураСтрок.Раздел7_2_2.Графа6 = 0 И СтруктураСтрок.Раздел7_3_2.Графа6 = 0 И СтруктураСтрок.Раздел7_4_2.Графа6 = 0 И СтруктураСтрок.Раздел7_5_2.Графа6 = 0 И СтруктураСтрок.Раздел7_6_2.Графа6 = 0 И СтруктураСтрок.Раздел7_7_2.Графа6  = 0 И СтруктураСтрок.Раздел7_8_2.Графа6 = 0 И СтруктураСтрок.Раздел7_9_2.Графа6 = 0;
		УсловиеРазделов7 = СтруктураСтрок.Раздел7_1_2.Графа7 = 0 И СтруктураСтрок.Раздел7_2_2.Графа7 = 0 И СтруктураСтрок.Раздел7_3_2.Графа7 = 0 И СтруктураСтрок.Раздел7_4_2.Графа7 = 0 И СтруктураСтрок.Раздел7_5_2.Графа7 = 0 И СтруктураСтрок.Раздел7_6_2.Графа7 = 0 И СтруктураСтрок.Раздел7_7_2.Графа7  = 0 И СтруктураСтрок.Раздел7_8_2.Графа7 = 0 И СтруктураСтрок.Раздел7_9_2.Графа7 = 0;
		УсловиеРазделов8 = СтруктураСтрок.Раздел7_1_2.Графа8 = 0 И СтруктураСтрок.Раздел7_2_2.Графа8 = 0 И СтруктураСтрок.Раздел7_3_2.Графа8 = 0 И СтруктураСтрок.Раздел7_4_2.Графа8 = 0 И СтруктураСтрок.Раздел7_5_2.Графа8 = 0 И СтруктураСтрок.Раздел7_6_2.Графа8 = 0 И СтруктураСтрок.Раздел7_7_2.Графа8  = 0 И СтруктураСтрок.Раздел7_8_2.Графа8 = 0 И СтруктураСтрок.Раздел7_9_2.Графа8 = 0;
		
		УсловиеРазделов = УсловиеРазделов5 И УсловиеРазделов6 И УсловиеРазделов7 И УсловиеРазделов8;
		
		Если Выборка.Раздел2_1_8_2 <> 0  И УсловиеРазделов Тогда
			
			ОписаниеУсловия = "Если в строках 1.8.2 Раздела II указано значение, отличное от нуля, то как минимум в одной из граф 5, 6, 7, 8 строк 1.2, 2.2, 3.2, 4.2, 5.2, 6.2, 7.2, 8.2 и 9.2 Раздела VII должно быть указано значение, отличное от нуля.";
			//	ОписаниеОшибки = Строка(Выборка.Раздел2_1_2) + " <> " + Строка(СуммаРазделов);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 20 + КолДопКолонок, 1, 20 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;    	
		Иначе
			ОбластьСтрокаКС.Область(1, 20 + КолДопКолонок, 1, 20 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;  
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_8_2 = ОписаниеУсловия;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_8_2 = ОписаниеУсловия;
		
		// строках 1.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_1_3 < Выборка.Раздел2_1_3_1 + Выборка.Раздел2_1_3_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1.3 Раздела II, должно быть больше или равно сумме значений, указанных в строках 1.3.1 и 1.3.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1_3) +" < " + Строка(Выборка.Раздел2_1_3_1 + Выборка.Раздел2_1_3_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 21 + КолДопКолонок, 1, 21 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 21 + КолДопКолонок, 1, 21 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_3 = Выборка.Раздел2_1_3 - Выборка.Раздел2_1_3_1  - Выборка.Раздел2_1_3_2;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_3 =  ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 1.4
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_1_4 < Выборка.Раздел2_1_4_1 + Выборка.Раздел2_1_4_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1.4 Раздела II, должно быть больше или равно сумме значений, указанных в строках 1.4.1 и 1.4.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1_4) +" < " + Строка(Выборка.Раздел2_1_4_1 + Выборка.Раздел2_1_4_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 22 + КолДопКолонок, 1, 22 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 22 + КолДопКолонок, 1, 22 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_4 = Выборка.Раздел2_1_4 - Выборка.Раздел2_1_4_1  - Выборка.Раздел2_1_4_2;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_4 =  ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 1.5
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_1_5 < Выборка.Раздел2_1_5_1 + Выборка.Раздел2_1_5_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1.5 Раздела II, должно быть равно сумме значений, указанных в строках 1.5.1 и 1.5.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1_5) +" < " + Строка(Выборка.Раздел2_1_5_1 + Выборка.Раздел2_1_5_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 23 + КолДопКолонок, 1, 23 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 23 + КолДопКолонок, 1, 23 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_5 = Выборка.Раздел2_1_5 - Выборка.Раздел2_1_5_1  - Выборка.Раздел2_1_5_2;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_5 =  ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 1.7
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_1_7 < Выборка.Раздел2_1_7_1 + Выборка.Раздел2_1_7_2 + Выборка.Раздел2_1_7_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1.7 Раздела II, должно быть равно сумме значений, указанных в строках 1.7.1, 1.7.2 и 1.7.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1_7) +" < " + Строка(Выборка.Раздел2_1_7_1 + Выборка.Раздел2_1_7_2 + Выборка.Раздел2_1_7_3);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 24 + КолДопКолонок, 1, 24 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 24 + КолДопКолонок, 1, 24 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_7 = Выборка.Раздел2_1_7 - Выборка.Раздел2_1_7_1  - Выборка.Раздел2_1_7_2  - Выборка.Раздел2_1_7_3;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_7 =  ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 1.8
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_1_8 < Выборка.Раздел2_1_8_1 + Выборка.Раздел2_1_8_2 + Выборка.Раздел2_1_8_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1.8 Раздела II, должно быть больше или равно сумме значений, указанных в строках 1.8.1, 1.8.2 и 1.8.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1_8) +" < " + Строка(Выборка.Раздел2_1_8_1 + Выборка.Раздел2_1_8_2 + Выборка.Раздел2_1_8_3);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 25 + КолДопКолонок, 1, 25 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 25 + КолДопКолонок, 1, 25 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_8 = Выборка.Раздел2_1_8 - Выборка.Раздел2_1_8_1  - Выборка.Раздел2_1_8_2  - Выборка.Раздел2_1_8_3;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_8 =  ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 1.12
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_1_12 < Выборка.Раздел2_1_12_1 + Выборка.Раздел2_1_12_2 + Выборка.Раздел2_1_12_3 + Выборка.Раздел2_1_12_4 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1.12 Раздела II, должно быть равно сумме значений, указанных в строках 1.12.1, 1.12.2, 1.12.3 и 1.12.4.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1_12) +" < " + Строка(Выборка.Раздел2_1_12_1 + Выборка.Раздел2_1_12_2 + Выборка.Раздел2_1_12_3 + Выборка.Раздел2_1_12_4);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 26 + КолДопКолонок, 1, 26 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 26 + КолДопКолонок, 1, 26 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_12 = Выборка.Раздел2_1_12 - Выборка.Раздел2_1_12_1  - Выборка.Раздел2_1_12_2 - Выборка.Раздел2_1_12_3 - Выборка.Раздел2_1_12_4;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_12 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 1.12.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_1_12_1 < Выборка.Раздел2_1_12_1_1 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1.12.1 Раздела II, должно быть больше или равно значению, указанному в строке 1.12.1.1.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1_12_1) +" < " + Строка(Выборка.Раздел2_1_12_1_1);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 27 + КолДопКолонок, 1, 27 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 27 + КолДопКолонок, 1, 27 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_12_1 = Выборка.Раздел2_1_12_1  - Выборка.Раздел2_1_12_1_1;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_12_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		
		// строках 1.12.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  
		
		Массив_1 = Выборка.ДокументОтчетности.ТаблицаПоказателей.НайтиСтроки(Новый Структура("Раздел", Справочники.Разделы.Раздел5_1));		
		Раздел5_1_Графа6 = Массив_1[0].Показатель4;
		Массив_2 = Выборка.ДокументОтчетности.ТаблицаПоказателей.НайтиСтроки(Новый Структура("Раздел", Справочники.Разделы.Раздел5_2));		
		Раздел5_2_Графа6 = Массив_2[0].Показатель4;
		Массив_3 = Выборка.ДокументОтчетности.ТаблицаПоказателей.НайтиСтроки(Новый Структура("Раздел", Справочники.Разделы.Раздел5_3));		
		Раздел5_3_Графа6 = Массив_3[0].Показатель4;   
		
		
		Если Выборка.Раздел2_1_12 < Раздел5_1_Графа6 + Раздел5_2_Графа6 + Раздел5_3_Графа6 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1.12 Раздела II, должно быть больше или равно сумме значений строк 1, 2 и 3, указанных в графе 6 Раздела V.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1_12) +" < " + Строка(Раздел5_1_Графа6 + Раздел5_2_Графа6 + Раздел5_3_Графа6);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 28 + КолДопКолонок, 1, 28 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 28 + КолДопКолонок, 1, 28 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_12_Графы = Выборка.Раздел2_1_12  - Раздел5_1_Графа6 - Раздел5_2_Графа6 - Раздел5_3_Графа6 ;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_12_Графы = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 		
		
		
		// строках 2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_2 <> Выборка.Раздел2_2_1 + Выборка.Раздел2_2_2 + Выборка.Раздел2_2_3 + Выборка.Раздел2_2_4 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 2 Раздела II, должно быть равно сумме значений, указанных в строке 2.1, 2.2, 2.3 и 2.4.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_2) +" <> " + Строка(Выборка.Раздел2_2_1 + Выборка.Раздел2_2_2 + Выборка.Раздел2_2_3 + Выборка.Раздел2_2_4);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 29 + КолДопКолонок, 1, 29 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 29 + КолДопКолонок, 1, 29 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_2 = Выборка.Раздел2_2 - Выборка.Раздел2_2_1 - Выборка.Раздел2_2_2 - Выборка.Раздел2_2_3 - Выборка.Раздел2_2_4;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 2_1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_2_1 < Выборка.Раздел2_2_1_1 + Выборка.Раздел2_2_1_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 2.1 Раздела II, должно быть больше или равно сумме значений, указанных в строках 2.1.1 и 2.1.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_2_1) +" < " + Строка(Выборка.Раздел2_2_1_1 + Выборка.Раздел2_2_1_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 30 + КолДопКолонок, 1, 30 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 30 + КолДопКолонок, 1, 30 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_2_1 = Выборка.Раздел2_2_1 - Выборка.Раздел2_2_1_1 - Выборка.Раздел2_2_1_2;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 2_1.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_2_1_1 < Выборка.Раздел2_2_1_1_1 + Выборка.Раздел2_2_1_1_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 2.1 Раздела II, должно быть больше или равно сумме значений, указанных в строках 2.1.1 и 2.1.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_2_1_1) +" < " + Строка(Выборка.Раздел2_2_1_1_1 + Выборка.Раздел2_2_1_1_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 31 + КолДопКолонок, 1, 31 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 31 + КолДопКолонок, 1, 31 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_2_1_1 = Выборка.Раздел2_2_1_1 - Выборка.Раздел2_2_1_1_1 - Выборка.Раздел2_2_1_1_2;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_2_1_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 2_1.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_2_1_2 < Выборка.Раздел2_2_1_2_1 + Выборка.Раздел2_2_1_2_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 2.1.2 Раздела II, должно быть больше или равно сумме значений, указанных в строках 2.1.2.1 и 2.1.2.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_2_1_2) +" < " + Строка(Выборка.Раздел2_2_1_2_1 + Выборка.Раздел2_2_1_2_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 32 + КолДопКолонок, 1, 32 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 32 + КолДопКолонок, 1, 32 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_2_1_2 = Выборка.Раздел2_2_1_2 - Выборка.Раздел2_2_1_2_1 - Выборка.Раздел2_2_1_2_2;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_2_1_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 2.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_2_3 < Выборка.Раздел2_2_3_1 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 2.3 Раздела II, должно быть больше или равно значению, указанному в строке 2.3.1.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_2_3) +" < " + Строка(Выборка.Раздел2_2_3_1);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 33 + КолДопКолонок, 1, 33 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 33 + КолДопКолонок, 1, 33 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_2_3 = Выборка.Раздел2_2_3 - Выборка.Раздел2_2_3_1 ;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_2_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 3.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_3_1 < Выборка.Раздел2_3_1_1 + Выборка.Раздел2_3_1_2 + Выборка.Раздел2_3_1_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 3.1 Раздела II, должно быть равно сумме значений, указанных в строках 3.1.1, 3.1.2 и 3.1.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_1) +" < " + Строка(Выборка.Раздел2_3_1_1 - Выборка.Раздел2_3_1_2 - Выборка.Раздел2_3_1_3);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 34 + КолДопКолонок, 1, 34 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 34 + КолДопКолонок, 1, 34 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_3_1 = Выборка.Раздел2_3_1 - Выборка.Раздел2_3_1_1 - Выборка.Раздел2_3_1_2 - Выборка.Раздел2_3_1_3;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_3_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 3.1.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_3_1_2 < Выборка.Раздел2_3_1_2_1 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 3.1.2 Раздела II, должно быть больше или равно значению, указанному в строке 3.1.2.1.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_1_2) +" < " + Строка(Выборка.Раздел2_3_1_2_1);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 35 + КолДопКолонок, 1, 35 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 35 + КолДопКолонок, 1, 35 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_3_1_2 = Выборка.Раздел2_3_1_2 - Выборка.Раздел2_3_1_2_1;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_3_1_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 3.1.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_3_1_3 <> Выборка.Раздел2_3_1_3_1 + Выборка.Раздел2_3_1_3_2 + Выборка.Раздел2_3_1_3_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 3.1.3 Раздела II, должно быть равно сумме значений, указанных в строках 3.1.3.1, 3.1.3.2 и 3.1.3.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_1_3) +" <> " + Строка(Выборка.Раздел2_3_1_3_1 + Выборка.Раздел2_3_1_3_2 + Выборка.Раздел2_3_1_3_3);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 36 + КолДопКолонок, 1, 36 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 36 + КолДопКолонок, 1, 36 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_3_1_3 = Выборка.Раздел2_3_1_3 - Выборка.Раздел2_3_1_3_1 - Выборка.Раздел2_3_1_3_2 - Выборка.Раздел2_3_1_3_3;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_3_1_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 3.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_3_2 <> Выборка.Раздел2_3_2_1 + Выборка.Раздел2_3_2_2 + Выборка.Раздел2_3_2_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 3.2 Раздела II, должно быть равно сумме значений, указанных в строках 3.2.1, 3.2.2 и 3.2.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_2) +" <> " + Строка(Выборка.Раздел2_3_2_1 + Выборка.Раздел2_3_2_2 + Выборка.Раздел2_3_2_3);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 37 + КолДопКолонок, 1, 37 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 37 + КолДопКолонок, 1, 37 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_3_2 = Выборка.Раздел2_3_2 - Выборка.Раздел2_3_2_1 - Выборка.Раздел2_3_2_2 - Выборка.Раздел2_3_2_3;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_3_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 3.2.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_3_2_2 < Выборка.Раздел2_3_2_2_1 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 3.2.2 Раздела II, должно быть больше или равно значению, указанному в строке 3.2.2.1.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_2_2) +" < " + Строка(Выборка.Раздел2_3_2_2_1);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 38 + КолДопКолонок, 1, 38 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 38 + КолДопКолонок, 1, 38 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_3_2_2 = Выборка.Раздел2_3_2_2 - Выборка.Раздел2_3_2_2_1;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_3_2_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 3.2.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_3_2_3 <> Выборка.Раздел2_3_2_3_1 +  Выборка.Раздел2_3_2_3_2 +  Выборка.Раздел2_3_2_3_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 3.2.3 Раздела II, должно быть равно сумме значений, указанных в строках 3.2.3.1, 3.2.3.2 и 3.2.3.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_2_3) +" <> " + Строка(Выборка.Раздел2_3_2_3_1 +  Выборка.Раздел2_3_2_3_2 +  Выборка.Раздел2_3_2_3_3);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 39 + КолДопКолонок, 1, 39 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 39 + КолДопКолонок, 1, 39 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_3_2_3 = Выборка.Раздел2_3_2_3 - Выборка.Раздел2_3_2_3_1 - Выборка.Раздел2_3_2_3_2 - Выборка.Раздел2_3_2_3_3;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_3_2_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		
		// строках 3.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_3_3 < Выборка.Раздел2_3_3_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 3.3 Раздела II, должно быть больше или равно значению, указанному в строке 3.3.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_3) +" < " + Строка(Выборка.Раздел2_3_3_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 40 + КолДопКолонок, 1, 40 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 40 + КолДопКолонок, 1, 40 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_3_3 = Выборка.Раздел2_3_3 - Выборка.Раздел2_3_3_2;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_3_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строках 1.1.1 или 1.2.1 и 1.8.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если (Выборка.Раздел2_1_1_1 = 0 И Выборка.Раздел2_1_2_1 = 0) И Выборка.Раздел2_1_8_1 <> 0 Тогда
			ОписаниеУсловия= "Если в строке 1.8.1  Раздела II указано значение, отличное от нуля, то и в строках 1.1.1 или 1.2.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "1.8.1 = " + Строка(Выборка.Раздел2_1_8_1) +"; 1.1.1 = " + Строка(Выборка.Раздел2_1_1_1) +"; 1.2.1 = " + Строка(Выборка.Раздел2_1_2_1);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 41 + КолДопКолонок, 1, 42 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 41 + КолДопКолонок, 1, 42 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Сумма_1_1_1_и_1_2_1 = Выборка.Раздел2_1_1_1 + Выборка.Раздел2_1_2_1;
		ОбластьСтрокаКС.Параметры.Раздел2_1_8_1 = Выборка.Раздел2_1_8_1;                  		
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_1_и_1_2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;	
		
		
		//  строках 1.1.2 или 1.2.2 и 1.8.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если (Выборка.Раздел2_1_1_2 = 0 И Выборка.Раздел2_1_2_2 = 0) И Выборка.Раздел2_1_8_2 <> 0 Тогда
			ОписаниеУсловия= "Если в строке 1.8.2 Раздела II указано значение, отличное от нуля, то и в строках 1.1.2 или 1.2.2 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "1.8.2 = " + Строка(Выборка.Раздел2_1_8_2) +"; 1.1.2 = " + Строка(Выборка.Раздел2_1_1_2) +"; 1.2.2 = " + Строка(Выборка.Раздел2_1_2_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 43 + КолДопКолонок, 1, 44 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 43 + КолДопКолонок, 1, 44 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Сумма_1_1_2_и_1_2_2 = Выборка.Раздел2_1_1_2 + Выборка.Раздел2_1_2_2;
		ОбластьСтрокаКС.Параметры.Раздел2_1_8_2 = Выборка.Раздел2_1_8_2;                  		
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_2_и_1_2_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;	
		
		//  строках 1.1.3 или 1.2.3 и 1.8.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если (Выборка.Раздел2_1_1_3 = 0 И Выборка.Раздел2_1_2_3 = 0) И Выборка.Раздел2_1_8_3 <> 0 Тогда
			ОписаниеУсловия= "Если в строке 1.8.3 Раздела II указано значение, отличное от нуля, то и в строках 1.1.3 или 1.2.3 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "1.8.3 = " + Строка(Выборка.Раздел2_1_8_3) +"; 1.1.3 = " + Строка(Выборка.Раздел2_1_1_3) +"; 1.2.3 = " + Строка(Выборка.Раздел2_1_2_3);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 45 + КолДопКолонок, 1, 46 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 45 + КолДопКолонок, 1, 46 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Сумма_1_1_3_и_1_2_3 = Выборка.Раздел2_1_1_3 + Выборка.Раздел2_1_2_3;
		ОбластьСтрокаКС.Параметры.Раздел2_1_8_3 = Выборка.Раздел2_1_8_3;                  		
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_3_и_1_2_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;	
		
		//  строка 4 
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел3_4 <> Выборка.Раздел3_4_1 + Выборка.Раздел3_4_2 + Выборка.Раздел3_4_3 + Выборка.Раздел3_4_4 + Выборка.Раздел3_4_5 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 4 Раздела III, должно быть равно сумме значений, указанных в строках 4.1, 4.2, 4.3, 4.4 и 4.5.";
			ОписаниеОшибки = Строка(Выборка.Раздел3_4) +" <> " + Строка(Выборка.Раздел3_4_1 + Выборка.Раздел3_4_2 + Выборка.Раздел3_4_3 + Выборка.Раздел3_4_4 + Выборка.Раздел3_4_5);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 49 + КолДопКолонок, 1, 49 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 49 + КолДопКолонок, 1, 49 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел3_4 = Выборка.Раздел3_4 - Выборка.Раздел3_4_1 - Выборка.Раздел3_4_2 - Выборка.Раздел3_4_3 - Выборка.Раздел3_4_4 - Выборка.Раздел3_4_5;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел3_4 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 4.1 
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел3_4_1 < Выборка.Раздел3_4_1_1 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 4 Раздела III, должно быть равно сумме значений, указанных в строках 4.1, 4.2, 4.3, 4.4 и 4.5.";
			ОписаниеОшибки = Строка(Выборка.Раздел3_4_1) +" < " + Строка(Выборка.Раздел3_4_1_1);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 50 + КолДопКолонок, 1, 50 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 50 + КолДопКолонок, 1, 50 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел3_4_1 = Выборка.Раздел3_4_1 - Выборка.Раздел3_4_1_1;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел3_4_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 5 
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел3_5 <> Выборка.Раздел3_5_1 + Выборка.Раздел3_5_2 + Выборка.Раздел3_5_3 + Выборка.Раздел3_5_4 + Выборка.Раздел3_5_5  + Выборка.Раздел3_5_6 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 5 Раздела III, должно быть равно сумме значений, указанных в строках 5.1, 5.2, 5.3, 5.4, 5.5 и 5.6.";
			ОписаниеОшибки = Строка(Выборка.Раздел3_5) +" <> " + Строка(Выборка.Раздел3_5_1 + Выборка.Раздел3_5_2 + Выборка.Раздел3_5_3 + Выборка.Раздел3_5_4 + Выборка.Раздел3_5_5  + Выборка.Раздел3_5_6);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 51 + КолДопКолонок, 1, 51 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 51 + КолДопКолонок, 1, 51 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел3_5 = Выборка.Раздел3_5 - Выборка.Раздел3_5_1 - Выборка.Раздел3_5_2 - Выборка.Раздел3_5_3 - Выборка.Раздел3_5_4 - Выборка.Раздел3_5_5  - Выборка.Раздел3_5_6;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел3_5 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 5.3 
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел3_5_3 < Выборка.Раздел3_5_3_1 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 5.3 Раздела III, должно быть больше или равно значению, указанному в строке 5.3.1.";
			ОписаниеОшибки = Строка(Выборка.Раздел3_5_3) +" < " + Строка(Выборка.Раздел3_5_3_1);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 52 + КолДопКолонок, 1, 52 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 52 + КолДопКолонок, 1, 52 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел3_5_3 = Выборка.Раздел3_5 - Выборка.Раздел3_5_3 - Выборка.Раздел3_5_3_1;	
		ОбластьСтрокаКС.Параметры.Проверка_Раздел3_5_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 9.1 
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел3_9_1 < Выборка.Раздел3_9_1_1 + Выборка.Раздел3_9_1_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 9.1 Раздела III, должно быть больше или равно сумме значений, указанных в строках 9.1.1 и 9.1.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел3_9_1) +" < " + Строка(Выборка.Раздел3_9_1_1 + Выборка.Раздел3_9_1_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 53 + КолДопКолонок, 1, 53 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 53 + КолДопКолонок, 1, 53 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел3_9_1 = Выборка.Раздел3_9_1 - Выборка.Раздел3_9_1_1 - Выборка.Раздел3_9_1_2;	
		ОбластьСтрокаКС.Параметры.Проверка_Раздел3_9_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 10 
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел3_10 < Выборка.Раздел3_10_1 + Выборка.Раздел3_10_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 9.1 Раздела III, должно быть больше или равно сумме значений, указанных в строках 9.1.1 и 9.1.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел3_10) +" < " + Строка(Выборка.Раздел3_10_1 + Выборка.Раздел3_10_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 54 + КолДопКолонок, 1, 54 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 54 + КолДопКолонок, 1, 54 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел3_10 = Выборка.Раздел3_10 - Выборка.Раздел3_10_1 - Выборка.Раздел3_10_2;	
		ОбластьСтрокаКС.Параметры.Проверка_Раздел3_10 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 11
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_11 <> Выборка.Раздел4_11_1 + Выборка.Раздел4_11_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 11, должно быть равно сумме значений, указанных в строках 11.1 и 11.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_11) +" <> " + Строка(Выборка.Раздел4_11_1 + Выборка.Раздел4_11_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 56 + КолДопКолонок, 1, 56 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 56 + КолДопКолонок, 1, 56 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_11 = Выборка.Раздел4_11 - Выборка.Раздел4_11_1 - Выборка.Раздел4_11_2;	
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_11 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 12
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_12 <> Выборка.Раздел4_12_1 + Выборка.Раздел4_12_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 12, должно быть равно сумме значений, указанных в строках 12.1 и 12.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_12) +" <> " + Строка(Выборка.Раздел4_12_1 + Выборка.Раздел4_12_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 57 + КолДопКолонок, 1, 57 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 57 + КолДопКолонок, 1, 57 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_12 = Выборка.Раздел4_12 - Выборка.Раздел4_12_1 - Выборка.Раздел4_12_2;	
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_12 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 13
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_13 <> Выборка.Раздел4_13_1 + Выборка.Раздел4_13_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 13, должно быть равно сумме значений, указанных в строках 13.1 и 13.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_13) +" <> " + Строка(Выборка.Раздел4_13_1 + Выборка.Раздел4_13_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 58 + КолДопКолонок, 1, 58 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 58 + КолДопКолонок, 1, 58 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_13 = Выборка.Раздел4_13 - Выборка.Раздел4_13_1 - Выборка.Раздел4_13_2;	
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_13 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 14
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_14 <> Выборка.Раздел4_14_1 + Выборка.Раздел4_14_2 + Выборка.Раздел4_14_3  Тогда
			ОписаниеУсловия= "Значение, указанное в строке 14, должно быть равно сумме значений, указанных в строках 14.1, 14.2 и 14.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_14) +" <> " + Строка(Выборка.Раздел4_14_1 + Выборка.Раздел4_14_2 + Выборка.Раздел4_14_3);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 59 + КолДопКолонок, 1, 59 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 59 + КолДопКолонок, 1, 59 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_14 = Выборка.Раздел4_14 - Выборка.Раздел4_14_1 - Выборка.Раздел4_14_2 - Выборка.Раздел4_14_3;	
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_14 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 14.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_14_3 < Выборка.Раздел4_14_3_1 + Выборка.Раздел4_14_3_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 14.3, должно быть больше или равно сумме значений, указанных в строках 14.3.1 и 14.3.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_14_3) +" <> " + Строка(Выборка.Раздел4_14_3_1 + Выборка.Раздел4_14_3_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 60 + КолДопКолонок, 1, 60 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 60 + КолДопКолонок, 1, 60 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_14_3 = Выборка.Раздел4_14_3 - Выборка.Раздел4_14_3_1 - Выборка.Раздел4_14_3_2;	
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_14_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		
		//  строка 15 и 1.1. и 1.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_15 <> 0 И (Выборка.Раздел2_1_1 + Выборка.Раздел2_1_2) = 0 Тогда
			ОписаниеУсловия= "Если в строке 15 указано значение, отличное от нуля, то и в строках 1.1. или 1.2 раздела II должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "Строка 15 = " + Строка(Выборка.Раздел2_15) +"; 1.1 = " + Строка(Выборка.Раздел2_1_1)+"; 1.2 = " + Строка(Выборка.Раздел2_1_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 61 + КолДопКолонок, 1, 62 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 61 + КолДопКолонок, 1, 62 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_15 = Выборка.Раздел4_15;
		ОбластьСтрокаКС.Параметры.Сумма_1_1_и_1_2 = Выборка.Раздел2_1_1 + Выборка.Раздел2_1_2;	
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_и_1_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 15.1 и 1.1.1 и 1.2.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_15_1 <> 0 И (Выборка.Раздел2_1_1_1 + Выборка.Раздел2_1_2_1) = 0 Тогда
			ОписаниеУсловия= "Если в строке 15.1 указано значение, отличное от нуля, то и в строках 1.1.1 или 1.2.1 раздела II должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "Строка 15.1 = " + Строка(Выборка.Раздел2_15_1) +"; 1.1.1 = " + Строка(Выборка.Раздел2_1_1_1)+"; 1.2.1 = " + Строка(Выборка.Раздел2_1_2_1);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 63 + КолДопКолонок, 1, 64 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 63 + КолДопКолонок, 1, 64 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_15_1 = Выборка.Раздел4_15_1;
		ОбластьСтрокаКС.Параметры.Сумма_1_1_1_и_1_2_1 = Выборка.Раздел2_1_1_1 + Выборка.Раздел2_1_2_1;	
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_1_и_1_2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 15.2 и 1.1.2 и 1.2.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_15_2 <> 0 И (Выборка.Раздел2_1_1_2 + Выборка.Раздел2_1_2_2) = 0 Тогда
			ОписаниеУсловия= "Если в строке 15.2 указано значение, отличное от нуля, то и в строках 1.1.2 или 1.2.2 раздела II должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "Строка 15.2 = " + Строка(Выборка.Раздел4_15_2) +"; 1.1.2 = " + Строка(Выборка.Раздел2_1_1_2)+"; 1.2.2 = " + Строка(Выборка.Раздел2_1_2_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 65 + КолДопКолонок, 1, 66 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 65 + КолДопКолонок, 1, 66 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_15_2 = Выборка.Раздел4_15_2;
		ОбластьСтрокаКС.Параметры.Сумма_1_1_2_и_1_2_2 = Выборка.Раздел2_1_1_2 + Выборка.Раздел2_1_2_2;	
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_2_и_1_2_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 15.3 и 1.1.3 и 1.2.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_15_3 <> 0 И (Выборка.Раздел2_1_1_3 + Выборка.Раздел2_1_2_3) = 0 Тогда
			ОписаниеУсловия= "Если в строке 15.3 указано значение, отличное от нуля, то и в строках 1.1.3 или 1.2.3 раздела II должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "Строка 15.3 = " + Строка(Выборка.Раздел4_15_3) +"; 1.1.3 = " + Строка(Выборка.Раздел2_1_1_3)+"; 1.2.3 = " + Строка(Выборка.Раздел2_1_2_3);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 67 + КолДопКолонок, 1, 68 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 67 + КолДопКолонок, 1, 68 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_15_3 = Выборка.Раздел4_15_3;
		ОбластьСтрокаКС.Параметры.Сумма_1_1_3_и_1_2_3 = Выборка.Раздел2_1_1_3 + Выборка.Раздел2_1_2_3;	
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_3_и_1_2_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 15 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_15 <> Выборка.Раздел4_15_1 + Выборка.Раздел4_15_2 + Выборка.Раздел4_15_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 15, должно быть равно сумме значений, указанных в строках 15.1, 15.2 и 15.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_15) +" <> " + Строка(Выборка.Раздел4_15_1 + Выборка.Раздел4_15_2 + Выборка.Раздел4_15_3);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 69 + КолДопКолонок, 1, 69 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 69 + КолДопКолонок, 1, 69 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_15_Сумма = Выборка.Раздел4_15 - Выборка.Раздел4_15_1 - Выборка.Раздел4_15_2 - Выборка.Раздел4_15_3;	
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_15_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 17 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_17 <> Выборка.Раздел4_17_1 + Выборка.Раздел4_17_2 + Выборка.Раздел4_17_3 + Выборка.Раздел4_17_4 + Выборка.Раздел4_17_5 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 17, должно быть равно сумме значений, указанных в строках 17.1, 17.2, 17.3, 17.4 и 17.5.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_17) +" <> " + Строка(Выборка.Раздел4_17_1 + Выборка.Раздел4_17_2 + Выборка.Раздел4_17_3 + Выборка.Раздел4_17_4 + Выборка.Раздел4_17_5);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 70 + КолДопКолонок, 1, 70 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 70 + КолДопКолонок, 1, 70 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_17_Сумма = Выборка.Раздел4_17 - Выборка.Раздел4_17_1 - Выборка.Раздел4_17_2 - Выборка.Раздел4_17_3 - Выборка.Раздел4_17_4 - Выборка.Раздел4_17_5;	
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_17_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 18 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_18 <> Выборка.Раздел4_18_1 + Выборка.Раздел4_18_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 18, должно быть равно сумме значений, указанных в строках 18.1 и 18.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_18) +" <> " + Строка(Выборка.Раздел4_18_1 + Выборка.Раздел4_18_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 71 + КолДопКолонок, 1, 71 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 71 + КолДопКолонок, 1, 71 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_18_Сумма = Выборка.Раздел4_18 - Выборка.Раздел4_18_1 - Выборка.Раздел4_18_2;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_18_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 18.1 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_18_1 <> Выборка.Раздел4_18_1_1 + Выборка.Раздел4_18_1_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 18.1, должно быть равно сумме значений, указанных в строках 18.1.1 и 18.1.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_18_1) +" <> " + Строка(Выборка.Раздел4_18_1_1 + Выборка.Раздел4_18_1_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 72 + КолДопКолонок, 1, 72 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 72 + КолДопКолонок, 1, 72 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_18_1_Сумма = Выборка.Раздел4_18_1 - Выборка.Раздел4_18_1_1 - Выборка.Раздел4_18_1_2;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_18_1_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 18.2 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_18_2 <> Выборка.Раздел4_18_2_1 + Выборка.Раздел4_18_2_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 18.2, должно быть равно сумме значений, указанных в строках 18.2.1 и 18.2.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_18_2) +" <> " + Строка(Выборка.Раздел4_18_2_1 + Выборка.Раздел4_18_2_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 73 + КолДопКолонок, 1, 73 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 73 + КолДопКолонок, 1, 73 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_18_2_Сумма = Выборка.Раздел4_18_2 - Выборка.Раздел4_18_2_1 - Выборка.Раздел4_18_2_2;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_18_2_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 19 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19 <> Выборка.Раздел4_19_1 + Выборка.Раздел4_19_2 + Выборка.Раздел4_19_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 19, должно быть равно сумме значений, указанных в строках 19.1, 19.2 и 19.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19) +" <> " + Строка(Выборка.Раздел4_19_1 + Выборка.Раздел4_19_2 + Выборка.Раздел4_19_3);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 74 + КолДопКолонок, 1, 74 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 74 + КолДопКолонок, 1, 74 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_Сумма = Выборка.Раздел4_19 - Выборка.Раздел4_19_1 - Выборка.Раздел4_19_2 - Выборка.Раздел4_19_3;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 19.3 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_3 <> Выборка.Раздел4_19_3_1 + Выборка.Раздел4_19_3_2 + Выборка.Раздел4_19_3_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 19, должно быть равно сумме значений, указанных в строках 19.1, 19.2 и 19.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_3) +" <> " + Строка(Выборка.Раздел4_19_3_1 + Выборка.Раздел4_19_3_2 + Выборка.Раздел4_19_3_3);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 75 + КолДопКолонок, 1, 75 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 75 + КолДопКолонок, 1, 75 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_3_Сумма = Выборка.Раздел4_19_3 - Выборка.Раздел4_19_3_1 - Выборка.Раздел4_19_3_2 - Выборка.Раздел4_19_3_3;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_3_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 19.1 И 19.1.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_1 <> 0 И Выборка.Раздел4_19_1_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 19.1 указано значение, отличное от нуля, то и в строке 19.1.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_1) +" <> 0 И " + Строка(Выборка.Раздел4_19_1_1) +" = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 76 + КолДопКолонок, 1, 77 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 76 + КолДопКолонок, 1, 77 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_1 = Выборка.Раздел4_19_1;
		ОбластьСтрокаКС.Параметры.Раздел4_19_1_1 = Выборка.Раздел4_19_1_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_1_19_1_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 19.1.1 И 19.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_1_1 <> 0 И Выборка.Раздел4_19_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 19.1.1 указано значение, отличное от нуля, то и в строке 19.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_1_1) +" <> 0 И " + Строка(Выборка.Раздел4_19_1) +" = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 78 + КолДопКолонок, 1, 78 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 78 + КолДопКолонок, 1, 78 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_1_1_19_1 = Выборка.Раздел4_19_1 - Выборка.Раздел4_19_1_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_1_19_1_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 19.2 И 19.2.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_2 <> 0 И Выборка.Раздел4_19_2_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 19.2 указано значение, отличное от нуля, то и в строке 19.2.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_2) +" <> 0 И " + Строка(Выборка.Раздел4_19_2_1) +" = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 79 + КолДопКолонок, 1, 80 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 79 + КолДопКолонок, 1, 80 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_2 = Выборка.Раздел4_19_2;
		ОбластьСтрокаКС.Параметры.Раздел4_19_2_1 = Выборка.Раздел4_19_2_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_2_19_2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 19.2.1 И 19.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_2_1 <> 0 И Выборка.Раздел4_19_2 = 0 Тогда
			ОписаниеУсловия= "Если в строке 19.2.1 указано значение, отличное от нуля, то и в строке 19.2 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_2_1) +" <> 0 И " + Строка(Выборка.Раздел4_19_2) +" = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 81 + КолДопКолонок, 1, 81 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 81 + КолДопКолонок, 1, 81 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_2_1_19_2 = Выборка.Раздел4_19_2 - Выборка.Раздел4_19_2_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_2_1_19_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 19.3.1 И 19.3.1.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_3_1 <> 0 И Выборка.Раздел4_19_3_1_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 19.3.1 указано значение, отличное от нуля, то и в строке 19.3.1.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_3_1) +" <> 0 И " + Строка(Выборка.Раздел4_19_3_1_1) +" = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 82 + КолДопКолонок, 1, 83 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 82 + КолДопКолонок, 1, 83 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_3_1 = Выборка.Раздел4_19_3_1;
		ОбластьСтрокаКС.Параметры.Раздел4_19_3_1_1 = Выборка.Раздел4_19_3_1_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_3_1_19_3_1_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 19.3.1.1 И 19.3.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_3_1_1 <> 0 И Выборка.Раздел4_19_3_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 19.3.1.1 указано значение, отличное от нуля, то и в строке 19.3.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_3_1_1) +" <> 0 И " + Строка(Выборка.Раздел4_19_3_1) +" = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 84 + КолДопКолонок, 1, 84 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 84 + КолДопКолонок, 1, 84 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_3_1_1_19_3_1 = Выборка.Раздел4_19_3_1 - Выборка.Раздел4_19_3_1_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_3_1_1_19_3_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 19.3.2 И 19.3.2.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_3_2 <> 0 И Выборка.Раздел4_19_3_2_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 19.3.2 указано значение, отличное от нуля, то и в строке 19.3.2.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_3_2) +" <> 0 И " + Строка(Выборка.Раздел4_19_3_2_1) +" = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 85 + КолДопКолонок, 1, 86 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 85 + КолДопКолонок, 1, 86 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_3_2 = Выборка.Раздел4_19_3_2;
		ОбластьСтрокаКС.Параметры.Раздел4_19_3_2_1 = Выборка.Раздел4_19_3_2_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_3_2_19_3_2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 19.3.2.1 И 19.3.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_3_2_1 <> 0 И Выборка.Раздел4_19_3_2 = 0 Тогда
			ОписаниеУсловия= "Если в строке 19.3.2.1 указано значение, отличное от нуля, то и в строке 19.3.2 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_3_2_1) +" <> 0 И " + Строка(Выборка.Раздел4_19_3_2) +" = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 87 + КолДопКолонок, 1, 87 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 87 + КолДопКолонок, 1, 87 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_3_2_1_19_3_2 = Выборка.Раздел4_19_3_2 - Выборка.Раздел4_19_3_2_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_3_2_1_19_3_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 19.3.3 И 19.3.3.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_3_3 <> 0 И Выборка.Раздел4_19_3_3_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 19.3.3 указано значение, отличное от нуля, то и в строке 19.3.3.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_3_3) +" <> 0 И " + Строка(Выборка.Раздел4_19_3_3_1) +" = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 88 + КолДопКолонок, 1, 89 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 88 + КолДопКолонок, 1, 89 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_3_3 = Выборка.Раздел4_19_3_3;
		ОбластьСтрокаКС.Параметры.Раздел4_19_3_3_1 = Выборка.Раздел4_19_3_3_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_3_3_19_3_3_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 19.3.3.1 И 19.3.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_3_3_1 <> 0 И Выборка.Раздел4_19_3_3 = 0 Тогда
			ОписаниеУсловия= "Если в строке 19.3.3.1 указано значение, отличное от нуля, то и в строке 19.3.3 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_3_3_1) +" <> 0 И " + Строка(Выборка.Раздел4_19_3_3) +" = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 90 + КолДопКолонок, 1, 90 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 90 + КолДопКолонок, 1, 90 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_3_3_1_19_3_3 = Выборка.Раздел4_19_3_3 - Выборка.Раздел4_19_3_3_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_3_3_1_19_3_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		
		// проверка по строке 21 и разделу 10 по сумме
		НайденныеСтрокиРаздел10 = ТЗРаздел10.НайтиСтроки(Новый Структура("КодКПК_ДатаОтчетности", СокрЛП(Выборка.КПК.Код)+"_"+Строка(Выборка.ДатаОкончанияОтчетногоПериода)));
		
		СуммаСтрок1раздел10 = 0;
		ЕстьНольВСтроках1Раздела10 = Истина;
		
		СуммаСтрок2раздел10 = 0;
		ЕстьНольВСтроках2Раздела10 = Истина;    
		
		
		Если НайденныеСтрокиРаздел10.Количество() > 0 Тогда
			Для Каждого НайденнаяСтрока Из НайденныеСтрокиРаздел10 Цикл
				Если Лев(НайденнаяСтрока.КодРаздела, 1) = "1" Тогда
					СуммаСтрок1раздел10 = СуммаСтрок1раздел10 + НайденнаяСтрока.РазмерОбязательствНаКонецОтчетногоПериода;		
					
					Если НайденнаяСтрока.РазмерОбязательствНаКонецОтчетногоПериода <> 0 Тогда
						ЕстьНольВСтроках1Раздела10 = Ложь;
					КонецЕсли;
				ИначеЕсли Лев(НайденнаяСтрока.КодРаздела, 1) = "2" Тогда
					СуммаСтрок2раздел10 = СуммаСтрок2раздел10 + НайденнаяСтрока.РазмерОбязательствНаКонецОтчетногоПериода;		
					
					Если НайденнаяСтрока.РазмерОбязательствНаКонецОтчетногоПериода <> 0 Тогда
						ЕстьНольВСтроках2Раздела10 = Ложь;
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;   			
		КонецЕсли;
		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_21 <> СуммаСтрок1раздел10 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 21 должно быть равно сумме значений, указанных в графе 5 по строке 1 (1.1 – …) Раздела X.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_21) +" <> " + Строка(СуммаСтрок1раздел10);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 91 + КолДопКолонок, 1, 91 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 91 + КолДопКолонок, 1, 91 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_21_Раздел10 = Выборка.Раздел4_21 - СуммаСтрок1раздел10;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_21_Раздел10 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		// проверка по строке 21 и разделу 10 по нулям
		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_21 <> 0 И ЕстьНольВСтроках1Раздела10 = Истина Тогда
			ОписаниеУсловия= "Если в строке 21 указано значение, отличное от нуля, то и в графе 5 строк 1.1 – … Раздела Х должны быть указаны значения, отличные от нуля.";
			ОписаниеОшибки = "Строка 21 = " + Строка(Выборка.Раздел4_21) + ": " + Строка("Все строки 1 (1.1 – …) равны 0");
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 92 + КолДопКолонок, 1, 92 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 92 + КолДопКолонок, 1, 92 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_21_Раздел10_ПроверкаНаНоль = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;		
		
		
		//  строка 22 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_22 <> Выборка.Раздел4_22_1 + Выборка.Раздел4_22_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 22, должно быть равно сумме значений, указанных в строках 22.1 и 22.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_22) +" <> " + Строка(Выборка.Раздел4_22_1 + Выборка.Раздел4_22_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 93 + КолДопКолонок, 1, 93 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 93 + КолДопКолонок, 1, 93 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_22_Сумма = Выборка.Раздел4_22 - Выборка.Раздел4_22_1 - Выборка.Раздел4_22_2;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_22_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 23 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_23 <> Выборка.Раздел4_23_1 + Выборка.Раздел4_23_2 + Выборка.Раздел4_23_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 23, должно быть равно сумме значений, указанных в строках 23.1, 23.2 и 23.3. ";
			ОписаниеОшибки = Строка(Выборка.Раздел4_23) +" <> " + Строка(Выборка.Раздел4_23_1 + Выборка.Раздел4_23_2 + Выборка.Раздел4_23_3);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 94 + КолДопКолонок, 1, 94 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 94 + КолДопКолонок, 1, 94 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_23_Сумма = Выборка.Раздел4_23 - Выборка.Раздел4_23_1 - Выборка.Раздел4_23_2 - Выборка.Раздел4_23_3;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_23_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 23.3 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_23_3 <> Выборка.Раздел4_23_3_1 + Выборка.Раздел4_23_3_2 + Выборка.Раздел4_23_3_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 23.3, должно быть равно сумме значений, указанных в строках 23.3.1, 23.3.2 и 23.3.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_23_3) +" <> " + Строка(Выборка.Раздел4_23_3_1 + Выборка.Раздел4_23_3_2 + Выборка.Раздел4_23_3_3);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 95 + КолДопКолонок, 1, 95 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 95 + КолДопКолонок, 1, 95 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_23_3_Сумма = Выборка.Раздел4_23_3 - Выборка.Раздел4_23_3_1 - Выборка.Раздел4_23_3_2 - Выборка.Раздел4_23_3_3;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_23_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 23.1.1 И 23.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		                   
		
		Если Выборка.Раздел4_23_1_1 <> 0 И Выборка.Раздел4_23_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 23.1.1 указано значение, отличное от нуля, то и в строке 23.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_23_1_1) +" <> 0 И " + Строка(Выборка.Раздел4_23_1) +" = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 96 + КолДопКолонок, 1, 97 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 96 + КолДопКолонок, 1, 97 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_23_1_1 = Выборка.Раздел4_23_2_1;
		ОбластьСтрокаКС.Параметры.Раздел4_23_1 = Выборка.Раздел4_23_2;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_23_1_1_23_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		
		//  строка 23.2.1 И 23.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_23_2_1 <> 0 И Выборка.Раздел4_23_2 = 0 Тогда
			ОписаниеУсловия= "Если в строке 23.2.1 указано значение, отличное от нуля, то и в строке 23.2 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_23_2_1) +" <> 0 И " + Строка(Выборка.Раздел4_23_2) +" = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 98 + КолДопКолонок, 1, 99 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 98 + КолДопКолонок, 1, 99 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_23_2_1 = Выборка.Раздел4_23_2_1;
		ОбластьСтрокаКС.Параметры.Раздел4_23_2 = Выборка.Раздел4_23_2;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_23_2_1_23_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 23.3.1.1 И 23.3.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_23_3_1_1 <> 0 И Выборка.Раздел4_23_3_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 23.3.1.1 указано значение, отличное от нуля, то и в строке 23.3.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_23_3_1_1) +" <> 0 И " + Строка(Выборка.Раздел4_23_3_1) +" = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 100 + КолДопКолонок, 1, 101 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 100 + КолДопКолонок, 1, 101 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_23_3_1_1 = Выборка.Раздел4_23_3_1_1;
		ОбластьСтрокаКС.Параметры.Раздел4_23_3_1 = Выборка.Раздел4_23_3_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_23_2_1_23_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 23.3.2.1 И 23.3.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_23_3_2_1 <> 0 И Выборка.Раздел4_23_3_2 = 0 Тогда
			ОписаниеУсловия= "Если в строке 23.3.2.1 указано значение, отличное от нуля, то и в строке 23.3.2 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_23_3_2_1) +" <> 0 И " + Строка(Выборка.Раздел4_23_3_2) +" = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 102 + КолДопКолонок, 1, 103 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 102 + КолДопКолонок, 1, 103 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_23_3_2_1 = Выборка.Раздел4_23_3_2_1;
		ОбластьСтрокаКС.Параметры.Раздел4_23_3_2 = Выборка.Раздел4_23_3_2;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_23_3_2_1_23_3_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 23.3.3.1 И 23.3.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_23_3_3_1 <> 0 И Выборка.Раздел4_23_3_3 = 0 Тогда
			ОписаниеУсловия= "Если в строке 23.3.3.1 указано значение, отличное от нуля, то и в строке 23.3.3 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_23_3_3_1) +" <> 0 И " + Строка(Выборка.Раздел4_23_3_3) +" = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 104 + КолДопКолонок, 1, 105 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 104 + КолДопКолонок, 1, 105 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_23_3_3_1 = Выборка.Раздел4_23_3_3_1;
		ОбластьСтрокаКС.Параметры.Раздел4_23_3_3 = Выборка.Раздел4_23_3_3;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_23_3_3_1_23_3_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 24 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_24 <> Выборка.Раздел4_24_1 + Выборка.Раздел4_24_2 + Выборка.Раздел4_24_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 24, должно быть равно сумме значений, указанных в строках 24.1, 24.2 и 24.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_24) +" <> " + Строка(Выборка.Раздел4_24_1 + Выборка.Раздел4_24_2 + Выборка.Раздел4_24_3);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 106 + КолДопКолонок, 1, 106 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 106 + КолДопКолонок, 1, 106 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_24_Сумма = Выборка.Раздел4_24 - Выборка.Раздел4_24_1 - Выборка.Раздел4_24_2 - Выборка.Раздел4_24_3;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_24_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 25 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_25 < Выборка.Раздел4_25_1 + Выборка.Раздел4_25_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 25, должно быть больше или равно сумме значений, указанных в строках 25.1 и 25.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_25) +" < " + Строка(Выборка.Раздел4_25_1 + Выборка.Раздел4_25_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 107 + КолДопКолонок, 1, 107 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 107 + КолДопКолонок, 1, 107 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_25_Сумма = Выборка.Раздел4_25 - Выборка.Раздел4_25_1 - Выборка.Раздел4_25_2;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_25_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 25.1 И 25.1.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_25_1 <> 0 И Выборка.Раздел4_25_1_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 25.1 указано значение, отличное от нуля, то и в строке 25.1.1 должно быть указано значение, отличное от нуля ";
			ОписаниеОшибки = Строка(Выборка.Раздел4_25_1) +" <> 0 И " + Строка(Выборка.Раздел4_25_1_1) +" = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 108 + КолДопКолонок, 1, 109 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 108 + КолДопКолонок, 1, 109 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_25_1 = Выборка.Раздел4_25_1;
		ОбластьСтрокаКС.Параметры.Раздел4_25_1_1 = Выборка.Раздел4_25_1_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_25_1_25_1_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 25.1. и 25.1 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_25_1_1 <> 0 И  Выборка.Раздел4_25_1=0 Тогда
			ОписаниеУсловия= "Если в строке 25.1.1 указано значение, отличное от нуля, то и в строке 25.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_25_1_1) +" <> 0 И " + Строка(Выборка.Раздел4_25_1) + " = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 110 + КолДопКолонок, 1, 110 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 110 + КолДопКолонок, 1, 110 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		//  строка 25.2 И 25.2.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_25_2 <> 0 И Выборка.Раздел4_25_2_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 25.2 указано значение, отличное от нуля, то и в строке 25.2.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_25_2) +" <> 0 И " + Строка(Выборка.Раздел4_25_2_1) +" = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 111 + КолДопКолонок, 1, 112 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 111 + КолДопКолонок, 1, 112 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_25_2 = Выборка.Раздел4_25_2;
		ОбластьСтрокаКС.Параметры.Раздел4_25_2_1 = Выборка.Раздел4_25_2_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_25_2_25_2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 25.2.1 и 25.2 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_25_1_1 <> 0 И  Выборка.Раздел4_25_1=0 Тогда
			ОписаниеУсловия= "Если в строке 25.1.1 указано значение, отличное от нуля, то и в строке 25.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_25_1_1) +" <> 0 И " + Строка(Выборка.Раздел4_25_1) + " = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 113 + КолДопКолонок, 1, 113 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 113 + КолДопКолонок, 1, 113 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		// строка 25.1 и графа 4 раздел6 
		Графы4Раздел6 = 0;
		
		НайденныеСтроки = ТЗРаздел6Графа4.НайтиСтроки(Новый Структура("КодКПК_ДатаОтчетности", Выборка.КПК.Код+"_"+Строка(Выборка.ДатаОкончанияОтчетногоПериода)));
		
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			Графы4Раздел6 =  НайденныеСтроки[0].Графа4;
		КонецЕсли;
		
		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_25_1 < Графы4Раздел6 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 25.1, должно быть больше или равно сумме значений, указанных во всех строках графы 4 раздела VI.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_25_1) +" < " + Строка(Графы4Раздел6);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 114 + КолДопКолонок, 1, 114 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 114 + КолДопКолонок, 1, 114 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_25_1_Раздел6Графа4 = Выборка.Раздел4_25_1 - Графы4Раздел6;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_25_1_Раздел6Графа4 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		
		// Строка 27 и разделу 10 по нулям   
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_27 <> СуммаСтрок2раздел10 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 27 должно быть равно сумме значений, указанных в графе 5 по строке 2 (2.1 – …) Раздела Х..";
			ОписаниеОшибки = Строка(Выборка.Раздел4_27) +" <> " + Строка(СуммаСтрок2раздел10);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 115 + КолДопКолонок, 1, 115 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 115 + КолДопКолонок, 1, 115 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_27_Раздел10 = Выборка.Раздел4_27 - СуммаСтрок2раздел10;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_27_Раздел10 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		// проверка по строке 27 и разделу 10 по нулям
		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_27 <> 0 И ЕстьНольВСтроках2Раздела10 = Истина Тогда
			ОписаниеУсловия= "Если в строке 27 указано значение, отличное от нуля, то и графе 5 строк 2.1 – … Раздела Х должно быть указано значение, отличное от нуля..";
			ОписаниеОшибки = "Строка 27 = " + Строка(Выборка.Раздел4_21) + ": " + Строка("Все строки 2 (2.1 – …) равны 0");
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 116 + КолДопКолонок, 1, 116 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 116 + КолДопКолонок, 1, 116 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_27_Раздел10_ПроверкаНаНоль = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;		
		
		
		
		//  строка 29 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_29 <> Выборка.Раздел4_29_1 + Выборка.Раздел4_29_2  + Выборка.Раздел4_29_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 29, должно быть равно сумме значений, указанных в строках 29.1, 29.2 и 29.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_29) +" <> " + Строка(Выборка.Раздел4_29_1 + Выборка.Раздел4_29_2 + Выборка.Раздел4_29_3);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 117 + КолДопКолонок, 1, 117 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 117 + КолДопКолонок, 1, 117 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_29_Сумма = Выборка.Раздел4_29 - Выборка.Раздел4_29_1 - Выборка.Раздел4_29_2 - Выборка.Раздел4_29_3;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_29_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 30 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_30 <> Выборка.Раздел4_30_1 + Выборка.Раздел4_30_2  + Выборка.Раздел4_30_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 30, должно быть равно сумме значений, указанных в строках 30.1, 30.2 и 30.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_30) +" <> " + Строка(Выборка.Раздел4_30_1 + Выборка.Раздел4_30_2 + Выборка.Раздел4_30_3);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 118 + КолДопКолонок, 1, 118 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 118 + КолДопКолонок, 1, 118 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_30_Сумма = Выборка.Раздел4_30 - Выборка.Раздел4_30_1 - Выборка.Раздел4_30_2 - Выборка.Раздел4_30_3;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_30_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		
		//  строка 30 и 31 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_30 <> 0 И  Выборка.Раздел4_31 = 0 Тогда
			ОписаниеУсловия= "Если в строке 30 указано значение, отличное от нуля, то и в строке 31 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_30) +" <> 0 И " + Строка(Выборка.Раздел4_31) + " = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 119 + КолДопКолонок, 1, 120 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 119 + КолДопКолонок, 1, 120 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_30 = Выборка.Раздел4_30 ;
		ОбластьСтрокаКС.Параметры.Раздел4_31 = Выборка.Раздел4_31 ;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_30_31 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 30.1 и 31.1 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_30_1 <> 0 И  Выборка.Раздел4_31_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 30.1 указано значение, отличное от нуля, то и в строке 31.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_30_1) +" <> 0 И " + Строка(Выборка.Раздел4_31_1) + " = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 121 + КолДопКолонок, 1, 122 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 121 + КолДопКолонок, 1, 122 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_30_1 = Выборка.Раздел4_30_1 ;
		ОбластьСтрокаКС.Параметры.Раздел4_31_1 = Выборка.Раздел4_31_1 ;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_30_1_31_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 30.2 и 31.2 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_30_2 <> 0 И  Выборка.Раздел4_31_2 = 0 Тогда
			ОписаниеУсловия= "Если в строке 30.2 указано значение, отличное от нуля, то и в строке 31.2 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_30_2) +" <> 0 И " + Строка(Выборка.Раздел4_31_2) + " = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 123 + КолДопКолонок, 1, 124 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 123 + КолДопКолонок, 1, 124 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_30_2 = Выборка.Раздел4_30_2 ;
		ОбластьСтрокаКС.Параметры.Раздел4_31_2 = Выборка.Раздел4_31_2 ;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_30_2_31_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 30.3 и 31.3 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_30_3 <> 0 И  Выборка.Раздел4_31_3 = 0 Тогда
			ОписаниеУсловия= "Если в строке 30.3 указано значение, отличное от нуля, то и в строке 31.3 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_30_3) +" <> 0 И " + Строка(Выборка.Раздел4_31_3) + " = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 125 + КолДопКолонок, 1, 126 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 125 + КолДопКолонок, 1, 126 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_30_3 = Выборка.Раздел4_30_3 ;
		ОбластьСтрокаКС.Параметры.Раздел4_31_3 = Выборка.Раздел4_31_3 ;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_30_3_31_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 31 и 30 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_31 <> 0 И  Выборка.Раздел4_30 = 0 Тогда
			ОписаниеУсловия= "Если в строке 31 указано значение, отличное от нуля, то и в строке 30 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_31) +" <> 0 И " + Строка(Выборка.Раздел4_30) + " = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 127 + КолДопКолонок, 1, 128 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 127 + КолДопКолонок, 1, 128 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_31_30 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 31.1 и 30.1 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_31_1 <> 0 И  Выборка.Раздел4_30_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 31.1 указано значение, отличное от нуля, то и в строке 30.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_31_1) +" <> 0 И " + Строка(Выборка.Раздел4_30_1) + " = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 129 + КолДопКолонок, 1, 130 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 129 + КолДопКолонок, 1, 130 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_31_1_30_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 31.2 и 30.2 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_31_2 <> 0 И  Выборка.Раздел4_30_2 = 0 Тогда
			ОписаниеУсловия= "Если в строке 31.2 указано значение, отличное от нуля, то и в строке 30.2 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_31_2) +" <> 0 И " + Строка(Выборка.Раздел4_30_2) + " = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 131 + КолДопКолонок, 1, 132 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 131 + КолДопКолонок, 1, 132 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_31_2_30_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 31.3 и 30.3 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_31_3 <> 0 И  Выборка.Раздел4_30_3 = 0 Тогда
			ОписаниеУсловия= "Если в строке 31.3 указано значение, отличное от нуля, то и в строке 30.3 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_31_3) +" <> 0 И " + Строка(Выборка.Раздел4_30_3) + " = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 133 + КолДопКолонок, 1, 134 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 133 + КолДопКолонок, 1, 134 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_31_3_30_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 31 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_31 <> Выборка.Раздел4_31_1 + Выборка.Раздел4_31_2  + Выборка.Раздел4_31_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 31, должно быть равно сумме значений, указанных в строках 31.1, 31.2 и 31.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_30) +" <> " + Строка(Выборка.Раздел4_30_1 + Выборка.Раздел4_30_2 + Выборка.Раздел4_30_3);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 135 + КолДопКолонок, 1, 135 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 135 + КолДопКолонок, 1, 135 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_31_Сумма = Выборка.Раздел4_31 - Выборка.Раздел4_31_1 - Выборка.Раздел4_31_2 - Выборка.Раздел4_31_3;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_31_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 32 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_32 <> Выборка.Раздел4_32_1 + Выборка.Раздел4_32_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 32, должно быть равно сумме значений, указанных в строках 32.1 и 32.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_32) +" <> " + Строка(Выборка.Раздел4_32_1 + Выборка.Раздел4_32_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 136 + КолДопКолонок, 1, 136 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 136 + КолДопКолонок, 1, 136 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_32_Сумма = Выборка.Раздел4_32 - Выборка.Раздел4_32_1 - Выборка.Раздел4_32_2 ;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_32_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 32 и 33 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_32 <> 0 И  Выборка.Раздел4_33 = 0 Тогда
			ОписаниеУсловия= "Если в строке 32 указано значение, отличное от нуля, то и в строке 33 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_32) +" <> 0 И " + Строка(Выборка.Раздел4_33) + " = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 137 + КолДопКолонок, 1, 138 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 137 + КолДопКолонок, 1, 138 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_32 = Выборка.Раздел4_32;
		ОбластьСтрокаКС.Параметры.Раздел4_33 = Выборка.Раздел4_33 ;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_32_33 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;  
		
		//  строка 33 и 32 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_33 <> 0 И  Выборка.Раздел4_32 = 0 Тогда
			ОписаниеУсловия= "Если в строке 33 указано значение, отличное от нуля, то и в строке 32 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_33) +" <> 0 И " + Строка(Выборка.Раздел4_32) + " = 0";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 139 + КолДопКолонок, 1, 140 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 139 + КолДопКолонок, 1, 140 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_33_32 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;    
		
		
		//  строка 35 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_35 <> Выборка.Раздел4_35_1 + Выборка.Раздел4_35_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 35, должно быть равно сумме значений, указанных в строках 35.1 и 35.2";
			ОписаниеОшибки = Строка(Выборка.Раздел4_35) +" <> " + Строка(Выборка.Раздел4_35_1 + Выборка.Раздел4_35_2);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 141 + КолДопКолонок, 1, 141 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 141 + КолДопКолонок, 1, 141 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_35_Сумма = Выборка.Раздел4_35 - Выборка.Раздел4_35_1 - Выборка.Раздел4_35_2 ;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_35_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 35.1 равна сумме граф 3-8 раздела 8 строка *.1
		
		СуммаГраф3_8 = 	СтруктураСтрок.Раздел8_1_1.Графа3 +СтруктураСтрок.Раздел8_2_1.Графа3 + СтруктураСтрок.Раздел8_3_1.Графа3 + СтруктураСтрок.Раздел8_4_1.Графа3 + СтруктураСтрок.Раздел8_5_1.Графа3 + СтруктураСтрок.Раздел8_6_1.Графа3 + СтруктураСтрок.Раздел8_7_1.Графа3  + СтруктураСтрок.Раздел8_8_1.Графа3 + СтруктураСтрок.Раздел8_9_1.Графа3;
		СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_1.Графа4 +СтруктураСтрок.Раздел8_2_1.Графа4 + СтруктураСтрок.Раздел8_3_1.Графа4 + СтруктураСтрок.Раздел8_4_1.Графа4 + СтруктураСтрок.Раздел8_5_1.Графа4 + СтруктураСтрок.Раздел8_6_1.Графа4 + СтруктураСтрок.Раздел8_7_1.Графа4  + СтруктураСтрок.Раздел8_8_1.Графа4 + СтруктураСтрок.Раздел8_9_1.Графа4;
		СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_1.Графа5 +СтруктураСтрок.Раздел8_2_1.Графа5 + СтруктураСтрок.Раздел8_3_1.Графа5 + СтруктураСтрок.Раздел8_4_1.Графа5 + СтруктураСтрок.Раздел8_5_1.Графа5 + СтруктураСтрок.Раздел8_6_1.Графа5 + СтруктураСтрок.Раздел8_7_1.Графа5  + СтруктураСтрок.Раздел8_8_1.Графа5 + СтруктураСтрок.Раздел8_9_1.Графа5;
		СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_1.Графа6 +СтруктураСтрок.Раздел8_2_1.Графа6 + СтруктураСтрок.Раздел8_3_1.Графа6 + СтруктураСтрок.Раздел8_4_1.Графа6 + СтруктураСтрок.Раздел8_5_1.Графа6 + СтруктураСтрок.Раздел8_6_1.Графа6 + СтруктураСтрок.Раздел8_7_1.Графа6  + СтруктураСтрок.Раздел8_8_1.Графа6 + СтруктураСтрок.Раздел8_9_1.Графа6;
		СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_1.Графа7 +СтруктураСтрок.Раздел8_2_1.Графа7 + СтруктураСтрок.Раздел8_3_1.Графа7 + СтруктураСтрок.Раздел8_4_1.Графа7 + СтруктураСтрок.Раздел8_5_1.Графа7 + СтруктураСтрок.Раздел8_6_1.Графа7 + СтруктураСтрок.Раздел8_7_1.Графа7  + СтруктураСтрок.Раздел8_8_1.Графа7 + СтруктураСтрок.Раздел8_9_1.Графа7;
		СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_1.Графа8 +СтруктураСтрок.Раздел8_2_1.Графа8 + СтруктураСтрок.Раздел8_3_1.Графа8 + СтруктураСтрок.Раздел8_4_1.Графа8 + СтруктураСтрок.Раздел8_5_1.Графа8 + СтруктураСтрок.Раздел8_6_1.Графа8 + СтруктураСтрок.Раздел8_7_1.Графа8  + СтруктураСтрок.Раздел8_8_1.Графа8 + СтруктураСтрок.Раздел8_9_1.Графа8;
		СуммаГраф3_8 = Окр(СуммаГраф3_8, 0);
		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_35_1 <> СуммаГраф3_8 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 35.1, должно быть равно сумме значений, указанных в графах 3 – 8 строк 1.1, 2.1, 3.1, 4.1, 5.1, 6.1, 7.1, 8.1 и 9.1 Раздела VIII.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_35_1) +" <> " + Строка(СуммаГраф3_8);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 142 + КолДопКолонок, 1, 142 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 142 + КолДопКолонок, 1, 142 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_35_1_Граф3_8 = Выборка.Раздел4_35_1 - СуммаГраф3_8;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_35_1_Граф3_8 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 35.2 равна сумме граф 3-8 раздела 8 строка *.2
		
		СуммаГраф3_8 = 	СтруктураСтрок.Раздел8_1_2.Графа3 +СтруктураСтрок.Раздел8_2_2.Графа3 + СтруктураСтрок.Раздел8_3_2.Графа3 + СтруктураСтрок.Раздел8_4_2.Графа3 + СтруктураСтрок.Раздел8_5_2.Графа3 + СтруктураСтрок.Раздел8_6_2.Графа3 + СтруктураСтрок.Раздел8_7_2.Графа3  + СтруктураСтрок.Раздел8_8_2.Графа3 + СтруктураСтрок.Раздел8_9_2.Графа3;
		СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_2.Графа4 +СтруктураСтрок.Раздел8_2_2.Графа4 + СтруктураСтрок.Раздел8_3_2.Графа4 + СтруктураСтрок.Раздел8_4_2.Графа4 + СтруктураСтрок.Раздел8_5_2.Графа4 + СтруктураСтрок.Раздел8_6_2.Графа4 + СтруктураСтрок.Раздел8_7_2.Графа4  + СтруктураСтрок.Раздел8_8_2.Графа4 + СтруктураСтрок.Раздел8_9_2.Графа4;
		СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_2.Графа5 +СтруктураСтрок.Раздел8_2_2.Графа5 + СтруктураСтрок.Раздел8_3_2.Графа5 + СтруктураСтрок.Раздел8_4_2.Графа5 + СтруктураСтрок.Раздел8_5_2.Графа5 + СтруктураСтрок.Раздел8_6_2.Графа5 + СтруктураСтрок.Раздел8_7_2.Графа5  + СтруктураСтрок.Раздел8_8_2.Графа5 + СтруктураСтрок.Раздел8_9_2.Графа5;
		СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_2.Графа6 +СтруктураСтрок.Раздел8_2_2.Графа6 + СтруктураСтрок.Раздел8_3_2.Графа6 + СтруктураСтрок.Раздел8_4_2.Графа6 + СтруктураСтрок.Раздел8_5_2.Графа6 + СтруктураСтрок.Раздел8_6_2.Графа6 + СтруктураСтрок.Раздел8_7_2.Графа6  + СтруктураСтрок.Раздел8_8_2.Графа6 + СтруктураСтрок.Раздел8_9_2.Графа6;
		СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_2.Графа7 +СтруктураСтрок.Раздел8_2_2.Графа7 + СтруктураСтрок.Раздел8_3_2.Графа7 + СтруктураСтрок.Раздел8_4_2.Графа7 + СтруктураСтрок.Раздел8_5_2.Графа7 + СтруктураСтрок.Раздел8_6_2.Графа7 + СтруктураСтрок.Раздел8_7_2.Графа7  + СтруктураСтрок.Раздел8_8_2.Графа7 + СтруктураСтрок.Раздел8_9_2.Графа7;
		СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_2.Графа8 +СтруктураСтрок.Раздел8_2_2.Графа8 + СтруктураСтрок.Раздел8_3_2.Графа8 + СтруктураСтрок.Раздел8_4_2.Графа8 + СтруктураСтрок.Раздел8_5_2.Графа8 + СтруктураСтрок.Раздел8_6_2.Графа8 + СтруктураСтрок.Раздел8_7_2.Графа8  + СтруктураСтрок.Раздел8_8_2.Графа8 + СтруктураСтрок.Раздел8_9_2.Графа8;
		СуммаГраф3_8 = Окр(СуммаГраф3_8, 0);
		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_35_2 <> СуммаГраф3_8 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 35.2, должно быть равно сумме значений, указанных в графах 3 – 8 строк 1.2, 2.2, 3.2, 4.2, 5.2, 6.2, 7.2, 8.2 и 9.2 Раздела VIII.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_35_2) +" <> " + Строка(СуммаГраф3_8);
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 143 + КолДопКолонок, 1, 143 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 143 + КолДопКолонок, 1, 143 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_35_2_Граф3_8 = Выборка.Раздел4_35_2 - СуммаГраф3_8;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_35_2_Граф3_8 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		
		ОбластьСтрокаКС.Параметры.ИтогоОшибокКС = ?(ИтогоОшибокКС = 0, "0", ИтогоОшибокКС);
		
		Если ИтогоОшибокКС > 0 Тогда
			ОбластьСтрокаКС.Область(1, 4 + КолДопКолонок, 1, 4 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;
		КонецЕсли;            
		
		РезультатКС.Вывести(ОбластьСтрокаКС); 	
		
	КонецЦикла;
	
 
	
	
	// 4. Нормативы
	
	НазваниеТаблицы = "Нормативы";
	// Табличный документ 

	РезультатНормативы.НачатьАвтогруппировкуСтрок(); 	
	
	
	Если ВидОтчета = 0 Тогда
		Макет =  Отчеты.СРО_ПроверкаОтчетностиСРассылкойПисем.ПолучитьМакет("МакетНормативы");
	Иначе
		Макет = Отчеты.СРО_ПроверкаОтчетностиСРассылкойПисем.ПолучитьМакет("МакетНормативыПериод");
	КонецЕсли;
	
	ОбластьШапкаПредставлениеПериода = Макет.получитьОбласть("ШапкаПредставлениеПериода");
	
	ОбластьШапкаПредставлениеПериода.Параметры.ПредставлениеПериода = ПредставлениеПериода(НачалоПериода, ОкончаниеПериода);
	РезультатНормативы.Вывести(ОбластьШапкаПредставлениеПериода);
	
	
	ШапкаПредельныеЗначения = Макет.ПолучитьОбласть("ШапкаПредельныеЗначения");
	РезультатНормативы.Вывести(ШапкаПредельныеЗначения, 1);
	
	ОбластьСтрокиПредельныеЗначения = Макет.ПолучитьОбласть("СтрокиПредельныеЗначения");
	РезультатНормативы.Вывести(ОбластьСтрокиПредельныеЗначения, 2);
	
	
	РезультатНормативы.ЗакончитьАвтогруппировкуСтрок();
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	РезультатНормативы.Вывести(ОбластьШапкаТаблицы, 2); 	
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	
	Выборка.Сбросить();	
	
	СтрокаЧетная = Ложь;
	
	НомерСтроки = 0;
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		Если ВыводитьТолькоКПКСОтчетностью И  НЕ Выборка.ЕстьДокумент Тогда
			Продолжить;			
		КонецЕсли;
		
		НомерСтроки = НомерСтроки +1;
		
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		
		ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
		ОбластьСтрока.Параметры.КраткоеНазваниеКПК = Выборка.КПК.НаименованиеКраткое;
		
		Если ВидОтчета = 1 Тогда
			ОбластьСтрока.Параметры.ПериодОтчетности = СРО_ЗагрузкаОтчетности.ПолучитьПредставлениеДатыотчета(Выборка.ДатаОкончанияОтчетногоПериода);
		КонецЕсли;
		
		
		Если СтрокаЧетная Тогда
			ЦветФонаСтроки = WebЦвета.ШелковыйОттенок;
		Иначе
			ЦветФонаСтроки = WebЦвета.Белый;
		КонецЕсли;
		
		СтрокаЧетная = ?(СтрокаЧетная, Ложь, Истина);  
		
		
		ОбластьСтрока.Область(1, 1, 2, 12 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;		
		
		// если нет документа отчетности, то пропускаем проверки
		
		Если НЕ Выборка.ЕстьДокумент Тогда
			РезультатНормативы.Вывести(ОбластьСтрока); 	 		
			Продолжить;
		КонецЕсли;
		
		// записываем расшгифровки
		
		Если Выборка.ДокументОтчетности = null Тогда   			
			ОбластьСтрока.Параметры.ДокументОтчетности  = "Нет документа";
			ОбластьСтрока.Область(1, 3, 1, 3).ЦветТекста = WebЦвета.Черный;				
		Иначе	
			ОбластьСтрока.Параметры.ДокументОтчетности  = Выборка.ДокументОтчетности;
			ОбластьСтрока.Область(1, 3, 1, 3).ЦветТекста =  WebЦвета.Синий;
		КонецЕсли;
		
		
		ОбластьСтрока.Параметры.РасшифровкаФН1 = Строка(Выборка.Раздел2_2_2) + " / (" + Строка(Выборка.Раздел2_3_1_1) + " + " + Строка(Выборка.Раздел2_3_1_2) + " + " + Строка(Выборка.Раздел2_3_2_1) + " + " + Строка(Выборка.Раздел2_3_2_2)+")*100";		
		ОбластьСтрока.Параметры.РасшифровкаФН2 = "(" + Строка(Выборка.Раздел4_20) +" - " + Строка(Выборка.Раздел4_21) +") / (" + Строка(Выборка.Раздел2_3_1_1) + " + " + Строка(Выборка.Раздел2_3_1_2) + " + " + Строка(Выборка.Раздел2_3_2_1) + " + " + Строка(Выборка.Раздел2_3_2_2)+")*100";
		ОбластьСтрока.Параметры.РасшифровкаФН3 = "(" + Строка(Выборка.Раздел4_26) +" - " + Строка(Выборка.Раздел4_27) +") / (" + Строка(Выборка.Раздел2_1_1) + " + " + Строка(Выборка.Раздел2_1_2) + " + " + Строка(Выборка.Раздел4_35_1) +")*100";
		ОбластьСтрока.Параметры.РасшифровкаФН4 = Строка(Выборка.Раздел2_2_1) + " / (" + Строка(Выборка.Раздел2_3_1_1) + " + " + Строка(Выборка.Раздел2_3_1_2) + " + " + Строка(Выборка.Раздел2_3_2_1) + " + " + Строка(Выборка.Раздел2_3_2_2)+")*100";
		ОбластьСтрока.Параметры.РасшифровкаФН5 = "(" + Строка(Выборка.Раздел2_3_1_3) +" + " + Строка(Выборка.Раздел2_3_2_3)+ ") / (" + Строка(Выборка.Раздел2_3_1_1) + " + " + Строка(Выборка.Раздел2_3_1_2) + " + " + Строка(Выборка.Раздел2_3_2_1) + " + " + Строка(Выборка.Раздел2_3_2_2)+")*100";
		ОбластьСтрока.Параметры.РасшифровкаФН6 = "(" + Строка(Выборка.Раздел2_1_1_3) +" + " + Строка(Выборка.Раздел2_1_2_3)+ ") / (" + Строка(Выборка.Раздел2_2_1) + " + " + Строка(Выборка.Раздел2_3_1) + " + " + Строка(Выборка.Раздел2_3_2)+")*100";
		ОбластьСтрока.Параметры.РасшифровкаФН7 = "(" + Строка(Выборка.Раздел2_1_1) +" + " + Строка(Выборка.Раздел2_1_2)+" + " + Строка(Выборка.Раздел2_1_3_2)+" + " + Строка(Выборка.Раздел2_1_4_2)+" + " +Строка(Выборка.Раздел2_1_12_1_1)+" + " + Строка(Выборка.Раздел2_1_12_2)+" + " + Строка(Выборка.Раздел2_1_12_3)+" + " + Строка(Выборка.Раздел2_1_12_4)+ ") / (" + Строка(Выборка.Раздел2_3_1) + " + " + Строка(Выборка.Раздел2_3_2) +")*100";
		ОбластьСтрока.Параметры.РасшифровкаФН8 = "(" + Строка(Выборка.Раздел2_1_1) +" + " + Строка(Выборка.Раздел2_1_3) +" + " + Строка(Выборка.Раздел2_1_8)+ ") / (" + Строка(Выборка.Раздел2_3_1) + " + " + Строка(Выборка.Раздел2_3_3)+")*100";
		
		// проверяем		
		// совпадение расчетного и показателя из файла
		Если Выборка.Раздел11_ФН1 <> Выборка.ФН1Расчетный Тогда 
			ОписаниеУсловия = "ФН1 не свпадает с расчетным";	
			ОбластьСтрока.Область(1, 4 + КолДопКолонок, 2, 4 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
			ОписаниеОшибки = "ФН1 (" + Строка(Выборка.Раздел11_ФН1) + ") <> ФН1 расч. (" + Строка(Выборка.ФН1Расчетный)+")";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе
			//	ОбластьСтрока.Область(1, 4 + КолДопКолонок, 2, 4 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
		КонецЕсли;
		
		Если Выборка.Раздел11_ФН2 <> Выборка.ФН2Расчетный Тогда 
			ОписаниеУсловия = "ФН2 не свпадает с расчетным";	
			ОбластьСтрока.Область(1, 5 + КолДопКолонок, 2, 5 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;     			
			ОписаниеОшибки = "ФН2 (" + Строка(Выборка.Раздел11_ФН2) + ") <> ФН2 расч. (" + Строка(Выборка.ФН2Расчетный)+")";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе
			//	ОбластьСтрока.Область(1, 5 + КолДопКолонок, 2, 5 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
		КонецЕсли;
		
		Если Выборка.Раздел11_ФН3 <> Выборка.ФН3Расчетный Тогда 
			ОписаниеУсловия = "ФН3 не свпадает с расчетным";	
			ОбластьСтрока.Область(1, 6 + КолДопКолонок, 2, 6 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;     			
			ОписаниеОшибки = "ФН3 (" + Строка(Выборка.Раздел11_ФН3) + ") <> ФН3 расч. (" + Строка(Выборка.ФН3Расчетный)+")";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе
			//	ОбластьСтрока.Область(1, 6 + КолДопКолонок, 2, 6 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
		КонецЕсли;
		
		Если Выборка.Раздел11_ФН4 <> Выборка.ФН4Расчетный Тогда 
			ОписаниеУсловия = "ФН4 не свпадает с расчетным";	
			ОбластьСтрока.Область(1, 7 + КолДопКолонок, 2, 7 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;     			
			ОписаниеОшибки = "ФН4 (" + Строка(Выборка.Раздел11_ФН4) + ") <> ФН4 расч. (" + Строка(Выборка.ФН4Расчетный)+")";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе
			//	ОбластьСтрока.Область(1, 7 + КолДопКолонок, 2, 7 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
		КонецЕсли;
		
		Если Выборка.Раздел11_ФН5 <> Выборка.ФН5Расчетный Тогда 
			ОписаниеУсловия = "ФН5 не свпадает с расчетным";	
			ОбластьСтрока.Область(1, 8 + КолДопКолонок, 2, 8 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;     			
			ОписаниеОшибки = "ФН5 (" + Строка(Выборка.Раздел11_ФН5) + ") <> ФН5 расч. (" + Строка(Выборка.ФН5Расчетный)+")";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе
			//	ОбластьСтрока.Область(1, 8 + КолДопКолонок, 2, 8 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
		КонецЕсли;
		
		Если Выборка.Раздел11_ФН6 <> Выборка.ФН6Расчетный Тогда 
			ОписаниеУсловия = "ФН6 не свпадает с расчетным";	
			ОбластьСтрока.Область(1, 9 + КолДопКолонок, 2, 9 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;     			
			ОписаниеОшибки = "ФН6 (" + Строка(Выборка.Раздел11_ФН6) + ") <> ФН6 расч. (" + Строка(Выборка.ФН6Расчетный)+")";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе
			//	ОбластьСтрока.Область(1, 9 + КолДопКолонок, 2, 9 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
		КонецЕсли;
		
		Если Выборка.Раздел11_ФН7 <> Выборка.ФН7Расчетный Тогда 
			ОписаниеУсловия = "ФН7 не свпадает с расчетным";	
			ОбластьСтрока.Область(1, 10 + КолДопКолонок, 2, 10 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;     			
			ОписаниеОшибки = "ФН7 (" + Строка(Выборка.Раздел11_ФН7) + ") <> ФН7 расч. (" + Строка(Выборка.ФН7Расчетный)+")";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе
			//	ОбластьСтрока.Область(1, 10 + КолДопКолонок, 2, 10 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
		КонецЕсли;
		
		Если Выборка.Раздел11_ФН8 <> Выборка.ФН8Расчетный Тогда 
			ОписаниеУсловия = "ФН8 не свпадает с расчетным";	
			ОбластьСтрока.Область(1, 11 + КолДопКолонок, 2, 11 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;     			
			ОписаниеОшибки = "ФН8 (" + Строка(Выборка.Раздел11_ФН8) + ") <> ФН8 расч. (" + Строка(Выборка.ФН8Расчетный)+")";
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе
			//	ОбластьСтрока.Область(1, 11 + КолДопКолонок, 2, 11 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
		КонецЕсли;
		
		// сравниваем расчетные с показателями по нормативам
		
		
		
		Если Выборка.Раздел4_11 <= 100 Тогда
			ФН1ПредельноеЗначение = 2;			
			ФН2ПредельноеЗначение = 50;
			ФН3ПредельноеЗначение = 50;
			
			ФН6ПредельноеЗначение = 25;
			
		ИначеЕсли Выборка.Раздел4_11 <= 200 Тогда
			ФН1ПредельноеЗначение = 4;
			ФН2ПредельноеЗначение = 25;
			ФН3ПредельноеЗначение = 20;
			
			ФН6ПредельноеЗначение = 15;
			
			
		ИначеЕсли Выборка.Раздел4_11 <= 3000 Тогда
			ФН1ПредельноеЗначение = 5;
			ФН2ПредельноеЗначение = 20;
			ФН3ПредельноеЗначение = 10;
			
			ФН6ПредельноеЗначение = 10;
			
		Иначе
			ФН1ПредельноеЗначение = 5;		
			ФН2ПредельноеЗначение = 15;
			ФН3ПредельноеЗначение = 7;
			
			ФН6ПредельноеЗначение = 25;			
			
		КонецЕсли;
		
		ФН4ПредельноеЗначение = 6;
		ФН5ПредельноеЗначение = 50;
		
		ФН7ПредельноеЗначение = 70;
		ФН8ПредельноеЗначение = 75;
		
		ОписаниеУловие = "";
		
		
		Если Выборка.ФН1Расчетный < ФН1ПредельноеЗначение Тогда
			ОписаниеУсловия = "Значение ФН1 (расчетное) меньше передельного значения";
			ОбластьСтрока.Область(2, 4 + КолДопКолонок, 2, 4 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
			ОписаниеОшибки = "Значение ФН1 (расчетное) = " + Строка(Выборка.ФН1Расчетный) + " меньше предельного значения " + Строка(ФН1ПредельноеЗначение);			
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
		КонецЕсли;	
		
		// проверяем ФН2 по условию в шапке
		Если Выборка.Раздел2_3_1 + Выборка.Раздел2_3_2 > 0 И Выборка.ФН2Расчетный = 0 Тогда
			ОписаниеУсловия = "";   
			ОбластьСтрока.Область(2, 5 + КолДопКолонок, 2, 5 + КолДопКолонок).ЦветТекста = WebЦвета.Красный;			
			ОписаниеОшибки = "Значение ФН2 (расчетное) = 0, но 3.1 + 3.2 = " + Строка(Выборка.Раздел2_3_1 + Выборка.Раздел2_3_2);			
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		
		КонецЕсли;
		
		
		Если Выборка.ФН2Расчетный > ФН2ПредельноеЗначение Тогда
			ОписаниеУсловия = "Значение ФН2 (расчетное) больше передельного значения";
			ОбластьСтрока.Область(2, 5 + КолДопКолонок, 2, 5 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
			ОписаниеОшибки = "Значение ФН2 (расчетное) = " + Строка(Выборка.ФН2Расчетный) + " больше предельного значения " + Строка(ФН2ПредельноеЗначение);			
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
		КонецЕсли;			
		
		// проверяем Фн3 по условию в шапке
		Если Выборка.Раздел2_1_1 + Выборка.Раздел2_1_2 > 0 И Выборка.ФН3Расчетный = 0 Тогда
			ОписаниеУсловия = "";
			ОбластьСтрока.Область(2, 6 + КолДопКолонок, 2, 6 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
			ОписаниеОшибки = "Значение ФН3 (расчетное) = 0, но 1.1 + 1.2 = " + Строка(Выборка.Раздел2_1_1 + Выборка.Раздел2_1_2);			
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    								
		КонецЕсли;
		
		Если Выборка.ФН3Расчетный > ФН3ПредельноеЗначение Тогда
			ОписаниеУсловия = "Значение ФН3 (расчетное) больше передельного значения";      
			
			ОбластьСтрока.Область(2, 6 + КолДопКолонок, 2, 6 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
			ОписаниеОшибки = "Значение ФН3 (расчетное) = " + Строка(Выборка.ФН3Расчетный) + " больше предельного значения " + Строка(ФН3ПредельноеЗначение);			
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе	
			//	ОбластьСтрока.Область(1, 6, 1, 6).ЦветФона =ЦветФонаСтроки;     
		КонецЕсли;	
		
		Если Выборка.ФН4Расчетный < ФН4ПредельноеЗначение Тогда	
			ОписаниеУсловия = "Значение ФН4 (расчетное) меньше передельного значения";
			
			ОбластьСтрока.Область(2, 7 + КолДопКолонок, 2, 7 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
			ОписаниеОшибки = "Значение ФН4 (расчетное) = " + Строка(Выборка.ФН4Расчетный) + " меньше предельного значения " + Строка(ФН4ПредельноеЗначение);			
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе	
			//	ОбластьСтрока.Область(1, 7, 1, 7).ЦветФона =ЦветФонаСтроки;   
		КонецЕсли;	
		
		Если Выборка.ФН5Расчетный > ФН5ПредельноеЗначение Тогда		
			ОписаниеУсловия = "Значение ФН5 (расчетное) больше передельного значения";
			
			ОбластьСтрока.Область(2, 8 + КолДопКолонок, 2, 8 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
			ОписаниеОшибки = "Значение ФН5 (расчетное) = " + Строка(Выборка.ФН5Расчетный) + " больше предельного значения " + Строка(ФН5ПредельноеЗначение);			
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе	
			//	ОбластьСтрока.Область(1, 8, 1, 8).ЦветФона =ЦветФонаСтроки;  
		КонецЕсли;	
		
		Если Выборка.ФН6Расчетный > ФН6ПредельноеЗначение Тогда 
			ОписаниеУсловия = "Значение ФН6 (расчетное) больше передельного значения";
			
			ОбластьСтрока.Область(2, 9 + КолДопКолонок, 2, 9 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
			ОписаниеОшибки = "Значение ФН6 (расчетное) = " + Строка(Выборка.ФН6Расчетный) + " больше предельного значения " + Строка(ФН6ПредельноеЗначение);			
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе	
			//	ОбластьСтрока.Область(1, 9, 1, 9).ЦветФона =ЦветФонаСтроки;   
		КонецЕсли;	 		
		
		Если Выборка.ФН7Расчетный < ФН7ПредельноеЗначение Тогда	
			ОписаниеУсловия = "Значение ФН7 (расчетное) меньше передельного значения";
			
			ОбластьСтрока.Область(2, 10 + КолДопКолонок, 2, 10 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
			ОписаниеОшибки = "Значение ФН7 (расчетное) = " + Строка(Выборка.ФН7Расчетный) + " меньше предельного значения " + Строка(ФН7ПредельноеЗначение);			
			ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе	
			//	ОбластьСтрока.Область(1, 10, 1, 10).ЦветФона =ЦветФонаСтроки;   
		КонецЕсли;	
		
		
		Если Выборка.ФН8Расчетный < ФН8ПредельноеЗначение Тогда	
			ОписаниеУсловия = "Значение ФН8 (расчетное) меньше передельного значения";
			
			ОбластьСтрока.Область(2, 11 + КолДопКолонок, 2, 11 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;		
			ОписаниеОшибки = "Значение ФН8 (расчетное) = " + Строка(Выборка.ФН8Расчетный) + " меньше предельного значения " + Строка(ФН8ПредельноеЗначение);			
			//ДобавитьОшибкуВТаблицу(ТаблицаОшибок, НомерСтроки, Выборка.КПК, ОписаниеОшибки);  			
		Иначе	
			ОбластьСтрока.Область(2, 11, 2, 11).ЦветФона =ЦветФонаСтроки;
		КонецЕсли;	
		
		
		РезультатНормативы.Вывести(ОбластьСтрока);  
		
	КонецЦикла;
	
	
	

	РезультатКС.ФиксацияСверху = 4;
	РезультатКС.ФиксацияСлева = 4;    

	РезультатНадзорныеСоотношения.ФиксацияСверху = 3;
	РезультатНадзорныеСоотношения.ФиксацияСлева = 4;   	

	
	РезультатНормативы.ФиксацияСверху = 9;
	РезультатНормативы.ФиксацияСлева = 3; 
		
	
	СтруктураТабличныхДокументов.Вставить("РезультатКС", РезультатКС);
	СтруктураТабличныхДокументов.Вставить("РезультатНадзорныеСоотношения", РезультатНадзорныеСоотношения);
	СтруктураТабличныхДокументов.Вставить("РезультатНормативы", РезультатНормативы);


	Возврат СтруктураТабличныхДокументов;

	//	
КонецФункции

&НаСервере
Функция СформироватьНаСервере_От4кв2018(СтруктураПараметровОтчета, ТабличныйДокумент)  	
	
	ДатаОкончанияОтчетногоПериода = КонецКвартала(СтруктураПараметровОтчета.ДатаОкончанияОтчета);
	
	МассивКПК = СтруктураПараметровОтчета.МассивКПК;
	НеВыводим_ОКУД0420820 = Ложь;
	
	Если НачалоГода(ДатаОкончанияОтчетногоПериода) = НачалоКвартала(ДатаОкончанияОтчетногоПериода) Тогда		
		// 1 квартала не выводим эту ппроверку
		НеВыводим_ОКУД0420820 = Истина;
	КонецЕсли;
	
	Если НЕ СтруктураПараметровОтчета.Свойство("ОтчетностьСРО") Тогда
		СтруктураПараметровОтчета.Вставить("ОтчетностьСРО", Неопределено);  		
	КонецЕсли; 	
	
	Если НЕ СтруктураПараметровОтчета.Свойство("ПредварительнаяПроверка") Тогда
		СтруктураПараметровОтчета.Вставить("ПредварительнаяПроверка", Ложь);  		
	КонецЕсли;     
	
	ВидОтчета = 0;
	
	Если МассивКПК.Количество() > 0 Тогда     		
		ВидОтчета = 1;                        		
	КонецЕсли;	
	
	Если НачалоДня(СтруктураПараметровОтчета.ДатаОкончанияОтчета) >= Дата(2021,10, 1) Тогда        
	    ОтборПоКодуДокумента = 2;
	ИначеЕсли НачалоДня(СтруктураПараметровОтчета.ДатаОкончанияОтчета) >= Дата(2020,4, 1) Тогда
		ОтборПоКодуДокумента = 1;
	Иначе	
		ОтборПоКодуДокумента = 0;
	КонецЕсли;      	
	
	Если СтруктураПараметровОтчета.Свойство("ТаблицаОшибок") Тогда   		
		ТаблицаОшибок = СтруктураПараметровОтчета.ТаблицаОшибок;
	Иначе
		ТаблицаОшибок = СРО_ЗагрузкаОтчетности.ИнициализироватьТаблицуОшибок();	
	КонецЕсли;         
	
	Если НЕ СтруктураПараметровОтчета.Свойство("ОтчетВЦБ") Тогда   		
		СтруктураПараметровОтчета.Вставить("ОтчетВЦБ", Ложь);  		
	КонецЕсли;     
	
	Если НЕ СтруктураПараметровОтчета.Свойство("ВыводитьТолькоКПКСОтчетностью") Тогда   		
		СтруктураПараметровОтчета.Вставить("ВыводитьТолькоКПКСОтчетностью", Истина);  		
	КонецЕсли;     
	
	СтруктураПараметров  = Новый Структура();
	
	СтруктураПараметров.Вставить("ДатаНачалаОтчета", СтруктураПараметровОтчета.ДатаНачалаОтчета);
	СтруктураПараметров.Вставить("ДатаОкончанияОтчета", СтруктураПараметровОтчета.ДатаОкончанияОтчета);
	СтруктураПараметров.Вставить("ОтчетностьСРО", СтруктураПараметровОтчета.ОтчетностьСРО);
	СтруктураПараметров.Вставить("ПредварительнаяПроверка", СтруктураПараметровОтчета.ПредварительнаяПроверка);
	////СтруктураПараметров.Вставить("Макет", Новый ТабличныйДокумент);
	СтруктураПараметров.Вставить("ВидОтчета", ВидОтчета);
	СтруктураПараметров.Вставить("ВыводитьТолькоКПКСОтчетностью", СтруктураПараметровОтчета.ВыводитьТолькоКПКСОтчетностью);
	СтруктураПараметров.Вставить("МассивКПК", СтруктураПараметровОтчета.МассивКПК);
	СтруктураПараметров.Вставить("ТекстОшибокПредварительнаяПроверка", "");
	СтруктураПараметров.Вставить("ТипОтчета", Перечисления.ТипыОчетаПроверки.ПоРазделам);  ///////////////////////////-*-----------------------
	СтруктураПараметров.Вставить("ТаблицаОшибок", ТаблицаОшибок);  	
	
	СтруктураПараметров.Вставить("ВыводимШапкуТаблиц", Истина); 
	СтруктураПараметров.Вставить("ВыводимШапкуНормативов", Истина);   
	
	СтруктураПараметров.Вставить("ОтчетВЦБ", СтруктураПараметровОтчета.ОтчетВЦБ);
	
	Если СтруктураПараметровОтчета.Свойство("ФормированиеОтчетаПользователю") Тогда
		СтруктураПараметров.Вставить("ФормированиеОтчетаПользователю", СтруктураПараметровОтчета.ФормированиеОтчетаПользователю); 
	Иначе	
		СтруктураПараметров.Вставить("ФормированиеОтчетаПользователю", Ложь); 
		
	КонецЕсли;     
	
	ИДФайлаПочтовогоСообщения = "";
	
	Если СтруктураПараметровОтчета.Свойство("ИдентификаторСообщения") Тогда
		ИДФайлаПочтовогоСообщения = СтруктураПараметровОтчета.ИдентификаторСообщения;
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ИДФайлаПочтовогоСообщения", ИДФайлаПочтовогоСообщения);     	
	СтруктураПараметров.Вставить("ТабличныйДокумент", Новый ТабличныйДокумент);
	СтруктураПараметров.Вставить("РезультатНадзорныеСоотношения", Новый ТабличныйДокумент);
	СтруктураПараметров.Вставить("РезультатКС", Новый ТабличныйДокумент);
	СтруктураПараметров.Вставить("РезультатНормативы", Новый ТабличныйДокумент);  
	
	СтруктураПараметров.Вставить("ДатаНачалаПериода", СтруктураПараметров.ДатаНачалаОтчета);  
	СтруктураПараметров.Вставить("ДатаОкончанияПериода", ДатаОкончанияОтчетногоПериода);  
	
	СтруктураПараметров.Вставить("ТаблицаНормативовРасшифровка", Неопределено);
	
	ТаблицаНФ_Расшифровка = Новый ТаблицаЗначений;
	ТаблицаНФ_Расшифровка.Колонки.Добавить("КПК");
	ТаблицаНФ_Расшифровка.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	ТаблицаНФ_Расшифровка.Колонки.Добавить("ФормулаРасчета");
	ТаблицаНФ_Расшифровка.Колонки.Добавить("ЧислительФН", Новый ОписаниеТипов("Число"));
	ТаблицаНФ_Расшифровка.Колонки.Добавить("ЗнаменательФН", Новый ОписаниеТипов("Число"));
	ТаблицаНФ_Расшифровка.Колонки.Добавить("ЗначениеФН", Новый ОписаниеТипов("Число")); 
		
//	СтруктураПараметров.Вставить("ТаблицаНФ_Расшифровка", ТаблицаНФ_Расшифровка);
	
	Если ВидОтчета = 1 Тогда  		
		
		ТаблицаДокументов = СРО_ЗагрузкаОтчетности.ПолучитьТаблицуДокументов(СтруктураПараметров);      		
		
		ТаблицаКодовДокументов = ТаблицаДокументов.Скопировать();     		
		
		ТаблицаКодовДокументов.Свернуть("КодДокумента");
		ТаблицаКодовДокументов.Сортировать("КодДокумента");		
		
		Для Каждого СтрокаТаблицы ИЗ ТаблицаКодовДокументов Цикл
			//СтруктураПараметров.ВыводимШапкуНормативов = СтруктураПараметров.ВыводимШапкуНормативов = Неопределено;			
			
			НайденныеСтроки = ТаблицаДокументов.НайтиСтроки(Новый Структура("КодДокумента", СтрокаТаблицы.КодДокумента));
			
			Для Каждого СтрокаТаблицы ИЗ НайденныеСтроки Цикл
				
				Если СтруктураПараметров.Свойство("ОтчетностьСРО") Тогда
					СтруктураПараметров.ОтчетностьСРО = СтрокаТаблицы.ДокументОтчетности;
				Иначе
					СтруктураПараметров.Вставить("ОтчетностьСРО", СтрокаТаблицы.ДокументОтчетности);				
				КонецЕсли;                                                                          				
				
				СтруктураПараметров.ДатаНачалаОтчета = НачалоДня(НачалоКвартала(СтрокаТаблицы.ДокументОтчетности.ДатаОкончанияОтчетногоПериода)); 				
				СтруктураПараметров.ДатаОкончанияОтчета = КонецКвартала(СтрокаТаблицы.ДокументОтчетности.ДатаОкончанияОтчетногоПериода);   				
				
				
				Если СтрокаТаблицы.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_2164
					ИЛИ СтрокаТаблицы.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21641
					ИЛИ СтрокаТаблицы.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21642
					ИЛИ СтрокаТаблицы.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21644 Тогда
					СтруктураТабличныхДокументов = СРО_ЗагрузкаОтчетности.СформироватьТабличныйДокументОтчетности_2_16_4(СтруктураПараметров);
					
				ИначеЕсли СтрокаТаблицы.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 
					ИЛИ СтрокаТаблицы.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634  Тогда
					СтруктураТабличныхДокументов = СРО_ЗагрузкаОтчетности.СформироватьТабличныйДокументОтчетности_2_16_3_3(СтруктураПараметров);
					
				Иначе
					СтруктураТабличныхДокументов = СРО_ЗагрузкаОтчетности.СформироватьТабличныйДокументОтчетности(СтруктураПараметров);
				КонецЕсли;				
				
			КонецЦикла;
		КонецЦикла;     
		
	Иначе        		
		
		Если ОтборПоКодуДокумента = 0 Тогда 
			СтруктураТабличныхДокументов = СРО_ЗагрузкаОтчетности.СформироватьТабличныйДокументОтчетности(СтруктураПараметров);
		ИначеЕсли ОтборПоКодуДокумента = 1 Тогда  
			СтруктураТабличныхДокументов = СРО_ЗагрузкаОтчетности.СформироватьТабличныйДокументОтчетности_2_16_3_3(СтруктураПараметров);
		ИначеЕсли ОтборПоКодуДокумента = 2 Тогда  
			СтруктураТабличныхДокументов = СРО_ЗагрузкаОтчетности.СформироватьТабличныйДокументОтчетности_2_16_4(СтруктураПараметров);  	
		КонецЕсли;
	КонецЕсли;     

	
	МассивДокументов = Новый Массив;
	
	// Выводим таблицу расшифровки норматиово
	
	// Получить таблицу основных периодов
	ТаблицаПериодов = Новый ТаблицаЗначений;
	ТаблицаПериодов.Колонки.Добавить("ОтчетныйПериод", Новый ОписаниеТипов("Дата"));  	
	
	ТекПериод = НачалоДня(КонецКвартала(СтруктураПараметров.ДатаНачалаПериода));
	
	Пока ТекПериод <= НачалоДня(СтруктураПараметров.ДатаОкончанияПериода) Цикл   		
		НоваяСтрока = ТаблицаПериодов.Добавить();
		НоваяСтрока.ОтчетныйПериод = ТекПериод;    
		
		ВремДата = НачалоМесяца(ТекПериод);  		
		ТекПериод =  НачалоДня(КонецКвартала(ДобавитьМесяц(ВремДата, 3)));       		
	КонецЦикла;	
	
	ТаблицаПериодов.Сортировать("ОтчетныйПериод Убыв");
		
	ТабДокФН_Расшифровка = СРО_ЗагрузкаОтчетности.СформироватьТаблицуРасшифровки(СтруктураПараметров.ТаблицаНормативовРасшифровка, ТаблицаПериодов);	
	СтруктураТабличныхДокументов.Вставить("ТабДокФН_Расшифровка", ТабДокФН_Расшифровка);                                                            
	
	//
	//// Добавляем подвал
	//ТабДокФН_Расшифровка = СтруктураТабличныхДокументов.ТабДокФН_Расшифровка;	
	//СРО_ЗагрузкаОтчетности.ДобавитьПодвалВФН_Расшифровка(ТабДокФН_Расшифровка);   	
	//ТабДокФН_Расшифровка.ЗакончитьАвтогруппировкуСтрок();

	//СтруктураТабличныхДокументов.ТабДокФН_Расшифровка = ТабДокФН_Расшифровка; 
	
	МассивДокументов.Добавить(СтруктураТабличныхДокументов);
	
	Возврат МассивДокументов;     	

КонецФункции  


#КонецОбласти	


#Область СводныйОтчет
Функция СформироватьНаСервере_Сводный(СтруктураПараметров)
	
	
	Если НЕ СтруктураПараметров.Свойство("ОтборПоКодуДокумента") Тогда
		СтруктураПараметров.Вставить("ОтборПоКодуДокумента", 1);
	КонецЕсли;
	
	ОтборПоКодуДокумента = СтруктураПараметров.ОтборПоКодуДокумента;
	ВидКодовТриггеров    = СтруктураПараметров.ВидКодовТриггеров;
	
	Если ОтборПоКодуДокумента = 0 Тогда 
		СтруктураТабличныхДокументов = СРО_ЗагрузкаОтчетности.СформироватьТабличныйДокументОтчетности(СтруктураПараметров);
	ИначеЕсли ОтборПоКодуДокумента = 1 Тогда  
		Если ВидКодовТриггеров  = 0 Тогда 
			СтруктураТабличныхДокументов = СРО_ЗагрузкаОтчетности.СформироватьТабличныйДокументОтчетности_2_16_3_3(СтруктураПараметров);
		ИначеЕсли ВидКодовТриггеров  = 1 Тогда 
			СтруктураТабличныхДокументов = СРО_ЗагрузкаОтчетности.СформироватьТабличныйДокументОтчетности_2_16_3_3_3кв2021_НовыеКоды(СтруктураПараметров);  			
		КонецЕсли;		
	ИначеЕсли ОтборПоКодуДокумента = 2 Тогда 		
		СтруктураТабличныхДокументов = СРО_ЗагрузкаОтчетности.СформироватьТабличныйДокументОтчетности_2_16_4(СтруктураПараметров);  					
	КонецЕсли;
	
	МассивДокументов = Новый Массив;  
	МассивДокументов.Добавить(СтруктураТабличныхДокументов);
	
	Возврат МассивДокументов;     	

КонецФункции
#КонецОбласти	