Функция ПолучитьПредставлениеКонстактноИнформации(ОбъектСсылка, ТипКонтактнойИнформации, ВидКонтактнойИнформации) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтрагентыКонтактнаяИнформация.Представление КАК Представление
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка = &ОбъектСсылка
	|	И КонтрагентыКонтактнаяИнформация.Тип = &Тип
	|	И КонтрагентыКонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("ОбъектСсылка", ОбъектСсылка);
	Запрос.УстановитьПараметр("Тип", ТипКонтактнойИнформации);
	Запрос.УстановитьПараметр("Вид", ВидКонтактнойИнформации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат СокрЛП(Выборка.Представление);	
	
КонецФункции


Функция ДополнитьСтроку(ВыбСтрока, Символ, КоличествоСимволов, Слева = Ложь) Экспорт

	ВремСтрока = СокРЛП(ВыбСтрока);
	ДлинаВыбСтроки = СтрДлина(ВремСтрока);
	
	КолСимволовДобавить = Макс(КоличествоСимволов - ДлинаВыбСтроки, 0);
	
	Если КолСимволовДобавить > 0 Тогда
		для Сч = 1 По КолСимволовДобавить Цикл
			Если Слева Тогда
				ВремСтрока = Строка(Символ) + ВремСтрока;				
			Иначе
				ВремСтрока = ВремСтрока + Строка(Символ);				
			КонецЕсли;			
		КонецЦикла; 		
	КонецЕсли;
	
	Возврат ВремСтрока;
	
КонецФункции
