
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Организация =  Константы.ОсновнаяОрганизация.Получить();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим) 
	
	Движения.СРО_ПоказателиДокумента.Записывать = Истина;
	Движения.СРО_ПоказателиДокумента.Очистить();
	Движения.СРО_ПоказателиДокумента.Записать();

	// регистр СРО_ПоказателиДокумента
	Движения.СРО_ПоказателиДокумента.Записывать = Истина;
	Для Каждого ТекСтрокаТаблицаПоказателей Из ТаблицаПоказателей Цикл
		Движение = Движения.СРО_ПоказателиДокумента.Добавить();
		Движение.ПредставлениеДокументаОтчетности = Строка(Ссылка);		
		Движение.Регистратор = Ссылка;
		Движение.ДатаПериода = ДатаОкончанияОтчетногоПериода;
		Движение.КПК = КПК;    
		Движение.Раздел = ТекСтрокаТаблицаПоказателей.Раздел;
		Движение.Показатель1 = ТекСтрокаТаблицаПоказателей.Показатель1;
		Движение.Показатель2 = ТекСтрокаТаблицаПоказателей.Показатель2;
		Движение.Показатель3 = ТекСтрокаТаблицаПоказателей.Показатель3;
		Движение.Показатель4 = ТекСтрокаТаблицаПоказателей.Показатель4;
		Движение.Показатель5 = ТекСтрокаТаблицаПоказателей.Показатель5;
		Движение.Показатель6 = ТекСтрокаТаблицаПоказателей.Показатель6;
		Движение.ПорядокСортировки = ТекСтрокаТаблицаПоказателей.ПорядокСортировки;
	КонецЦикла;


КонецПроцедуры
