
&НаСервере
Процедура ЗаполнитьКодыОтчетовНаСервере(КоличествоОтчетовВМесяц)	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СРО_КодыОтчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СРО_КодыОтчетов КАК СРО_КодыОтчетов
	|ГДЕ
	|	СРО_КодыОтчетов.Активный
	|	И НЕ СРО_КодыОтчетов.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	СРО_КодыОтчетов.Код";
	
	
	ДоступныеОтчетыДляРассылки = Объект.ДоступныеОтчетыДляРассылки;
	ДоступныеОтчетыДляРассылки.Очистить();
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ДоступныеОтчетыДляРассылки.Добавить();
		НоваяСтрока.КодОтчетности = Выборка.Ссылка;
		НоваяСтрока.КоличествоОтчетовВМесяц = КоличествоОтчетовВМесяц;     		
	КонецЦикла;           	

КонецПроцедуры // ЗаполнитьКодыОтчетовНаСервере()


&НаКлиенте
Процедура ОповещениеОкончанияВводаЧисла(ВыбранноеЧисло, ДополнительныеПараметры) Экспорт	
	
	ЗаполнитьКодыОтчетовНаСервере(ВыбранноеЧисло);   
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьКодыОтчетов(Команда)
	
	ОповещениеОкончанияВводаЧисла = Новый ОписаниеОповещения("ОповещениеОкончанияВводаЧисла", ЭтотОбъект);    
		
	КоличествоОтчетовВМесяц = 0;       
		
	ПоказатьВводЧисла(ОповещениеОкончанияВводаЧисла, КоличествоОтчетовВМесяц, "Введите количество отчетов в месяц. Если ограничений на количество отчетов нет, введите 0", 10, 0);
	
КонецПроцедуры
