//Функция ПолучитьТабличный

Функция СформироватьТабличныеДокументы(СтруктураПараметров) Экспорт
	
	ДатаНачалаОтчета = СтруктураПараметров.ДатаНачалаОтчета;
	ДатаОкончанияОтчета = СтруктураПараметров.ДатаОкончанияОтчета;

	МассивКПК = СтруктураПараметров.МассивКПК;    
	
	КПК = Справочники.Контрагенты.ПустаяСсылка();
	
	Если МассивКПК.Количество() > 0 Тогда
		КПК = МассивКПК[0]; 
		
		СтруктураПараметров.Вставить("КПК", КПК);
	КонецЕсли;	
	
	Если ТипЗнч(КПК) = Тип("Строка") Тогда
		Возврат КПК;
	КонецЕсли;		
		
	// заполняем заголовок и шапку
	ТабДокумент = Новый ТабличныйДокумент;        	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Макет = Отчеты.СРО_ТаблицаФинансовыхПоказателейКПК.ПолучитьМакет("Макет"); 	
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");   
	
	ТекстЗаголовка = "Финансовые показатели деятельности " + СокрЛП(КПК.НаименованиеКраткое) + " соответствуют требованиям Федерального закона № 190-ФЗ";
	ОбластьЗаголовок.Параметры.ТекстЗаголовка = ТекстЗаголовка;	
	ТабДокумент.Вывести(ОбластьЗаголовок); 	
	
	ОбластьШапкаОсновной = Макет.ПолучитьОбласть("Шапка|Основной");    
	ТабДокумент.Вывести(ОбластьШапкаОсновной); 	
	
	ОбластьШапкаПериод = Макет.ПолучитьОбласть("Шапка|Период");   
	
	ОбластьСтрокаОсновной = Макет.ПолучитьОбласть("Строка|Основной"); 
	ОбластьСтрокаПериод = Макет.ПолучитьОбласть("Строка|Период"); 
	
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");  
	
	ОбластьШапка2ПериодИсточник = Макет.ПолучитьОбласть("Шапка2|ПериодИсточник");     
	ОбластьШапка2ФН = Макет.ПолучитьОбласть("Шапка2|ФН");

	ОбластьСтрока2ПериодИсточник = Макет.ПолучитьОбласть("Строка2|ПериодИсточник"); 
	ОбластьСтрока2ФН = Макет.ПолучитьОбласть("Строка2|ФН");          	
	
	
	МассивПериодов = СРО_ФормированиеИОтправкаОтчетов.ПолучитьМассивПериодов(ДатаНачалаОтчета, ДатаОкончанияОтчета);
	Для Каждого ЭлементМассива Из МассивПериодов Цикл
		ОбластьШапкаПериод.Параметры.ПредставлениеПериода = ЭлементМассива;
		ТабДокумент.Присоединить(ОбластьШапкаПериод); 			
	КонецЦикла;	
	
	// Получаем данные и заполняем таблицу
	
	ТаблицаФН = Новый ТаблицаЗначений;
	ТаблицаФН.Колонки.Добавить("ФН");
	ТаблицаФН.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	ТаблицаФН.Колонки.Добавить("ЗначениеПоказателя");
	ТаблицаФН.Колонки.Добавить("ЗначениеНорматива");
	ТаблицаФН.Колонки.Добавить("ЕстьОшибка", Новый ОписаниеТипов("Булево"));
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтчетностьКПК.Ссылка КАК ДокументОтчетности,
	               |	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ОтчетностьКПК.ДатаОкончанияОтчетногоПериода, КВАРТАЛ), ДЕНЬ) КАК ДатаОкончанияОтчетногоПериода,
	               |	ОтчетностьКПК.КодДокумента КАК КодДокумента,
	               |	ОтчетностьКПК.КПКДатаСоздания КАК КПКДатаСоздания
	               |ИЗ
	               |	Документ.ОтчетностьКПК КАК ОтчетностьКПК
	               |ГДЕ
	               |	ОтчетностьКПК.ДатаОкончанияОтчетногоПериода МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ОтчетностьКПК.КПК = &КПК
	               |	И ОтчетностьКПК.Проведен = ИСТИНА
	               |	И ОтчетностьКПК.ИспользоватьДокумент = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаОкончанияОтчетногоПериода";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаОтчета);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончанияОтчета));
	Запрос.УстановитьПараметр("КПК", КПК);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивФН = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		ДокументОтчетности = Выборка.ДокументОтчетности; 
		КодДокумента = Выборка.КодДокумента;
		ДатаОкончанияОтчетногоПериода = Выборка.ДатаОкончанияОтчетногоПериода;
		
		ТаблицаПоказателей = ДокументОтчетности.ТаблицаПоказателей;
		
		Если ТаблицаПоказателей.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
							
		СрокДеятельностиКПК = (НачалоДня(ДатаНачалаОтчета) - НачалоДня(Выборка.КПКДатаСоздания)) / 86400;
		
		СтруктураЗначение = Новый Структура;
		Для Каждого СтрокаПараметры ИЗ ТаблицаПоказателей Цикл
			Раздел = СтрокаПараметры.Раздел;
			Если Не ЗначениеЗаполнено(Раздел) Тогда
				Прервать;
			КонецЕсли; 			
			
			СтруктураЗначение.Вставить("Раздел" + Раздел.Код, СтрокаПараметры.Показатель1);      			
		КонецЦикла;  					
		
		ЗначенияНормативов = СРО_ЗагрузкаОтчетности.ПолучитьНормативы_РасчетныеИПоБазе(СтруктураЗначение, КодДокумента, 2); 		
		
		// ФН1
		ФН1Норматив = СРО_ЗагрузкаОтчетности.ПолучитьУстановленноеЗначениеНорматива("ФН1", СтруктураЗначение, СрокДеятельностиКПК, КодДокумента);  		
		ФН1Расчет = ЗначенияНормативов.ФН1Расчет;
		
		НоваяСтрока = ТаблицаФН.Добавить();
		НоваяСтрока.ФН = "ФН1";
		НоваяСтрока.Период = ДатаОкончанияОтчетногоПериода;
		НоваяСтрока.ЗначениеПоказателя = ФН1Расчет;
		НоваяСтрока.ЗначениеНорматива = ФН1Норматив;      	
		
		Если ФН1Расчет <> "!ДЕЛ/0" Тогда 
			Если ФН1Расчет < ФН1Норматив Тогда //И Значение <> 0 Тогда     			  
				НоваяСтрока.ЕстьОшибка = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если МассивФН.Найти("ФН1") = Неопределено Тогда
			МассивФН.Добавить("ФН1");
		КонецЕсли;
		
		// ФН2
		ФН2Норматив = СРО_ЗагрузкаОтчетности.ПолучитьУстановленноеЗначениеНорматива("ФН2", СтруктураЗначение, СрокДеятельностиКПК, КодДокумента);  		
		ФН2Расчет = ЗначенияНормативов.ФН2Расчет;
		
		НоваяСтрока = ТаблицаФН.Добавить();
		НоваяСтрока.ФН = "ФН2";
		НоваяСтрока.Период = ДатаОкончанияОтчетногоПериода;
		НоваяСтрока.ЗначениеПоказателя = ФН2Расчет;
		НоваяСтрока.ЗначениеНорматива = ФН2Норматив;      	
		
		Если ФН2Расчет <> "!ДЕЛ/0" Тогда  
			Если ФН2Расчет > ФН2Норматив Тогда //И Значение <> 0 Тогда     			 
				НоваяСтрока.ЕстьОшибка = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если МассивФН.Найти("ФН2") = Неопределено Тогда
			МассивФН.Добавить("ФН2");
		КонецЕсли;
			
		// ФН3
		ФН3Норматив = СРО_ЗагрузкаОтчетности.ПолучитьУстановленноеЗначениеНорматива("ФН3", СтруктураЗначение, СрокДеятельностиКПК, КодДокумента);  		
		ФН3Расчет = ЗначенияНормативов.ФН3Расчет;
		
		НоваяСтрока = ТаблицаФН.Добавить();
		НоваяСтрока.ФН = "ФН3";
		НоваяСтрока.Период = ДатаОкончанияОтчетногоПериода;
		НоваяСтрока.ЗначениеПоказателя = ФН3Расчет;
		НоваяСтрока.ЗначениеНорматива = ФН3Норматив;      	
		
		Если ФН3Расчет <> "!ДЕЛ/0" Тогда     
			Если ФН3Расчет > ФН3Норматив Тогда //И Значение <> 0 Тогда
				НоваяСтрока.ЕстьОшибка = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если МассивФН.Найти("ФН3") = Неопределено Тогда
			МассивФН.Добавить("ФН3");   
		КонецЕсли;
		
		// ФН4
		ФН4Норматив = СРО_ЗагрузкаОтчетности.ПолучитьУстановленноеЗначениеНорматива("ФН4", СтруктураЗначение, СрокДеятельностиКПК, КодДокумента);  		
		ФН4Расчет = ЗначенияНормативов.ФН4Расчет;
		
		НоваяСтрока = ТаблицаФН.Добавить();
		НоваяСтрока.ФН = "ФН4";
		НоваяСтрока.Период = ДатаОкончанияОтчетногоПериода;
		НоваяСтрока.ЗначениеПоказателя = ФН4Расчет;
		НоваяСтрока.ЗначениеНорматива = ФН4Норматив;      	
		
		Если ФН4Расчет <> "!ДЕЛ/0" Тогда
			Если ФН4Расчет < ФН4Норматив Тогда //И Значение <> 0 Тогда   			   
				НоваяСтрока.ЕстьОшибка = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если МассивФН.Найти("ФН4") = Неопределено Тогда
			МассивФН.Добавить("ФН4"); 
		КонецЕсли;
		
		// ФН5
		ФН5Норматив = СРО_ЗагрузкаОтчетности.ПолучитьУстановленноеЗначениеНорматива("ФН5", СтруктураЗначение, СрокДеятельностиКПК, КодДокумента);  		
		ФН5Расчет = ЗначенияНормативов.ФН5Расчет;
		
		НоваяСтрока = ТаблицаФН.Добавить();
		НоваяСтрока.ФН = "ФН5";
		НоваяСтрока.Период = ДатаОкончанияОтчетногоПериода;
		НоваяСтрока.ЗначениеПоказателя = ФН5Расчет;
		НоваяСтрока.ЗначениеНорматива = ФН5Норматив;      	
		
		Если ФН5Расчет <> "!ДЕЛ/0" Тогда
			Если ФН5Расчет > ФН5Норматив Тогда //И Значение <> 0 Тогда 			   
				НоваяСтрока.ЕстьОшибка = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если МассивФН.Найти("ФН5") = Неопределено Тогда
			МассивФН.Добавить("ФН5");  
		КонецЕсли;
		
		// ФН6
		ФН6Норматив = СРО_ЗагрузкаОтчетности.ПолучитьУстановленноеЗначениеНорматива("ФН6", СтруктураЗначение, СрокДеятельностиКПК, КодДокумента);  		
		ФН6Расчет = ЗначенияНормативов.ФН6Расчет;
		
		НоваяСтрока = ТаблицаФН.Добавить();
		НоваяСтрока.ФН = "ФН6";
		НоваяСтрока.Период = ДатаОкончанияОтчетногоПериода;
		НоваяСтрока.ЗначениеПоказателя = ФН6Расчет;
		НоваяСтрока.ЗначениеНорматива = ФН6Норматив;      	
		
		Если ФН6Расчет <> "!ДЕЛ/0" Тогда
			Если ФН6Расчет > ФН6Норматив Тогда //И Значение <> 0 Тогда       			   
				НоваяСтрока.ЕстьОшибка = Истина;
			КонецЕсли;
		КонецЕсли;  
		
		Если МассивФН.Найти("ФН6") = Неопределено Тогда
			МассивФН.Добавить("ФН6");  
		КонецЕсли;
		
		// ФН7
		ФН7Норматив = СРО_ЗагрузкаОтчетности.ПолучитьУстановленноеЗначениеНорматива("ФН7", СтруктураЗначение, СрокДеятельностиКПК, КодДокумента);  		
		ФН7Расчет = ЗначенияНормативов.ФН7Расчет;
		
		НоваяСтрока = ТаблицаФН.Добавить();
		НоваяСтрока.ФН = "ФН7";
		НоваяСтрока.Период = ДатаОкончанияОтчетногоПериода;
		НоваяСтрока.ЗначениеПоказателя = ФН7Расчет;
		НоваяСтрока.ЗначениеНорматива = ФН7Норматив;      	
		
		Если ФН7Расчет <> "!ДЕЛ/0" Тогда
			Если ФН7Расчет < ФН7Норматив Тогда //И Значение <> 0 Тогда      			   
				НоваяСтрока.ЕстьОшибка = Истина;
			КонецЕсли;
		КонецЕсли;  	
		
		Если МассивФН.Найти("ФН7") = Неопределено Тогда      		
			МассивФН.Добавить("ФН7");
		КонецЕсли;
			
		// ФН8
		ФН8Норматив = СРО_ЗагрузкаОтчетности.ПолучитьУстановленноеЗначениеНорматива("ФН8", СтруктураЗначение, СрокДеятельностиКПК, КодДокумента);  		
		ФН8Расчет = ЗначенияНормативов.ФН8Расчет;
		
		НоваяСтрока = ТаблицаФН.Добавить();
		НоваяСтрока.ФН = "ФН8";
		НоваяСтрока.Период = ДатаОкончанияОтчетногоПериода;
		НоваяСтрока.ЗначениеПоказателя = ФН8Расчет;
		НоваяСтрока.ЗначениеНорматива = ФН8Норматив;      	
		
		Если ФН8Расчет <> "!ДЕЛ/0" Тогда  
			Если ФН8Расчет < ФН8Норматив Тогда //И Значение <> 0 Тогда  			 
				НоваяСтрока.ЕстьОшибка = Истина;
			КонецЕсли;
		КонецЕсли;    
		
		Если МассивФН.Найти("ФН8") = Неопределено Тогда      		
			МассивФН.Добавить("ФН8");
		КонецЕсли;
		
	КонецЦикла;
	
	// Выводим 1-ю таблицу   	
	Для Каждого ЭлементФН ИЗ МассивФН Цикл
		
		ОбластьСтрокаОсновной.Параметры.Норматив = ЭлементФН;
		
		Если ЭлементФН = "ФН1" Тогда 
			ЗначениеНорматива = "≥5%";
			
		ИначеЕсли ЭлементФН = "ФН2" Тогда 
			ЗначениеНорматива = "≤20%";	
			
		ИначеЕсли ЭлементФН = "ФН3" Тогда 
			ЗначениеНорматива = "≤10%";	
			
		ИначеЕсли ЭлементФН = "ФН4" Тогда 
			ЗначениеНорматива = "≥6%";	
			
		ИначеЕсли ЭлементФН = "ФН5" Тогда 
			ЗначениеНорматива = "≤50%";	
			
		ИначеЕсли ЭлементФН = "ФН6" Тогда 
			ЗначениеНорматива = "≤10-15%-20%";	
			
		ИначеЕсли ЭлементФН = "ФН7" Тогда 
			ЗначениеНорматива = "≥70%";		
			
		ИначеЕсли ЭлементФН = "ФН8" Тогда 
			ЗначениеНорматива = "≥30%-60%-75%";		
		КонецЕсли;     
		
		ОбластьСтрокаОсновной.Параметры.ЗначениеНорматива = ЗначениеНорматива;
		ТабДокумент.Вывести(ОбластьСтрокаОсновной); 
		
		Для Каждого ЭлементМассива ИЗ МассивПериодов Цикл
			
			НайденныеСтроки = ТаблицаФН.НайтиСтроки(Новый Структура("ФН, Период", ЭлементФН, ЭлементМассива)); 
			Если НайденныеСтроки.Количество() > 0 Тогда 	
				ЕстьОшибка  = НайденныеСтроки[0].ЕстьОшибка;
				ОбластьСтрокаПериод.Параметры.Флаг = ?(ЕстьОшибка, "не соответствует", "соответствует");
				
				Если ЕстьОшибка Тогда
					ОбластьСтрокаПериод.Область(1, 1, 1, 1).ЦветТекста = WebЦвета.Красный;
				Иначе	
					ОбластьСтрокаПериод.Область(1, 1, 1, 1).ЦветТекста = WebЦвета.Черный;
				КонецЕсли;
				
				ТабДокумент.Присоединить(ОбластьСтрокаПериод); 			
			КонецЕсли;     			
		КонецЦикла;      		
	КонецЦикла; 
	
	// Выводим 2-ю таблицу	
	ТабДокумент.Вывести(ОбластьПустаяСтрока); 

	ТекстЗаголовка = "Инспекторская группа, провела сравнение указанных величин финансовых нормативов на отчетные даты, и данных расчета инспекторской группы:";
	ОбластьЗаголовок.Параметры.ТекстЗаголовка = ТекстЗаголовка;	
	ТабДокумент.Вывести(ОбластьЗаголовок); 	
	
	ТабДокумент.Вывести(ОбластьШапка2ПериодИсточник); 
	
	
	Для Каждого ЭлементФН ИЗ МассивФН Цикл  	
		ОбластьШапка2ФН.Параметры.ФН = ЭлементФН;	
		ТабДокумент.Присоединить(ОбластьШапка2ФН); 	
	КонецЦикла;        	
	
	НаименованиеКраткое = СокрЛП(Кпк.НаименованиеКраткое);
	
	Для Каждого ЭлементПериод ИЗ МассивПериодов Цикл
		
		ОбластьСтрока2ПериодИсточник.Параметры.Период = ЭлементПериод;		
		ОбластьСтрока2ПериодИсточник.Параметры.НаименованиеКраткое = НаименованиеКраткое;
		
		ТабДокумент.Вывести(ОбластьСтрока2ПериодИсточник); 	 
		
		ФН1 = 0;
		ФН2 = 0;
		ФН3 = 0;
		ФН4 = 0;
		ФН5 = 0;
		ФН6 = 0;
		ФН7 = 0;
		ФН8 = 0;

		НайденныеСтроки = ТаблицаФН.НайтиСтроки(Новый Структура("Период", ЭлементПериод)); 
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			Для Каждого ТекСтрока Из НайденныеСтроки Цикл
				
				Если ТекСтрока.ФН = "ФН1" Тогда
					ФН1 = ТекСтрока.ЗначениеПоказателя;
					
				ИначеЕсли ТекСтрока.ФН = "ФН2" Тогда
					ФН2 = ТекСтрока.ЗначениеПоказателя;	
					
				ИначеЕсли ТекСтрока.ФН = "ФН3" Тогда
					ФН3 = ТекСтрока.ЗначениеПоказателя;		
					
				ИначеЕсли ТекСтрока.ФН = "ФН4" Тогда
					ФН4 = ТекСтрока.ЗначениеПоказателя;	
					
				ИначеЕсли ТекСтрока.ФН = "ФН5" Тогда
					ФН5 = ТекСтрока.ЗначениеПоказателя;		
					
				ИначеЕсли ТекСтрока.ФН = "ФН6" Тогда
					ФН6 = ТекСтрока.ЗначениеПоказателя;		
					
				ИначеЕсли ТекСтрока.ФН = "ФН7" Тогда
					ФН7 = ТекСтрока.ЗначениеПоказателя;		
					
				ИначеЕсли ТекСтрока.ФН = "ФН8" Тогда
					ФН8 = ТекСтрока.ЗначениеПоказателя;		
					
				КонецЕсли;					
			КонецЦикла;   			
		КонецЕсли;    		

		ОбластьСтрока2ФН.Параметры.ФН = СРО_ФормированиеИОтправкаОтчетов.ФорматироватьЧисло(ФН1);
		ТабДокумент.Присоединить(ОбластьСтрока2ФН); 	 
		
		ОбластьСтрока2ФН.Параметры.ФН = СРО_ФормированиеИОтправкаОтчетов.ФорматироватьЧисло(ФН2);
		ТабДокумент.Присоединить(ОбластьСтрока2ФН); 	 
		
		ОбластьСтрока2ФН.Параметры.ФН = СРО_ФормированиеИОтправкаОтчетов.ФорматироватьЧисло(ФН3);
		ТабДокумент.Присоединить(ОбластьСтрока2ФН); 
				
		ОбластьСтрока2ФН.Параметры.ФН = СРО_ФормированиеИОтправкаОтчетов.ФорматироватьЧисло(ФН4);
		ТабДокумент.Присоединить(ОбластьСтрока2ФН); 
		
		ОбластьСтрока2ФН.Параметры.ФН = СРО_ФормированиеИОтправкаОтчетов.ФорматироватьЧисло(ФН5);
		ТабДокумент.Присоединить(ОбластьСтрока2ФН); 
		
		ОбластьСтрока2ФН.Параметры.ФН = СРО_ФормированиеИОтправкаОтчетов.ФорматироватьЧисло(ФН6);
		ТабДокумент.Присоединить(ОбластьСтрока2ФН); 
		
		ОбластьСтрока2ФН.Параметры.ФН = СРО_ФормированиеИОтправкаОтчетов.ФорматироватьЧисло(ФН7);
		ТабДокумент.Присоединить(ОбластьСтрока2ФН); 
				
		ОбластьСтрока2ФН.Параметры.ФН = СРО_ФормированиеИОтправкаОтчетов.ФорматироватьЧисло(ФН8);
		ТабДокумент.Присоединить(ОбластьСтрока2ФН); 		
	КонецЦикла;	       	
	
	МассивТабДокументов = Новый Массив;
	МассивТабДокументов.Добавить(ТабДокумент);
	
	Возврат МассивТабДокументов;
	
КонецФункции