Функция ПроверитьСоответствиеТребованиямИНН(Знач ИНН, Знач ЭтоЮрЛицо) Экспорт
	Перем ТекстОшибкиФорматнаяПроверка;
	
	РезультатПроверки = Новый Структура("СоответствуетТребованиям, ЭтоЮрЛицо, ОписаниеОшибки", Истина, ЭтоЮрЛицо, "");
	
	Если ЗначениеЗаполнено(ИНН) Тогда
		
		ИНН = СокрП(ИНН);
		
		ЭтоИННФизическогоЛица  = ЭтоИННФизическогоЛица(ИНН);
		ЭтоИННЮридическогоЛица = ЭтоИННЮридическогоЛица(ИНН);
		
		Если РезультатПроверки.ЭтоЮрЛицо И НЕ ЭтоИННЮридическогоЛица Тогда
			РезультатПроверки.ОписаниеОшибки = НСтр("ru = 'ИНН юридического лица должен состоять из 10 цифр'");
			
			Если ЭтоИННФизическогоЛица Тогда
				// Ошибка в определении вида контрагента, однако ИНН может быть все равно корректным - просто надо изменить вид.
				РезультатПроверки.ЭтоЮрЛицо = Ложь;
			Иначе
				РезультатПроверки.СоответствуетТребованиям = Ложь;
			КонецЕсли; 
		ИначеЕсли НЕ РезультатПроверки.ЭтоЮрЛицо И НЕ ЭтоИННФизическогоЛица Тогда
			РезультатПроверки.ОписаниеОшибки = НСтр("ru = 'ИНН физического лица должен состоять из 12 цифр'");
			
			Если ЭтоИННЮридическогоЛица Тогда
				// Ошибка в определении вида контрагента, однако ИНН может быть все равно корректным - просто надо изменить вид.
				РезультатПроверки.ЭтоЮрЛицо = Истина;
			Иначе
				РезультатПроверки.СоответствуетТребованиям = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если РезультатПроверки.СоответствуетТребованиям Тогда
			Если Лев(ИНН, 2) = "00" Тогда
				РезультатПроверки.ОписаниеОшибки = НСтр("ru = 'Первые две цифры ИНН не могут быть ""00""'");
				РезультатПроверки.СоответствуетТребованиям = Ложь;
			Иначе
				РезультатПроверки.СоответствуетТребованиям = РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ИНН, РезультатПроверки.ЭтоЮрЛицо, ТекстОшибкиФорматнаяПроверка);
				
				Если НЕ РезультатПроверки.СоответствуетТребованиям Тогда
					РезультатПроверки.ОписаниеОшибки = ТекстОшибкиФорматнаяПроверка;
				КонецЕсли; 
				
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		РезультатПроверки.СоответствуетТребованиям = Ложь;
		// В этом случае описание ошибки не выводим,
		// так как описание ошибки из этой функции обычно используется для вывода на форме,
		// а о незаполненном ИНН на форме сообщаем другими средствами.
		
	КонецЕсли;
	
	Возврат РезультатПроверки;
КонецФункции


Функция МинимальнаяДлинаИНН() Экспорт
	
	// ММВ-7-6/435@
	// 1. Структура идентификационного номера налогоплательщика (далее - ИНН) представляет собой:
	// 1) для организации - десятизначный цифровой код:
	// 2) для физического лица - двенадцатизначный цифровой код:
	
	Возврат 10;
	
КонецФункции

Функция МаксимальнаяДлинаИНН() Экспорт
	
	// ММВ-7-6/435@
	// 1. Структура идентификационного номера налогоплательщика (далее - ИНН) представляет собой:
	// 1) для организации - десятизначный цифровой код:
	// 2) для физического лица - двенадцатизначный цифровой код:
	
	Возврат 12;
	
КонецФункции


Функция ЭтоИННЮридическогоЛица(ИНН) Экспорт
	
	// ММВ-7-6/435@
	// 1. Структура идентификационного номера налогоплательщика (далее - ИНН) представляет собой:
	// 1) для организации - десятизначный цифровой код:
	
	Возврат СтрДлина(ИНН) = МинимальнаяДлинаИНН();
	
КонецФункции

Функция ЭтоИННФизическогоЛица(ИНН) Экспорт
	
	// ММВ-7-6/435@
	// 1. Структура идентификационного номера налогоплательщика (далее - ИНН) представляет собой:
	// 2) для физического лица - двенадцатизначный цифровой код:
	
	Возврат СтрДлина(ИНН) = МаксимальнаяДлинаИНН();
	
КонецФункции


