
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
	ТабличныйДокументДляВывода = Параметры.ТабличныйДокумент;
	ТаблицаОшибок.Вывести(ТабличныйДокументДляВывода);
	
	// заполняем дерево                         	
	МассивДеревоКПК = Параметры.МассивДеревоКПК;
	
	ДеревоЗначениеКПК = РеквизитФормыВЗначение("ДеревоКПК");
	
	Для Каждого ТекКПК ИЗ МассивДеревоКПК Цикл
		
		СтрокаКПК = ДеревоЗначениеКПК.Строки.Добавить();
		СтрокаКПК.КПК = ТекКПК.КПК;
		
		Для Каждого Раздел ИЗ ТекКПК.МассивРазделовОшибок Цикл
			СтрокаРаздел = СтрокаКПК.Строки.Добавить();
			СтрокаРаздел.Раздел = Раздел;   			
		КонецЦикла; 		
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоЗначениеКПК, "ДеревоКПК");
	
КонецПроцедуры


&НаСервере
Процедура УстановитьСнятьПометкинаСервере(УзелДерева, Пометка)
	
	
	Для Каждого ТекУзел ИЗ УзелДерева.Строки Цикл
		ТекУзел.ВыводитьВДокумент = Пометка;     		
		УстановитьСнятьПометкинаСервере(ТекУзел, Пометка);		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДеревоУстановитьСнятьПометкиНаСервере(Пометка)
	
	ДеревоЗначенийКПК = РеквизитФормыВЗначение("ДеревоКПК");	    	
	УстановитьСнятьПометкинаСервере(ДеревоЗначенийКПК, Пометка);		
	
	ЗначениеВРеквизитФормы(ДеревоЗначенийКПК, "ДеревоКПК");
		
КонецПроцедуры


&НаКлиенте
Процедура ДеревоУстановитьПометку(Команда) 	
	ДеревоУстановитьСнятьПометкинаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСнятьПометку(Команда)
	ДеревоУстановитьСнятьПометкинаСервере(Ложь);
КонецПроцедуры
