&НаСервере
Функция ПериодОтчетаГодовой()
	Если Объект.ВидОтчета = Перечисления.ВидыОтчетов.Годовой30Дней ИЛИ Объект.ВидОтчета = Перечисления.ВидыОтчетов.Годовой90Дней Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
процедура ОбновитьПредставлениеПериода()
	ДатаОкончанияОтчетногоПериода = Объект.ДатаОкончанияОтчетногоПериода;
	
	//Если ПериодОтчетаГодовой() Тогда
	//	НачалоПериода = НачалоГода(ДатаОкончанияОтчетногоПериода);
	//	ОкончаниеПериода = КонецГода(ДатаОкончанияОтчетногоПериода);     
	//Иначе
		НачалоПериода = НачалоКвартала(ДатаОкончанияОтчетногоПериода);
		ОкончаниеПериода = КонецКвартала(ДатаОкончанияОтчетногоПериода);   		
	//КонецЕсли;
		
	Элементы.ДекорацияПериод.Заголовок = ПредставлениеПериода(НачалоПериода, ОкончаниеПериода);    
	УстановитьВидОтчетаНаСервере();
		
КонецПроцедуры

&НаСервере
процедура УстановитьВидОтчетаНаСервере()
	ДатаОкончанияОтчетногоПериода = Объект.ДатаОкончанияОтчетногоПериода;
	Если Месяц(ДатаОкончанияОтчетногоПериода) = 3 Тогда 
		Объект.ВидОтчета =  Перечисления.ВидыОтчетов.Квартал1;
		
	ИначеЕсли Месяц(ДатаОкончанияОтчетногоПериода) = 6 Тогда 
		Объект.ВидОтчета =  Перечисления.ВидыОтчетов.Квартал2;	
		
	ИначеЕсли Месяц(ДатаОкончанияОтчетногоПериода) = 9 Тогда 
		Объект.ВидОтчета =  Перечисления.ВидыОтчетов.Квартал3;	
		
	ИначеЕсли Месяц(ДатаОкончанияОтчетногоПериода) = 12 Тогда 
		Объект.ВидОтчета =  Перечисления.ВидыОтчетов.Годовой90Дней;		
	КонецЕсли;    	
КонецПроцедуры


&НаКлиенте
Процедура ПриИзмененииОтчетногоПериода(Режим)
	
	Знак = ?(Режим = "Увеличить", 1, -1);   	
	
	//Если ПериодОтчетаГодовой() Тогда
	//	КоличествоМесяцев = 12;
	//	Объект.ДатаОкончанияОтчетногоПериода =  КонецКвартала(ДобавитьМесяц(Объект.ДатаОкончанияОтчетногоПериода, КоличествоМесяцев * Знак));			
	//Иначе	
		КоличествоМесяцев = 3;				 
		Объект.ДатаОкончанияОтчетногоПериода =  КонецКвартала(ДобавитьМесяц(Объект.ДатаОкончанияОтчетногоПериода, КоличествоМесяцев * Знак));			
	//КонецЕсли;
	
	ОбновитьПредставлениеПериода();	 	
	УстановитьВидОтчетаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьПериод(Команда)
	ПриИзмененииОтчетногоПериода("Уменьшить");     
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьПериод(Команда)
	ПриИзмененииОтчетногоПериода("Увеличить");    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОкончанияОтчетногоПериода) Тогда
		Объект.ДатаОкончанияОтчетногоПериода = КонецКвартала(ДобавитьМесяц(ТекущаяДата(), -3));
	КонецЕсли;
	
	ОбновитьПредставлениеПериода();
	
	ОбновитьРеквизитыНаФорме();	

КонецПроцедуры


&НаСервереБезКонтекста
Функция ЭтоКодДокумента_2_16_4(КодДокумента)        	
	Возврат КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_2164 ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21641
	ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21642 ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21644;
	
КонецФункции  

&НаСервереБезКонтекста
Функция ЭтоКодДокумента_2_16_5(КодДокумента)        	
	Возврат КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_2165;    	
КонецФункции 
                     
&НаСервереБезКонтекста
Функция ПолучитьВидимостьДляРегулярнойОтчетности(ВидПериодичностиОтчетности)   
	Возврат НЕ ВидПериодичностиОтчетности = Перечисления.СРО_ВидыПериодичностиОтчетности.Нерегулярная;
КонецФункции

&НаКлиенте
Процедура ОбновитьРеквизитыНаФорме()	
	
	КодДокумента_2_16_3_2 = СтрНайти(Объект.КодДокумента, "2.16.3.1") > 0 ИЛИ СтрНайти(Объект.КодДокумента, "2.16.3.2") ИЛИ Строка(Объект.КодДокумента) = "";
	КодДокумента_2_16_4 = ЭтоКодДокумента_2_16_4(Объект.КодДокумента);  	
	КодДокумента_2_16_5 = ЭтоКодДокумента_2_16_5(Объект.КодДокумента);         
	
	Элементы.СРО_ВидПериодичностиОтчетности.Видимость = КодДокумента_2_16_4;
	КодДокумента_2_16_3_4 = СтрНайти(Объект.КодДокумента, "2.16.3.4") > 0;  
	
	Элементы.Раздел12.Видимость = СтрНайти(Объект.КодДокумента, "2.16.3.3") > 0 ИЛИ КодДокумента_2_16_3_4 ИЛИ КодДокумента_2_16_4;    
	Элементы.Раздел13.Видимость = СтрНайти(Объект.КодДокумента, "2.16.3.3") > 0 ИЛИ КодДокумента_2_16_3_4;
	
	//Элементы.Раздел9.Видимость = НЕ КодДокумента_2_16_4;   
	Элементы.Раздел10.Видимость = НЕ КодДокумента_2_16_4; 	
	
	Если КодДокумента_2_16_4 
		ИЛИ КодДокумента_2_16_5 Тогда
		Элементы.Раздел5.Заголовок = "Раздел V. Данные о средневзвешенных значениях полной стоимости потребительских займов по категориям потребительских займов";
		Элементы.Раздел6.Заголовок = "Раздел VI. Данные о структуре задолженности по предоставленным займам и размере сформированных резервов на возможные потери по займам";
		Элементы.Раздел7.Заголовок = "Раздел VII. Данные о размещении средств резервных фондов";
		Элементы.Раздел8.Заголовок = "Раздел VIII. Числовые значения финансовых нормативов";
		Элементы.Раздел9.Заголовок = "Раздел IX. Сведения об утверждении повестки дня общего собрания членов КПК, содержащей вопрос об утверждении аудиторской организации (индивидуального аудитора)";
		
		Элементы.Раздел11.Заголовок = "Раздел XI. Аффилированные лица";  	                                                                                		
		Элементы.Раздел12.Заголовок = "Раздел XII. Информация о фондах, сформированных в КПК (паевой, резервный фонд, фонд финансовой взаимопомощи и иные)";		
	КонецЕсли; 	
	
	Элементы.Группа21632.Видимость = КодДокумента_2_16_3_2;
	Элементы.СРОНомерВРесстреСРО.Видимость  =КодДокумента_2_16_3_2;   
	Элементы.Группа21633.Видимость = НЕ КодДокумента_2_16_3_2;
	
	
	Элементы.ДатаПрекращенияЧленстваВКПК2Уровня.Видимость = НЕ КодДокумента_2_16_3_2; 
	//Элементы.СРОПолноеНаименование.Видимость = КодДокумента_2_16_3_2;	
	Элементы.КПКДатаПрекращенияЧленстваВСРО.Видимость = НЕ КодДокумента_2_16_3_2;    
	
	Элементы.Раздел1Подраздел6_БКИ.Видимость = НЕ КодДокумента_2_16_3_2;
	Элементы.Раздел1Подраздел6.Видимость = КодДокумента_2_16_3_2;      
	
	Элементы.Раздел1Подраздел5_21632.Видимость = КодДокумента_2_16_3_2;
	
	Элементы.Раздел1Подраздел7.Видимость = НЕ КодДокумента_2_16_3_2;
	
	Элементы.Раздел1Подраздел7.Заголовок = "Подраздел 7. Сведения о счетах КПК";
	
	Элементы.ТаблицаКредитныхСчетов.Видимость = (НЕ КодДокумента_2_16_4 И НЕ КодДокумента_2_16_5);
	Элементы.ТаблицаПринципыОбъединенияЧленовКПК.Видимость = КодДокумента_2_16_4 ИЛИ КодДокумента_2_16_5;   
	
	Элементы.ТаблицаПоказателей8.Видимость = НЕ КодДокумента_2_16_4 ИЛИ КодДокумента_2_16_5;
	Элементы.ТаблицаПоказателей9.Видимость = НЕ КодДокумента_2_16_4;
	Элементы.Раздел10_2164.Видимость = КодДокумента_2_16_4;   	

	Элементы.ТаблицаОбособленныхПодразделенияхКодДеятельностиОбособленногоПодразделения.Видимость = НЕ КодДокумента_2_16_3_2;
	
	Элементы.КПКДоменноеИмяВебСервиса.Видимость = КодДокумента_2_16_5;
	Если КодДокумента_2_16_3_2 Тогда
		Элементы.СРОПолноеНаименование.Заголовок = "24. Полное наименование";
		Элементы.СРОИНН.Заголовок = "25. Идентификационный номер налогоплательщика (ИНН)";
		Элементы.СРООГРН.Заголовок = "26. Основной государственный регистрационный номер (ОГРН)";
		Элементы.СРОНомерВРесстреСРО.Заголовок = "27. Номер в единном реестре саморегулируемых организаций в сфере финансового рынка";		
		Элементы.КПКДатаВступленияВСРО.Заголовок = "28. Дата вступления КПК в СРО";   	
		
		Элементы.КПК2УровняПолноеНаименование.Заголовок = "29. Полное наименование КПК 2 ур.";
		Элементы.КПК2УровняИНН.Заголовок = "30. ИНН КПК 2 ур.";
		Элементы.КПК2УровняОГРН.Заголовок = "31. ОГРН КПК 2 ур.";
		Элементы.ДатаВступленияКПКВКПК2Уровня.Заголовок = "32. Дата вступления в КПК 2 ур.";
		//Элементы.ДатаПрекращенияЧленстваВКПК2Уровня.Заголовок = "5. Дата прекращения членства в КПК 2 ур.";

		
		Элементы.Раздел1Подраздел2.Заголовок = "Подраздел 2. Сведения об обособленных подразделениях";
		Элементы.Раздел1Подраздел3.Заголовок = "Подраздел 3. Сведения о саморегулируемой организации";
		Элементы.Раздел1Подраздел4.Заголовок = "Подраздел 4. Сведения о КПК 2 уровня";		
	//	Элементы.Раздел1Подраздел5_21632.Заголовок = "Подраздел 5. Сведения о счетах КПК";   		
		//Элементы.Раздел1Подраздел6.Заголовок = "Подраздел 6. Кредитный рейтинг КПК"; 
		
		Элементы.РейтинговоеАгенство_ПолноеНаименование.Заголовок = "42. Полное наименование рейтингового агенства";
		Элементы.РейтинговоеАгенство_ИНН.Заголовок = "43. Индентификационный номер налогоплательщика (ИНН)";
		Элементы.РейтинговоеАгенство_ОГРН.Заголовок = "44. Основной государственный регистрационный номер (ОГРН)";
		Элементы.РейтинговоеАгенство_УровеньРейтинга.Заголовок = "45. Уровень присвоенного кредитного рейтинга";
		Элементы.РейтинговоеАгенство_ДатаПрисвоенияРейтинга.Заголовок = "46. Дата присвоения кредитного рейтинга";
		
	иначе
		Если КодДокумента_2_16_4 Или КодДокумента_2_16_5 Тогда
			Элементы.Раздел1Подраздел7.Заголовок = "Подраздел 7. Принцип объединения членов КПК (пайщиков)";
			
			

			Элементы.КПКДатаВступленияВСРО.Видимость = Ложь;
			Элементы.КПКДатаПрекращенияЧленстваВСРО.Видимость = Ложь;			
			Элементы.НеЯвляетсяЧленомСРО.Видимость = Ложь;
			
			Элементы.ДатаВступленияКПКВКПК2Уровня.Видимость = Ложь;
			Элементы.ДатаПрекращенияЧленстваВКПК2Уровня.Видимость = Ложь;		
			
			ВидимостьДляРегулярнойОтчетности = ПолучитьВидимостьДляРегулярнойОтчетности(Объект.ВидПериодичностиОтчетности) ИЛИ Объект.КраткаяОтчетность;			
			
			Элементы.Раздел2.Видимость = ВидимостьДляРегулярнойОтчетности;	
			Элементы.Раздел3.Видимость = ВидимостьДляРегулярнойОтчетности;	
			Элементы.Раздел4.Видимость = ВидимостьДляРегулярнойОтчетности;	
			Элементы.Раздел5.Видимость = ВидимостьДляРегулярнойОтчетности;	                                                                            				
				
			Элементы.Раздел9.Заголовок = "Раздел IX. Сведения об утверждении повестки дня общего собрания членов КПК, содержащей вопрос об утверждении аудиторской организации (индивидуального аудитора)";
			
			Если КодДокумента_2_16_5 Тогда
				Элементы.Раздел10.Заголовок = " Раздел X. Аффилированные лица";
			Иначе
				Элементы.Раздел10.Заголовок = " Раздел X. Сведения об аудиторской проверке";
			КонецЕсли;
			
			Если Объект.КраткаяОтчетность Тогда
				
				Элементы.Раздел1Подраздел2.Видимость = Ложь;
				Элементы.Раздел1Подраздел3.Видимость = Ложь;
				Элементы.Раздел1Подраздел4.Видимость = Ложь;
				Элементы.Раздел1Подраздел6_БКИ.Видимость = Ложь;
				Элементы.Раздел1Подраздел7.Видимость = Ложь;	
				
				Элементы.Раздел6.Видимость = Ложь;	
				Элементы.Раздел7.Видимость = Ложь;	
				Элементы.Раздел8.Видимость = Ложь;	
				
				Элементы.Раздел9.Видимость = Ложь;	
				Элементы.Раздел10.Видимость = Ложь;	
				
				Элементы.Раздел11.Видимость = Ложь;	
				Элементы.Раздел12.Видимость = Ложь;	
				Элементы.Раздел13.Видимость = Ложь;	 
				
			Иначе	                 
				
				Элементы.Раздел1Подраздел2.Видимость = ВидимостьДляРегулярнойОтчетности;
				Элементы.Раздел1Подраздел3.Видимость = ВидимостьДляРегулярнойОтчетности; 
				Элементы.Раздел1Подраздел3.Видимость = ВидимостьДляРегулярнойОтчетности И КодДокумента_2_16_4;
				Элементы.Раздел1Подраздел4.Видимость = ВидимостьДляРегулярнойОтчетности;
				Элементы.Раздел1Подраздел6_БКИ.Видимость = ВидимостьДляРегулярнойОтчетности;
				Элементы.Раздел1Подраздел7.Видимость = ВидимостьДляРегулярнойОтчетности;	
				
			
				Элементы.Раздел6.Видимость = ВидимостьДляРегулярнойОтчетности;	
				Элементы.Раздел7.Видимость = ВидимостьДляРегулярнойОтчетности;	
				Элементы.Раздел8.Видимость = ВидимостьДляРегулярнойОтчетности;	
				
				Элементы.Раздел9.Видимость = КодДокумента_2_16_5 Или НЕ ВидимостьДляРегулярнойОтчетности;	
				Элементы.Раздел10.Видимость = КодДокумента_2_16_5 Или НЕ ВидимостьДляРегулярнойОтчетности;	
				
				Элементы.Раздел11.Видимость = ВидимостьДляРегулярнойОтчетности;	
				Элементы.Раздел12.Видимость = Не КодДокумента_2_16_5 Или ВидимостьДляРегулярнойОтчетности;	
				Элементы.Раздел13.Видимость = Ложь;	 
			КонецЕсли;
     	
		КонецЕсли;	
		
		Элементы.СРОПолноеНаименование.Заголовок = "1. Полное наименование";
		Элементы.СРОИНН.Заголовок = "2. Идентификационный номер налогоплательщика (ИНН)";
		Элементы.СРООГРН.Заголовок = "3. Основной государственный регистрационный номер (ОГРН)";
		Элементы.КПКДатаВступленияВСРО.Заголовок = "4. Дата вступления КПК в СРО";
		Элементы.КПКДатаПрекращенияЧленстваВСРО.Заголовок = "5. Дата прекращения члнства КПК в СРО"; 
		
		Элементы.КПК2УровняПолноеНаименование.Заголовок = "1. Полное наименование КПК 2 ур.";
		Элементы.КПК2УровняИНН.Заголовок = "2. ИНН КПК 2 ур.";
		Элементы.КПК2УровняОГРН.Заголовок = "3. ОГРН КПК 2 ур.";      	
		
		
		Если КодДокумента_2_16_4 Тогда                                                                    
			Элементы.Раздел1Подраздел2.Заголовок = "Подраздел 2 и 3. Сведения об обособленных подразделениях";
			Элементы.Раздел1Подраздел3.Заголовок = "Подраздел 4. Сведения о саморегулируемой организации";
			Элементы.Раздел1Подраздел4.Заголовок = "Подраздел 5. Сведения о КПК 2-го уровня"; 		 	
		Иначе	
			
			Элементы.Раздел1Подраздел2.Заголовок = "Подраздел 2. Сведения об обособленных подразделениях КПК и их деятельности";
			
            Элементы.Раздел1Подраздел4.Заголовок = "Подраздел 3. Сведения о КПК второго уровня, членом которого является КПК";	
		    Элементы.Раздел1Подраздел6_БКИ.Заголовок = "Подраздел 4. Сведения о вазаимодействии с бюро кредитных историй";
			Элементы.Раздел1Подраздел7.Заголовок = "Подраздел 5. Принцип объединения членов КПК (пайщиков)";	
			
		КонецЕсли;                                                                                                    							
	КонецЕсли; 	
	
	Элементы.СопроводительноеПисьмо_ФИОРуководителяКПК.Видимость = КодДокумента_2_16_3_4 ИЛИ КодДокумента_2_16_4;
	Элементы.СопроводительноеПисьмо_ФамилияРуководителяКПК.Видимость = НЕ (КодДокумента_2_16_3_4 ИЛИ КодДокумента_2_16_4);
	Элементы.СопроводительноеПисьмоИмяРуководителяКПК.Видимость = НЕ (КодДокумента_2_16_3_4 ИЛИ КодДокумента_2_16_4);
	Элементы.СопроводительноеПисьмо_ОтчествоРуководителяКПК.Видимость = НЕ (КодДокумента_2_16_3_4 ИЛИ КодДокумента_2_16_4);
	 	
	// Подраздел 3 / 4- в новой версии
	
//	КПК = Объект.КПК;
//	ПолноеНаименованиеКПК = КПК.НаименованиеПолное;
//	КраткоеНаименованиеКПК = КПК.НаименованиеКраткое;
//	ИННКПК = КПК.ИНН;
//	ОРГНКПК = КПК.ОГРН;
//	ДатаСозданияКПК = КПК.ДатаРегистрацииКПК;
//	
//	// 6. Место нахождения
//	ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес;
//	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.АдресМестонахожденияКонтрагента;	
//	МестоНахожденияКПК = СРО_ОбщегоНазначенияСервер.ПолучитьПредставлениеКонстактноИнформации(КПК, ТипКонтактнойИнформации, ВидКонтактнойИнформации);
//	
//	// 7. Адрес фактического местонахождения	
//	ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес;
//	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента;	
//	АдресФактическогоМестонахождения = СРО_ОбщегоНазначенияСервер.ПолучитьПредставлениеКонстактноИнформации(КПК, ТипКонтактнойИнформации, ВидКонтактнойИнформации);
//	
//	
//	// 8. Адрес для почтовой корреспонденции
//	ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес;
//	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента;	
//	ПочтовыйАдресКПК = СРО_ОбщегоНазначенияСервер.ПолучитьПредставлениеКонстактноИнформации(КПК, ТипКонтактнойИнформации, ВидКонтактнойИнформации);
//	
//	// 9. Номер телефона
//	ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон;
//	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;	
//	НомерТелефона = СРО_ОбщегоНазначенияСервер.ПолучитьПредставлениеКонстактноИнформации(КПК, ТипКонтактнойИнформации, ВидКонтактнойИнформации);	
//	
//	// 10. Номер факса 	
//	ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Факс;
//	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ФаксКонтрагента;	
//	НомерФакса = СРО_ОбщегоНазначенияСервер.ПолучитьПредставлениеКонстактноИнформации(КПК, ТипКонтактнойИнформации, ВидКонтактнойИнформации);
//	
//	// 11. АдресЭлектроннойПочты

//	ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
//	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;	
//	АдресЭлектроннойПочты = СРО_ОбщегоНазначенияСервер.ПолучитьПредставлениеКонстактноИнформации(КПК, ТипКонтактнойИнформации, ВидКонтактнойИнформации);	
//	     
//	// 12. Адрес сайта в интернете 	
//	ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
//	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ВебСайтКонтрагента;	
//	АдресСайта = СРО_ОбщегоНазначенияСервер.ПолучитьПредставлениеКонстактноИнформации(КПК, ТипКонтактнойИнформации, ВидКонтактнойИнформации);
//	
//	// 13. Наименование организации, представившей отчет
//	
//	НаименованиеОрганизацииПредоставившейОтчет = СокрЛП(Объект.Организация.НаименованиеПолное);

//	
//	
КонецПроцедуры


&НаКлиенте
Процедура КПКПриИзменении(Элемент)
	//ОбновитьРеквизитыНаФорме();

	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРаздел1()
	
	ВидФормыОтчетности = Объект.ВидФормыОтчетности;
	
	Если ВидФормыОтчетности = Перечисления.ВидыФормОтчетности.До4кв2018 Тогда		
		Элементы.ТаблицаОбособленныхПодразделенияхОбъемВыданныхЗаймов.Видимость = Ложь;
		Элементы.ТаблицаОбособленныхПодразделенияхОбъемПривлеченныхСредств.Видимость = Ложь; 

	Иначе
		
		Если Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21631 
			ИЛИ Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21632 Тогда			
			Элементы.ТаблицаОбособленныхПодразделенияхОбъемВыданныхЗаймов.Видимость = Истина;
			Элементы.ТаблицаОбособленныхПодразделенияхОбъемПривлеченныхСредств.Видимость = Истина;
			
			Элементы.ТаблицаОбособленныхПодразделенияхСуммаЗадолжностиПоОснДолгуПоПредоставленнымЗаймам.Видимость = Ложь;
			Элементы.ТаблицаОбособленныхПодразделенияхСуммаПросроченнойЗадолжностиПоОснДолгуПоПредоставленнымЗаймам.Видимость = Ложь;
			
			Элементы.КонтакнаяИнформацияПодразделений.Видимость = Истина;
			
		ИначеЕсли Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633
			ИЛИ Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634 
				ИЛИ Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_2164
				ИЛИ Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21641
				ИЛИ Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21642
				ИЛИ Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21644 
				ИЛИ Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_2165 Тогда
			Элементы.ТаблицаОбособленныхПодразделенияхОбъемВыданныхЗаймов.Видимость = Истина;
			Элементы.ТаблицаОбособленныхПодразделенияхОбъемПривлеченныхСредств.Видимость = Истина;
			
			Элементы.ТаблицаОбособленныхПодразделенияхСуммаЗадолжностиПоОснДолгуПоПредоставленнымЗаймам.Видимость = Истина;
			Элементы.ТаблицаОбособленныхПодразделенияхСуммаПросроченнойЗадолжностиПоОснДолгуПоПредоставленнымЗаймам.Видимость = Истина;     			
			
			Элементы.КонтакнаяИнформацияПодразделений.Видимость = Ложь;

		КонецЕсли;		
		
		
		Это2_16_3_1_или2 = Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21631 ИЛИ Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21632;
		
	//	Элементы.ТаблицаОбособленныхПодразделенияхАдресФактическогоНахождения.Видимость = Это2_16_3_1_или2;
	//	Элементы.ТаблицаОбособленныхПодразделенияхПочтовыйАдрес.Видимость = Объект.КодДокумента = Это2_16_3_1_или2;
	//	Элементы.ТаблицаОбособленныхПодразделенияхНомерТелефона.Видимость = Это2_16_3_1_или2;
	//	Элементы.ТаблицаОбособленныхПодразделенияхНомерФакса.Видимость = Это2_16_3_1_или2;
	//	Элементы.ТаблицаОбособленныхПодразделенияхАдресЭлектроннойПочты.Видимость = Это2_16_3_1_или2; 
	
		Элементы.ТаблицаОбособленныхПодразделенияхАдресФактическогоНахождения.Видимость = Истина;
		Элементы.ТаблицаОбособленныхПодразделенияхПочтовыйАдрес.Видимость = Объект.КодДокумента = Истина;
		Элементы.ТаблицаОбособленныхПодразделенияхНомерТелефона.Видимость = Истина;
		Элементы.ТаблицаОбособленныхПодразделенияхНомерФакса.Видимость = Истина;
		Элементы.ТаблицаОбособленныхПодразделенияхАдресЭлектроннойПочты.Видимость = Истина; 

		
	КонецЕсли;	
	
КонецПроцедуры
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда 		
		ОбновитьРаздел1();               	
	КонецЕсли;                           	
	
КонецПроцедуры





&НаСервере
Процедура ВывестиТаблицуПоказателей(Раздел, ТабличныйДокумент)
	
	Код216 = Объект.КодДокумента = перечисления.КодДокумента.ОКУД_0420820_2164 
			ИЛИ Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21641
			ИЛИ Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21642
			ИЛИ Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21644
			ИЛИ Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_2165;
	// очищаем таблиынй дкоумент на в закладке
	ТабличныйДокумент.Очистить();
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");	
	Макет = ПолучитьОбщийМакет("СРО_ОтчетПоРазделам");
	//ТекОбъект.ПолучитьМакет("ТаблицаПоказателей");
	
	ОбластьШапка = Макет.получитьОбласть("Шапка");
	ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапки");
	ОбластьСтрока = Макет.получитьОбласть("Строка");   

	ВТысРублей = "тыс.руб.";
	
	КодДокумента = Объект.КодДокумента;
	
	// выбираем нужные разделы и показатели
	Если Раздел = "Раздел2" тогда
		ГруппаРазделов = Справочники.Разделы.Раздел2;
	ИначеЕсли Раздел = "Раздел3" тогда
		ГруппаРазделов = Справочники.Разделы.Раздел3;
	ИначеЕсли Раздел = "Раздел4" тогда
		ГруппаРазделов = Справочники.Разделы.Раздел4;			
		ВТысРублей = "";
		
	ИначеЕсли Раздел = "Раздел5" тогда
			
		ГруппаРазделов = Справочники.Разделы.Раздел5;
			
		Если Объект.КодДокумента = перечисления.КодДокумента.ОКУД_0420820_21631
			ИЛИ Объект.КодДокумента = перечисления.КодДокумента.ОКУД_0420820_21632 Тогда    			
			
			ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел5");
			ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел5"); 	 
		
		Иначе
		//	ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел6_21633");
		//	ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел6_21633");
			
			ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел6");
			ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел6");      
			
		КонецЕсли;

		
	ИначеЕсли Раздел = "Раздел6" тогда
		ГруппаРазделов = Справочники.Разделы.Раздел6;	
		
		Если Код216 Тогда
			ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел6_2164");
		//	ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел6_2164");      
		
		ИначеЕсли Объект.КодДокумента = перечисления.КодДокумента.ОКУД_0420820_21632 Тогда
			ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел6");
		//	ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел6");
		Иначе
			ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел6_21633");
		//	ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел6_21633");
		КонецЕсли;
		
		ВТысРублей = "";
		
	ИначеЕсли Раздел = "Раздел7" тогда
		ГруппаРазделов = Справочники.Разделы.Раздел7;	
		
		Если Код216 Тогда
			ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел9");
			ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел9");
			
			ВТысРублей = "";  
		
		ИначеЕсли КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633
			ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634 Тогда
			ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел7_21633");
			ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел7_21633"); 	
		Иначе	
			ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел7_8");
			ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел7_8"); 	
		КонецЕсли;
		 
	ИначеЕсли Раздел = "Раздел8" тогда
		
		ГруппаРазделов = Справочники.Разделы.Раздел8;	
		
		Если Код216 Тогда
			ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапки");
			ОбластьСтрока = Макет.получитьОбласть("Строка");     
			ВТысРублей = "";  
			
		ИначеЕсли КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 
			ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634 Тогда
			ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел9");
			ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел9"); 
		Иначе	                                                              			                    		
			ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел7_8");
			ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел7_8"); 	
		КонецЕсли;
		
	ИначеЕсли Раздел = "Раздел9" тогда
		ГруппаРазделов = Справочники.Разделы.Раздел9;
		
		Если КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_2165 Тогда   
			ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел9_2165");
			ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел_2165"); 
		ИначеЕсли Код216 Тогда 
			ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел9_2164");
			ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел9_2164"); 
		
		ИначеЕсли КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 
			ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634 Тогда
			ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапки");
			ОбластьСтрока = Макет.получитьОбласть("Строка");                  
			
		  			
		Иначе
			ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел9");
			ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел9"); 	
			ВТысРублей = "";
		КонецЕсли;
		
	ИначеЕсли Раздел = "Раздел10" тогда	  
		
		Если КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_2165 Тогда
			ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел10_2165");
			ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел10_2165"); 
			ВТысРублей = "";   
			
		ИначеЕсли КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633
			ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634 Тогда
			ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел10_21633");
			ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел10_21633"); 	
		Иначе
			ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел10");
			ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел10"); 	
			ОбластьЗаголовок = Макет.получитьОбласть("СтрокаРаздел10Заголовок"); 	
			ВТысРублей = "";    
		КонецЕсли;
		 		
	ИначеЕсли Раздел = "Раздел11" тогда
		
		Если Код216 Тогда
			ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел11_2164");
			ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел11_2164"); 	

		ИначеЕсли КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 
			ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634 Тогда
			ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел11_21633");
			ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел11_21633"); 	
		Иначе
			ВТысРублей = "";     	
		КонецЕсли;   
			
		ГруппаРазделов = Справочники.Разделы.Раздел11;	
		
	ИначеЕсли Раздел = "Раздел12" И КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_2164 
		И КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_21641
		И КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_21642
		И КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_21644
		И КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_2165 тогда       		
		ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел12_21633");
		ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел12_21633"); 	
		
	ИначеЕсли Раздел = "Раздел13" 
		ИЛИ (Раздел = "Раздел12" И Код216) тогда       		
		ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел13_21633");
		ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел13_21633"); 		
		
	КонецЕсли;
	
	Если Раздел = "Раздел9" И КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_2165 Тогда     
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетностьКПКТаблицаСведенийОбАудиторскихПроверках.ПолноеНаименованиеАудиторскойОрганизации КАК ПолноеНаименованиеАудиторскойОрганизации,
		|	ОтчетностьКПКТаблицаСведенийОбАудиторскихПроверках.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.ОтчетностьКПК.ТаблицаСведенийОбАудиторскихПроверках КАК ОтчетностьКПКТаблицаСведенийОбАудиторскихПроверках
		|ГДЕ
		|	ОтчетностьКПКТаблицаСведенийОбАудиторскихПроверках.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

		
	
	ИначеЕсли (Раздел = "Раздел9" И (КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21631 ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21632)) 
		ИЛИ (Раздел = "Раздел8" И (КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634))
		ИЛИ (Раздел = "Раздел7" И Код216) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетностьКПКТаблицаПоказателей.КодРаздела КАК КодРаздела,
		|	ОтчетностьКПКТаблицаПоказателей.ВидАктивов КАК ВидАктивов,
		|	ОтчетностьКПКТаблицаПоказателей.СуммаРазмещаемыхСредств КАК СуммаРазмещаемыхСредств,
		|	ОтчетностьКПКТаблицаПоказателей.НаименованиеКредитногоРейтинговогоАгенства КАК НаименованиеКредитногоРейтинговогоАгенства,
		|	ОтчетностьКПКТаблицаПоказателей.УровеньКредитногоРейтинга КАК УровеньКредитногоРейтинга
		|ИЗ
		|	Документ.ОтчетностьКПК.ТаблицаПоказателейРаздел9 КАК ОтчетностьКПКТаблицаПоказателей
		|ГДЕ
		|	ОтчетностьКПКТаблицаПоказателей.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОтчетностьКПКТаблицаПоказателей.ПорядокСортировки";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
	иначеЕсли Раздел = "Раздел10" И КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_2165 Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОтчетностьКПКТаблицаАффилированныхЛиц.НомерСтроки КАК НомерСтроки,
			|	ОтчетностьКПКТаблицаАффилированныхЛиц.ПолноеНаименованиеЮрФизЛица КАК ПолноеНаименованиеЮрФизЛица
			|ИЗ
			|	Документ.ОтчетностьКПК.ТаблицаАффилированныхЛиц КАК ОтчетностьКПКТаблицаАффилированныхЛиц
			|ГДЕ
			|	ОтчетностьКПКТаблицаАффилированныхЛиц.Ссылка = &Ссылка"; 			
				
			Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);	
	
	ИначеЕсли (Раздел = "Раздел10" И Код216)
		ИЛИ (Раздел = "Раздел11" И (КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634)) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетностьКПКТаблицаСведенийОАудиторах.Ссылка КАК Ссылка,
		|	ОтчетностьКПКТаблицаСведенийОАудиторах.НомерСтроки КАК НомерСтроки,
		|	ОтчетностьКПКТаблицаСведенийОАудиторах.ПолноеНаименованиеАудиторскойОрганизации КАК ПолноеНаименованиеАудиторскойОрганизации,
		|	ОтчетностьКПКТаблицаСведенийОАудиторах.ОГРНАудиторскойОрганизации КАК ОГРНАудиторскойОрганизации,
		|	ОтчетностьКПКТаблицаСведенийОАудиторах.ИННАудиторскойОрганизации КАК ИННАудиторскойОрганизации,
		|	ОтчетностьКПКТаблицаСведенийОАудиторах.АдресАудиторскойОрганизации КАК АдресАудиторскойОрганизации,
		|	ОтчетностьКПКТаблицаСведенийОАудиторах.ПолноеНаименованиеСРООрганизацииАудиторов КАК ПолноеНаименованиеСРООрганизацииАудиторов,
		|	ОтчетностьКПКТаблицаСведенийОАудиторах.НомерСРОАудиторов КАК НомерСРОАудиторов,
		|	ОтчетностьКПКТаблицаСведенийОАудиторах.НомерРегистрационнойЗаписиВРесстреАудиторов КАК НомерРегистрационнойЗаписиВРесстреАудиторов,
		|	ОтчетностьКПКТаблицаСведенийОАудиторах.ВидОтчетности КАК ВидОтчетности,
		|	ОтчетностьКПКТаблицаСведенийОАудиторах.ДатаЗаключения КАК ДатаЗаключения,
		|	ОтчетностьКПКТаблицаСведенийОАудиторах.ДатаНачалаПредоставленияУслуг КАК ДатаНачалаПредоставленияУслуг,
		|	ОтчетностьКПКТаблицаСведенийОАудиторах.ДатаОкончанияПредоставленияУслуг КАК ДатаОкончанияПредоставленияУслуг,
		|	ОтчетностьКПКТаблицаСведенийОАудиторах.ДатаСоставленияПоследнегоЗаключения КАК ДатаСоставленияПоследнегоЗаключения,
		|	ОтчетностьКПКТаблицаСведенийОАудиторах.СведенияОЛицахПодписавшихАудиторскоеЗаключение КАК СведенияОЛицахПодписавшихАудиторскоеЗаключение,
		|	ОтчетностьКПКТаблицаСведенийОАудиторах.МнениеВыраженноеВАудиторскомзаключении КАК МнениеВыраженноеВАудиторскомзаключении,
		|	ОтчетностьКПКТаблицаСведенийОАудиторах.ПримечаниеКАудиторскомуЗаключению КАК ПримечаниеКАудиторскомуЗаключению
		|ИЗ
		|	Документ.ОтчетностьКПК.ТаблицаСведенийОАудиторах КАК ОтчетностьКПКТаблицаСведенийОАудиторах
		|ГДЕ
		|	ОтчетностьКПКТаблицаСведенийОАудиторах.Ссылка = &Ссылка"; 			
			
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);	
		
	ИначеЕсли Раздел = "Раздел10" 
		ИЛИ (Раздел = "Раздел9" И Код216) Тогда
			
		Если КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633
			ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634 
			ИЛИ Код216 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОтчетностьКПКТаблицаСведенийОбУтвержденииПовестки.НаименованиеОрганаУтвердившегоПовестку КАК НаименованиеОрганаУтвердившегоПовестку,
			|	ОтчетностьКПКТаблицаСведенийОбУтвержденииПовестки.ДатаУтвержденияПовестки КАК ДатаУтвержденияПовестки,
			|	ОтчетностьКПКТаблицаСведенийОбУтвержденииПовестки.ДатаПроведенияОбщегоСобранияВКПК КАК ДатаПроведенияОбщегоСобранияВКПК,
			|	ОтчетностьКПКТаблицаСведенийОбУтвержденииПовестки.ВидОтчетности КАК ВидОтчетности,
			|	ОтчетностьКПКТаблицаСведенийОбУтвержденииПовестки.ПолноеНаименованиеАудиторскойОрганизации КАК ПолноеНаименованиеАудиторскойОрганизации,
			|	ОтчетностьКПКТаблицаСведенийОбУтвержденииПовестки.ОГРНАудиторскойОрганизации КАК ОГРНАудиторскойОрганизации,
			|	ОтчетностьКПКТаблицаСведенийОбУтвержденииПовестки.ИННАудиторскойОрганизации КАК ИННАудиторскойОрганизации,
			|	ОтчетностьКПКТаблицаСведенийОбУтвержденииПовестки.АдресАудиторскойОрганизации КАК АдресАудиторскойОрганизации,
			|	ОтчетностьКПКТаблицаСведенийОбУтвержденииПовестки.ПолноеНаименованиеСРООрганизацииАудиторов КАК ПолноеНаименованиеСРООрганизацииАудиторов,
			|	ОтчетностьКПКТаблицаСведенийОбУтвержденииПовестки.НомерСРОАудиторов КАК НомерСРОАудиторов,
			|	ОтчетностьКПКТаблицаСведенийОбУтвержденииПовестки.НомерРегистрационнойЗаписиВРесстреАудиторов КАК НомерРегистрационнойЗаписиВРесстреАудиторов
			|ИЗ
			|	Документ.ОтчетностьКПК.ТаблицаСведенийОбУтвержденииПовестки КАК ОтчетностьКПКТаблицаСведенийОбУтвержденииПовестки
			|ГДЕ
			|	ОтчетностьКПКТаблицаСведенийОбУтвержденииПовестки.Ссылка = &Ссылка"; 			
		Иначе	
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Ссылка КАК Ссылка,
			|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.НомерСтроки КАК НомерСтроки,
			|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.ДатаНомерДоговора КАК ДатаНомерДоговора,
			|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.ДатаНомерПротокола КАК ДатаНомерПротокола,
			|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.РазмерОбязательствНаМоментЗаключенияДоговора КАК РазмерОбязательствНаМоментЗаключенияДоговора,
			|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.РазмерОбязательствНаКонецОтчетногоПериода КАК РазмерОбязательствНаКонецОтчетногоПериода,
			|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.УсловиеИсполненияОбязательств КАК УсловиеИсполненияОбязательств,
			|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.СрокИсполненияОбязательств КАК СрокИсполненияОбязательств,
			|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.ВидДоговора КАК ВидДоговора,
			|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Комментарий КАК Комментарий
			|ИЗ
			|	Документ.ОтчетностьКПК.ТаблицаДоговоровОдобренныхОбщимСобранием КАК ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием
			|ГДЕ
			|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Ссылка = &Ссылка";
		КонецЕсли;
			
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);	
		
		
	ИначеЕсли (Раздел = "Раздел12" 
		И (КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634))
		ИЛИ (Раздел = "Раздел11" И Код216) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетностьКПКТаблицаАффилированныхЛиц.Ссылка КАК Ссылка,
		|	ОтчетностьКПКТаблицаАффилированныхЛиц.НомерСтроки КАК НомерСтроки,
		|	ОтчетностьКПКТаблицаАффилированныхЛиц.ПолноеНаименованиеЮрФизЛица КАК ПолноеНаименованиеЮрФизЛица,
		|	ОтчетностьКПКТаблицаАффилированныхЛиц.АдресЮрФизЛица КАК АдресЮрФизЛица,
		|	ОтчетностьКПКТаблицаАффилированныхЛиц.ИННАффилированногоЛица КАК ИННАффилированногоЛица,
		|	ОтчетностьКПКТаблицаАффилированныхЛиц.ДатаВозникновенияАффилированности КАК ДатаВозникновенияАффилированности,
		|	ОтчетностьКПКТаблицаАффилированныхЛиц.ДатаПрекращенияАффилированности КАК ДатаПрекращенияАффилированности,
		|	ОтчетностьКПКТаблицаАффилированныхЛиц.КодАффилированности КАК КодАффилированности,
		|	ОтчетностьКПКТаблицаАффилированныхЛиц.ОснованияАффилированностиПримечание КАК ОснованияАффилированностиПримечание
		|ИЗ
		|	Документ.ОтчетностьКПК.ТаблицаАффилированныхЛиц КАК ОтчетностьКПКТаблицаАффилированныхЛиц
		|ГДЕ
		|	ОтчетностьКПКТаблицаАффилированныхЛиц.Ссылка = &Ссылка"; 			
			
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);	
		
	ИначеЕсли Раздел = "Раздел13" 
		И (КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634)
		ИЛИ (Раздел = "Раздел12" И Код216) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетностьКПКТаблицаФондыСформированныеВКПК.НаименованиеФонда КАК НаименованиеФонда,
		|	ОтчетностьКПКТаблицаФондыСформированныеВКПК.РазмерФондаНаНачалоПериода КАК РазмерФондаНаНачалоПериода,
		|	ОтчетностьКПКТаблицаФондыСформированныеВКПК.ПоступилоЗаПериод КАК ПоступилоЗаПериод,
		|	ОтчетностьКПКТаблицаФондыСформированныеВКПК.ИзрасходованоЗаПериод КАК ИзрасходованоЗаПериод,
		|	ОтчетностьКПКТаблицаФондыСформированныеВКПК.РазмерФондаНаКонецПериода КАК РазмерФондаНаКонецПериода
		|ИЗ
		|	Документ.ОтчетностьКПК.ТаблицаФондыСформированныеВКПК КАК ОтчетностьКПКТаблицаФондыСформированныеВКПК
		|ГДЕ
		|	ОтчетностьКПКТаблицаФондыСформированныеВКПК.Ссылка = &Ссылка"; 			
		
			
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);			
		
	Иначе	
		КодДокумента = Объект.КодДокумента;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетностьКПКТаблицаПоказателей.Раздел КАК Раздел,
		|	ОтчетностьКПКТаблицаПоказателей.Раздел.КодРаздела КАК РазделКод,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель1 КАК ЗначениеПоказателя,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель2 КАК Показатель2,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель3 КАК Показатель3,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель4 КАК Показатель4,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель5 КАК Показатель5,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель6 КАК Показатель6,
		|	ОтчетностьКПКТаблицаПоказателей.Раздел.Код КАК РазделКод1,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель7 КАК Показатель7,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель8 КАК Показатель8,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель9 КАК Показатель9,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель10 КАК Показатель10,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель11 КАК Показатель11,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель12 КАК Показатель12,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель13 КАК Показатель13,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель14 КАК Показатель14,
		|	ОтчетностьКПКТаблицаПоказателей.ВидЗадолжностиОсновной КАК ВидЗадолжностиОсновной,
		|	ОтчетностьКПКТаблицаПоказателей.ВидЗадолжностиДополнительный КАК ВидЗадолжностиДополнительный,
		|	ОтчетностьКПКТаблицаПоказателей.ТипОсновнойДополнительный КАК ТипОсновнойДополнительный
		|ИЗ
		|	Документ.ОтчетностьКПК.ТаблицаПоказателей КАК ОтчетностьКПКТаблицаПоказателей
		|ГДЕ
		|	ОтчетностьКПКТаблицаПоказателей.Ссылка = &Ссылка
		|	И ОтчетностьКПКТаблицаПоказателей.Раздел В ИЕРАРХИИ(&ГруппаРазделов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОтчетностьКПКТаблицаПоказателей.Раздел.ПорядокСортировки";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.УстановитьПараметр("ГруппаРазделов", ГруппаРазделов);
		
		Запрос.УстановитьПараметр("КодДокумента", ?(КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634, Перечисления.КодДокумента.ОКУД_0420820_21633, КодДокумента));

	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;		
	КонецЕсли;
	
	Если Раздел = "Раздел4" Тогда
		Если (Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 ИЛИ Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634) Тогда
			ОбластьШапка.Параметры.НазваниеРаздела = "Раздел IV. Сведения о членах КПК, заключенных договорах, привлеченных и размещенных средствах";  	
		ИначеЕсли Код216 Тогда	
			ОбластьШапка.Параметры.НазваниеРаздела = "Раздел IV. Сведения о показателях деятельности КПК";  	
		КонецЕсли;
		
	ИначеЕсли Раздел = "Раздел5" 
		И (Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 ИЛИ Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634
		 ИЛИ Код216) Тогда
		ОбластьШапка.Параметры.НазваниеРаздела = "Раздел V. Данные о средневзвешенных значениях полной стоимости потребительских займов по категориям потребительских займов";  	

	ИначеЕсли Раздел = "Раздел6" Тогда
		Если (Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 ИЛИ Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634) Тогда
			ОбластьШапка.Параметры.НазваниеРаздела = "Раздел VI. Данные о структуре задолженности по предоставленным займам";  	
		ИначеЕсли Код216 Тогда	
			ОбластьШапка.Параметры.НазваниеРаздела = "Раздел VI. Данные о структуре задолженности по предоставленным займам и размере сформированных резервов на возможные потери по займам";  	
		КонецЕсли;
	
		
	ИначеЕсли Раздел = "Раздел7" Тогда                                                                             		
		Если  Код216 Тогда
			ОбластьШапка.Параметры.НазваниеРаздела = "Раздел VII. Данные о размещении средств резервных фондов";
		ИначеЕсли Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 ИЛИ Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634 Тогда
			ОбластьШапка.Параметры.НазваниеРаздела = "Раздел VII. Данные о размере сформированных резервов на возможные потери по займам";
		КонецЕсли;
		
	ИначеЕсли Раздел = "Раздел8"  Тогда
		
		Если Код216 Тогда
			ОбластьШапка.Параметры.НазваниеРаздела = "Раздел VIII. Числовые значения финансовых нормативов";	
		ИначеЕсли  (Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 ИЛИ Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634) Тогда
			ОбластьШапка.Параметры.НазваниеРаздела = "Раздел VIII. Данные о размещении средств резервных фондов";	
		КонецЕсли;
	
	ИначеЕсли Раздел = "Раздел9" Тогда 
		Если КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_2165 Тогда    	
			ОбластьШапка.Параметры.НазваниеРаздела = "Раздел IX. Сведения об аудиторской проверке";  

		ИначеЕсли Код216 Тогда
		    ОбластьШапка.Параметры.НазваниеРаздела = "Раздел IX. Сведения об утверждении повестки дня общего собрания членов КПК, содержащей вопрос об утверждении аудиторской организации (аудитора)";						
		ИначеЕсли Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 ИЛИ Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634 Тогда
			ОбластьШапка.Параметры.НазваниеРаздела = "Раздел IX. Числовые значения финансовых нормативов";  
				Иначе
			ОбластьШапка.Параметры.НазваниеРаздела = "Раздел IX. Данные о размещении средств резервных фондов";  		
		КонецЕсли;
	ИначеЕсли Раздел = "Раздел10" тогда 	
		
		Если Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_2165 Тогда
			ОбластьШапка.Параметры.НазваниеРаздела = "Раздел X. Аффилированные лица";	
			
		ИначеЕсли Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 ИЛИ Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634 Тогда
			ОбластьШапка.Параметры.НазваниеРаздела = "Раздел X. Сведения об утверждении повестки дня общего собрания членов КПК, содержащей вопрос об утверждении аудиторской организации (аудитора)";	
		Иначе
			ОбластьШапка.Параметры.НазваниеРаздела = "Раздел X. Информация о договорах, одобренных общим собранием";	
		КонецЕсли;
		
	ИначеЕсли Раздел = "Раздел11" тогда 
		Если Код216 Тогда
			ОбластьШапка.Параметры.НазваниеРаздела = "Раздел XI. Аффилированные лица";
			
		ИНачеЕсли Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 ИЛИ Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634 Тогда
			ОбластьШапка.Параметры.НазваниеРаздела = "Раздел XI. Сведения об аудиторской организации (аудиторе)";	
		Иначе
			ОбластьШапка.Параметры.НазваниеРаздела = ГруппаРазделов.ПолноеНаименование;
		КонецЕсли;
		
	ИначеЕсли Раздел = "Раздел12" тогда
		
		Если Код216 Тогда     			
			ОбластьШапка.Параметры.НазваниеРаздела = "Раздел XII. Информация о фондах, сформированных в КПК (паевой, резервный фонд, фонд финансовой взаимопомощи и иные)";
		Иначе		
			ОбластьШапка.Параметры.НазваниеРаздела = "Раздел XII. Аффилированные лица";
		КонецЕсли;
		
	ИначеЕсли Раздел = "Раздел13" тогда 	
		ОбластьШапка.Параметры.НазваниеРаздела = "Раздел XIII. Информация о фондах, сформированных в КПК (паевой, резервный фонд, фонд финансовой взаимопомощи и иные)";	
	  
	Иначе	
		ОбластьШапка.Параметры.НазваниеРаздела = ГруппаРазделов.ПолноеНаименование;
	КонецЕсли;
	
	ОбластьШапка.Параметры.ВТысРублей = ВТысРублей;
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьЗаголовкиШапки);   	
	
	
	//ЦветРаздел1Уровня = Новый Цвет(59, 224, 66);
	ЦветРаздел1Уровня = Новый Цвет(145, 235, 149);
	ЦветРаздел2Уровня = Новый Цвет(174, 255, 187);  // 227, 255, 225
	
	ПоследняяКолонкаОбласти = 14;
	

	Если Раздел = "Раздел5" Тогда	
		ПоследняяКолонкаОбласти = 15;
	
	ИначеЕсли Раздел = "Раздел6" Тогда
		
		ПоследняяКолонкаОбласти = 15;
		
		Если КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633
			ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634 Тогда
			ПоследняяКолонкаОбласти = 34;
		ИначеЕсли Код216 Тогда
			ПоследняяКолонкаОбласти = 21;    	
		КонецЕсли;   
		
	ИначеЕсли Раздел = "Раздел7"
		ИЛИ (Раздел = "Раздел8" И КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_21633
		И КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_21634
		И КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_2164
		И КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_21641
		И КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_21642
		И КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_21644
		И КодДокумента <> Перечисления.КодДокумента.ОКУД_0420820_2165) Тогда
		
		ПоследняяКолонкаОбласти = 17;
		
		Если Раздел = "Раздел7"
			И (КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634) Тогда
			ПоследняяКолонкаОбласти = 32;
		КонецЕсли; 		
	КонецЕсли; 		
	
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
	
	Выборка = РезультатЗапроса.Выбрать(); 	
	
	Пока Выборка.Следующий() Цикл
		
		Если (Раздел = "Раздел9" И (КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21632))
			ИЛИ (Раздел = "Раздел8" И (КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634))
				ИЛИ (Раздел = "Раздел7" И Код216) Тогда
			ОбластьСтрока.Параметры.КодРаздела = Выборка.КодРаздела;
			ОбластьСтрока.Параметры.ВидАктивов = Выборка.ВидАктивов;
			ОбластьСтрока.Параметры.СуммаРазмещаемыхСредств = Выборка.СуммаРазмещаемыхСредств;
			ОбластьСтрока.Параметры.НаименованиеКредитногоРейтинговогоАгенства = Выборка.НаименованиеКредитногоРейтинговогоАгенства;
			ОбластьСтрока.Параметры.УровеньКредитногоРейтинга = Выборка.УровеньКредитногоРейтинга; 	
			
			Если Выборка.НаименованиеКредитногоРейтинговогоАгенства = "X" Тогда
				ОбластьСтрока.Область(1, 1, 1, ПоследняяКолонкаОбласти).ЦветФона = ЦветРаздел2Уровня;
		    Иначе	
				ОбластьСтрока.Область(1, 1, 1, ПоследняяКолонкаОбласти).ЦветФона = WebЦвета.Белый;
			КонецЕсли;  		
			
		ИначеЕсли (Раздел = "Раздел9" И Код216)
			ИЛИ Раздел = "Раздел10" Тогда			
			
			Если КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633
				ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634
				ИЛИ Код216 Тогда
				ОбластьСтрока.Параметры.Заполнить(Выборка);
				
			Иначе	
				Если СокрЛП(Выборка.Комментарий) <> "" тогда
					Если Выборка.ВидДоговора = "ДоговорыЗайма" Тогда
						ОбластьЗаголовок.Параметры.НомерСтроки = "1";	
					Иначе
						ОбластьЗаголовок.Параметры.НомерСтроки = "2";		
					КонецЕсли;
					
					ОбластьЗаголовок.Параметры.Комментарий = Выборка.Комментарий;
								
					ТабличныйДокумент.Вывести(ОбластьЗаголовок); 	
					Продолжить;
				КонецЕсли;
				
				ОбластьСтрока.Параметры.НомерСтроки	 = "-";
				ОбластьСтрока.Параметры.ДатаНомерДоговора		 = Выборка.ДатаНомерДоговора;
				ОбластьСтрока.Параметры.ДатаНомерПротокола		 = Выборка.ДатаНомерПротокола;						
				ОбластьСтрока.Параметры.РазмерОбязательствНаМоментЗаключенияДоговора	 = Выборка.РазмерОбязательствНаМоментЗаключенияДоговора;
				ОбластьСтрока.Параметры.РазмерОбязательствНаКонецОтчетногоПериода	 = Выборка.РазмерОбязательствНаКонецОтчетногоПериода;
				ОбластьСтрока.Параметры.УсловиеИсполненияОбязательств		 = Выборка.УсловиеИсполненияОбязательств;
				ОбластьСтрока.Параметры.СрокИсполненияОбязательств		 = Выборка.СрокИсполненияОбязательств;	
			КонецЕсли;
			
		ИначеЕсли (Раздел = "Раздел11" Или Раздел = "Раздел12" Или Раздел = "Раздел13") 
			И (КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634) Тогда			
			ОбластьСтрока.Параметры.Заполнить(Выборка);   	
			
		ИначеЕсли Раздел = "Раздел11" И Код216 Тогда			
			ОбластьСтрока.Параметры.Заполнить(Выборка);  
			
			ДатаВозникновенияАффилированности = Выборка.ДатаВозникновенияАффилированности;
			
			Если ДатаВозникновенияАффилированности = Дата(3999, 1, 1) Тогда		
				ОбластьСтрока.Параметры.ДатаВозникновенияАффилированности = "-";
			ИначеЕсли ДатаВозникновенияАффилированности = Дата(1, 1, 1) Тогда		
				ОбластьСтрока.Параметры.ДатаВозникновенияАффилированности = "";
			КонецЕсли;		
			
			ДатаПрекращенияАффилированности = Выборка.ДатаПрекращенияАффилированности; 		
			Если ДатаПрекращенияАффилированности = Дата(3999, 1, 1) Тогда		
				ОбластьСтрока.Параметры.ДатаПрекращенияАффилированности = "-";
			ИначеЕсли ДатаПрекращенияАффилированности = Дата(1, 1, 1) Тогда		
				ОбластьСтрока.Параметры.ДатаПрекращенияАффилированности = "";
			КонецЕсли;
			
		ИначеЕсли  Раздел = "Раздел12" И Код216 Тогда   
			ОбластьСтрока.Параметры.Заполнить(Выборка);   	
			
			ОбластьСтрока.Параметры.ИзрасходованоЗаПериод	   = ?(Выборка.ИзрасходованоЗаПериод = -99999, "-", Выборка.ИзрасходованоЗаПериод);	
			ОбластьСтрока.Параметры.ПоступилоЗаПериод		   = ?(Выборка.ПоступилоЗаПериод = -99999, "-", Выборка.ПоступилоЗаПериод);	
			ОбластьСтрока.Параметры.РазмерФондаНаКонецПериода  = ?(Выборка.РазмерФондаНаКонецПериода = -99999, "-", Выборка.РазмерФондаНаКонецПериода);
			ОбластьСтрока.Параметры.РазмерФондаНаНачалоПериода = ?(Выборка.РазмерФондаНаНачалоПериода = -99999, "-", Выборка.РазмерФондаНаНачалоПериода);	
			
						
		Иначе	

			Поз = СтрНайти(Выборка.РазделКод, "_");
			
			Если Поз > 0 Тогда     			
				ОбластьСтрока.Параметры.КодРаздела = Сред(Выборка.РазделКод, Поз + 1);
			Иначе	
				ОбластьСтрока.Параметры.КодРаздела = СокрЛП(Выборка.РазделКод);
			КонецЕсли;  
			
			Если Раздел = "Раздел9" 
				И (КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634) Тогда 
				
			ИначеЕсли Раздел = "Раздел5"
				ИЛИ Раздел = "Раздел6"
				ИЛИ Раздел = "Раздел7" 
				ИЛИ Раздел = "Раздел8" Тогда
				
				
				Если Раздел = "Раздел6" Тогда
					
					Если Код216 Тогда
						
						Если  Выборка.ЗначениеПоказателя = -99999 Тогда
							ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел6_21634_Группа");      
						Иначе
							ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел6_2164");      
						КонецЕсли;
						
					ИНаче	
						Если Объект.КодДокумента = перечисления.КодДокумента.ОКУД_0420820_21632 Тогда		
							ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел6");
						Иначе
							ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел6_21633");
						КонецЕсли;
						
						Если Выборка.Раздел.Уровень() = 1 Тогда
							ОбластьСтрока.Область(1, 1, 1, ПоследняяКолонкаОбласти).ЦветФона = ЦветРаздел2Уровня;
					    Иначе	
							ОбластьСтрока.Область(1, 1, 1, ПоследняяКолонкаОбласти).ЦветФона = WebЦвета.Белый;
						КонецЕсли;   	

					КонецЕсли;
					
					Поз = СтрНайти(Выборка.РазделКод, "_");
			
					Если Поз > 0 Тогда     			
						ОбластьСтрока.Параметры.КодРаздела = Сред(Выборка.РазделКод, Поз + 1);
					Иначе	
						ОбластьСтрока.Параметры.КодРаздела = СокрЛП(Выборка.РазделКод);
					КонецЕсли;  
					
				ИначеЕсли Раздел = "Раздел8" И Код216 Тогда     
					Если Выборка.Раздел.Уровень() = 1 Тогда
						ОбластьСтрока.Область(1, 1, 1, ПоследняяКолонкаОбласти).ЦветФона = ЦветРаздел2Уровня;
				    Иначе	
						ОбластьСтрока.Область(1, 1, 1, ПоследняяКолонкаОбласти).ЦветФона = WebЦвета.Белый;
					КонецЕсли; 

				КонецЕсли;

				
				Если Раздел = "Раздел5" И Код216 Тогда
					Если Выборка.ЗначениеПоказателя = -99999 Тогда
						ОбластьСтрока.Область(1, 1, 1, ПоследняяКолонкаОбласти).ЦветФона = ЦветРаздел2Уровня;
				    Иначе	
						ОбластьСтрока.Область(1, 1, 1, ПоследняяКолонкаОбласти).ЦветФона = WebЦвета.Белый;
					КонецЕсли;   	
				//Иначе	
				//	Если Выборка.Раздел.Уровень() = 1 Тогда
				//		ОбластьСтрока.Область(1, 1, 1, ПоследняяКолонкаОбласти).ЦветФона = ЦветРаздел2Уровня;
				//    Иначе	
				//		ОбластьСтрока.Область(1, 1, 1, ПоследняяКолонкаОбласти).ЦветФона = WebЦвета.Белый;
				//	КонецЕсли;   	
				КонецЕсли;
			Иначе	

				Если Выборка.Раздел.Уровень() = 1 Тогда
					ОбластьСтрока.Область(1, 1, 1, ПоследняяКолонкаОбласти).ЦветФона = ЦветРаздел1Уровня;
				ИначеЕсли Выборка.Раздел.Уровень() = 2 Тогда
					ОбластьСтрока.Область(1, 1, 1, ПоследняяКолонкаОбласти).ЦветФона = ЦветРаздел2Уровня;
				//ИначеЕсли Выборка.Раздел.Уровень() = 3 Тогда
				//	ОбластьСтрока.Область(1, 1, 1, ПоследняяКолонкаОбласти).ЦветФона = ЦветРаздел3Уровня;
			    Иначе	
					ОбластьСтрока.Область(1, 1, 1, ПоследняяКолонкаОбласти).ЦветФона = WebЦвета.Белый;
				КонецЕсли;   	
			КонецЕсли;                                    
			
			ДобавляемыйОтступ = ""; 			
			
			
			Если Выборка.Раздел.Уровень() > 1 Тогда
				Для сч = 1 по Выборка.Раздел.Уровень()-1 Цикл
					ДобавляемыйОтступ = ДобавляемыйОтступ + "  ";					
				КонецЦикла;                                  					
			КонецЕсли;
			
			ОбластьСтрока.Параметры.НаименованиеПоказателя = ДобавляемыйОтступ + СРО_ЗагрузкаОтчетности.ПолучитьНазваниеРазделаПоКодуДокумента(Выборка.Раздел, КодДокумента);	
			
			Если НЕ (Раздел = "Раздел6" И Код216
				И Выборка.ЗначениеПоказателя = -99999) Тогда				
				ОбластьСтрока.Параметры.ЗначениеПоказателя = ПолучитьФорматДляРаздела6(Выборка.ЗначениеПоказателя, Раздел, КодДокумента);
			КонецЕсли;

			//Если  Раздел = "Раздел6" И  КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 Тогда   
			//	ОбластьСтрока.Параметры.ЗначениеПоказателя = ?(Выборка.ЗначениеПоказателя=-99999, "Х", Формат(Выборка.ЗначениеПоказателя, "ЧЦ=15; ЧДЦ=3"));
			//Иначе	
			//	ОбластьСтрока.Параметры.ЗначениеПоказателя = ?(Выборка.ЗначениеПоказателя=-99999, "Х", Выборка.ЗначениеПоказателя);
			//КонецЕсли;
					
			Если Раздел = "Раздел5"
				ИЛИ Раздел = "Раздел6" 
				ИЛИ Раздел = "Раздел7"
				ИЛИ Раздел = "Раздел8" Тогда
				
				Если Раздел = "Раздел8" И Код216 Тогда
				
				ИначеЕсли НЕ (Раздел = "Раздел6" И Код216
					И Выборка.ЗначениеПоказателя = -99999) Тогда	
					ОбластьСтрока.Параметры.Показатель2 = ПолучитьФорматДляРаздела6(Выборка.Показатель2, Раздел, КодДокумента);
					ОбластьСтрока.Параметры.Показатель3 = ПолучитьФорматДляРаздела6(Выборка.Показатель3, Раздел, КодДокумента);

						
					//Если  Раздел = "Раздел6" И КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 Тогда   
					//	ОбластьСтрока.Параметры.Показатель2 = ?(Выборка.Показатель2 =-99999, "Х", Формат(Выборка.Показатель2, "ЧЦ=15; ЧДЦ=3")); 
					//	ОбластьСтрока.Параметры.Показатель3 = ?(Выборка.Показатель3 =-99999, "Х", Формат(Выборка.Показатель3, "ЧЦ=15; ЧДЦ=3"));
					//Иначе
					//	ОбластьСтрока.Параметры.Показатель2 = ?(Выборка.Показатель2 =-99999, "Х", Выборка.Показатель2); 
					//	ОбластьСтрока.Параметры.Показатель3 = ?(Выборка.Показатель3 =-99999, "Х", Выборка.Показатель3);
					//КонецЕсли;
					
					Если Раздел = "Раздел5" И (КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21631 ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21632) Тогда
						Показатель4 = Выборка.Показатель4 ;
						Если Выборка.Показатель4 = -77777 Тогда
							Показатель4 = "-";
						ИначеЕсли Выборка.Показатель4 = -99999 Тогда
							Показатель4 = "Х";
						КонецЕсли;
						
						ОбластьСтрока.Параметры.Показатель4 = Показатель4;  	
					ИначеЕсли Раздел = "Раздел6" 
						И (КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634  
						ИЛИ Код216) 
						ИЛИ Раздел = "Раздел7" ИЛИ Раздел = "Раздел8" Тогда
						
						
						ОбластьСтрока.Параметры.Показатель4 = ПолучитьФорматДляРаздела6(Выборка.Показатель4, Раздел, КодДокумента);
						ОбластьСтрока.Параметры.Показатель5 = ПолучитьФорматДляРаздела6(Выборка.Показатель5, Раздел, КодДокумента);
						ОбластьСтрока.Параметры.Показатель6 = ПолучитьФорматДляРаздела6(Выборка.Показатель6, Раздел, КодДокумента);

									
						
						Если (Раздел = "Раздел6" ИЛИ Раздел = "Раздел7")
							И (КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634
							ИЛИ Код216) Тогда
						
							ОбластьСтрока.Параметры.Показатель7 = ПолучитьФорматДляРаздела6(Выборка.Показатель7, Раздел, КодДокумента);
							ОбластьСтрока.Параметры.Показатель8 = ПолучитьФорматДляРаздела6(Выборка.Показатель8, Раздел, КодДокумента);
							ОбластьСтрока.Параметры.Показатель9 = ПолучитьФорматДляРаздела6(Выборка.Показатель9, Раздел, КодДокумента);
							ОбластьСтрока.Параметры.Показатель10 = ПолучитьФорматДляРаздела6(Выборка.Показатель10, Раздел, КодДокумента);
							ОбластьСтрока.Параметры.Показатель11 = ПолучитьФорматДляРаздела6(Выборка.Показатель11, Раздел, КодДокумента);
							ОбластьСтрока.Параметры.Показатель12 = ПолучитьФорматДляРаздела6(Выборка.Показатель12, Раздел, КодДокумента);
							
							Если Раздел = "Раздел6" Тогда
								Если Код216 Тогда
									ОбластьСтрока.Параметры.ВидЗадолжностиОсновной = ПолучитьФорматДляРаздела6(Выборка.ВидЗадолжностиОсновной, Раздел, КодДокумента);
									ОбластьСтрока.Параметры.ВидЗадолжностиДополнительный = ПолучитьФорматДляРаздела6(Выборка.ВидЗадолжностиДополнительный, Раздел, КодДокумента);
								Иначе	
									ОбластьСтрока.Параметры.Показатель13 = ПолучитьФорматДляРаздела6(Выборка.Показатель13, Раздел, КодДокумента);
									ОбластьСтрока.Параметры.Показатель14 = ПолучитьФорматДляРаздела6(Выборка.Показатель14, Раздел, КодДокумента);
								КонецЕсли;
							КонецЕсли;

   
														
						КонецЕсли;
			
					КонецЕсли;	
				КонецЕсли;	
			Иначе   					
				Если Выборка.ЗначениеПоказателя <>-77777 И Выборка.ЗначениеПоказателя <>-99999 И Выборка.ЗначениеПоказателя < 0 Тогда
					ОбластьСтрока.Область(1, 12, 1, 14).ЦветТекста = WebЦвета.Красный;
				Иначе
					ОбластьСтрока.Область(1, 12, 1, 14).ЦветТекста = WebЦвета.Черный;				
				КонецЕсли; 				
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			ТабличныйДокумент.Вывести(ОбластьСтрока, Выборка.Раздел.Уровень());
		Исключение	
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецПопытки;
		
	КонецЦикла;  
	
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок(); 
	
КонецПроцедуры

Функция ПолучитьФорматДляРаздела6(Показатель, Раздел, КодДокумента)
	
	Если Показатель = -77777 Тогда
		ЗначениеПоказателя = "-";
	ИначеЕсли (Раздел = "Раздел6" ИЛИ Раздел = "Раздел7") И  (КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634
		ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_2164
		ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21641
		ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21642
		ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21644
		ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_2165) Тогда   		
		ЗначениеПоказателя = ?(Показатель =-99999, "Х", Формат(Показатель, "ЧЦ=15; ЧДЦ=3; ЧН=0,000"));
		
	ИначеЕсли Раздел = "Раздел8"  И  
		(КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_2164 ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21641
		ИЛИ КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21642) Тогда   		
		ЗначениеПоказателя = ?(Показатель =-99999, "", Формат(Показатель, "ЧЦ=15; ЧДЦ=3; ЧН=0,000"));
	
	Иначе	
		ЗначениеПоказателя = ?(Показатель =-99999, "Х", Показатель);
	КонецЕсли;

	Возврат ЗначениеПоказателя;
	
КонецФункции

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
		
	Если ТекущаяСтраница.Имя = "Раздел2" Тогда
		ВывестиТаблицуПоказателей("Раздел2", ТаблицаПоказателей);
		
	ИначеЕсли ТекущаяСтраница.Имя = "Раздел3" Тогда
		ВывестиТаблицуПоказателей("Раздел3", ТаблицаПоказателей);	
	
	ИначеЕсли ТекущаяСтраница.Имя = "Раздел4" Тогда
		ВывестиТаблицуПоказателей("Раздел4", ТаблицаПоказателей);	
		
	ИначеЕсли ТекущаяСтраница.Имя = "Раздел5" Тогда
		ВывестиТаблицуПоказателей("Раздел5", ТаблицаПоказателей);	
		
	ИначеЕсли ТекущаяСтраница.Имя = "Раздел6" Тогда
		ВывестиТаблицуПоказателей("Раздел6", ТаблицаПоказателей);
		
	ИначеЕсли ТекущаяСтраница.Имя = "Раздел7" Тогда
		ВывестиТаблицуПоказателей("Раздел7", ТаблицаПоказателей);	
		
	ИначеЕсли ТекущаяСтраница.Имя = "Раздел8" Тогда
		ВывестиТаблицуПоказателей("Раздел8", ТаблицаПоказателей);
		
	ИначеЕсли ТекущаяСтраница.Имя = "Раздел9" Тогда
		ВывестиТаблицуПоказателей("Раздел9", ТаблицаПоказателей);
		
	ИначеЕсли ТекущаяСтраница.Имя = "Раздел10" Тогда
		ВывестиТаблицуПоказателей("Раздел10", ТаблицаПоказателей);	
		
	ИначеЕсли ТекущаяСтраница.Имя = "Раздел11" Тогда
		ВывестиТаблицуПоказателей("Раздел11", ТаблицаПоказателей);	
		
	ИначеЕсли ТекущаяСтраница.Имя = "Раздел12" Тогда
		ВывестиТаблицуПоказателей("Раздел12", ТаблицаПоказателей);	
		
	ИначеЕсли ТекущаяСтраница.Имя = "Раздел13" Тогда
		ВывестиТаблицуПоказателей("Раздел13", ТаблицаПоказателей);	
	//ИначеЕсли ТекущаяСтраница.Имя = "Раздел8" Тогда
	//	ВывестиТаблицуПоказателей("Раздел8", ТаблицаПоказателей);		
	//	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПриВыбореПодразделения(ИдентификаторПодразделения) 	
	
	КонтакнаяИнформацияПодразделений.Параметры.УстановитьЗначениеПараметра("ИдентификаторПодразделения", ИдентификаторПодразделения);   
	КонтакнаяИнформацияПодразделений.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);   
	
	ТаблицаАдресовМестаНахожденияОбособленныхПодразделений.Параметры.УстановитьЗначениеПараметра("ИдентификаторПодразделения", ИдентификаторПодразделения);   
	ТаблицаАдресовМестаНахожденияОбособленныхПодразделений.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);   

		
КонецПроцедуры


//&НаСервере
//Функция ПолучитьИдентификаторПодразделения()
//	
//	Возврат Объект.ТаблицаОбособленныхПодразделениях[0].ИдентификаторПодразделения;
//	
//	
//КонецФункции

&НаКлиенте
Процедура ТаблицаОбособленныхПодразделенияхПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ТаблицаОбособленныхПодразделениях.ТекущиеДанные <> Неопределено Тогда
		ИдентификаторПодразделения = Элементы.ТаблицаОбособленныхПодразделениях.ТекущиеДанные.ИдентификаторПодразделения;	
	Иначе
		ИдентификаторПодразделения = Новый УникальныйИдентификатор();
	КонецЕсли;
	
	УстановитьОтборПриВыбореПодразделения(ИдентификаторПодразделения);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетнаяДатаПриИзменении(Элемент)
	
	//Если Объект.ДатаОкончанияОтчетногоПериода <> НачалоДня(КонецКвартала(Объект.ДатаОкончанияОтчетногоПериода)) Тогда
	//	Объект.ДатаОкончанияОтчетногоПериода = Объект.ОтчетнаяДата;
	//КонецЕсли;   		
	//
КонецПроцедуры

