
&НаСервере
Процедура СформироватьНаСервере(ТабличныйДокумент, КраткийРеестр) 	
	
	ЭтотОбъект.РезультатРазделы.Очистить();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДатаНачалаОтчета", ПериодОтчета.ДатаНачала);
	СтруктураПараметров.Вставить("ДатаОкончанияОтчета", КонецДня(ПериодОтчета.ДатаОкончания));    	
	СтруктураПараметров.Вставить("флФильтрыПоАктивам", флФильтрыПоАктивам);
	СтруктураПараметров.Вставить("АктивыОт", АктивыОт); 	
	СтруктураПараметров.Вставить("АктивыДо", АктивыДо); 	
	СтруктураПараметров.Вставить("флФильтрПоКоличествуЧленов", флФильтрПоКоличествуЧленов);
	СтруктураПараметров.Вставить("КоличествоЧленовОт", КоличествоЧленовОт);    
	СтруктураПараметров.Вставить("КоличествоЧленовДо", КоличествоЧленовДо);     	
	СтруктураПараметров.Вставить("флФильтрПоКоличествуРегионов", флФильтрПоКоличествуРегионов);
	СтруктураПараметров.Вставить("КоличествоРегионовДляОтбора", КоличествоРегионовДляОтбора);    	
	СтруктураПараметров.Вставить("флВыводитьРеестр", флВыводитьРеестр);      	
	СтруктураПараметров.Вставить("флВыводитьСопроводительноеПисьмо", флВыводитьСопроводительноеПисьмо);     
	
	СтруктураПараметров.Вставить("МассивКПК", СписокКПК.ВыгрузитьЗначения());  
	СтруктураПараметров.Вставить("СписокРазделов", СписокРазделов.Скопировать());  

	СтруктураПараметров.Вставить("ВсеРазделы", ВсеРазделы);  
	
	СтруктураПараметров.Вставить("ТабличныйДокумент", ТабличныйДокумент);   
	СтруктураПараметров.Вставить("КраткийРеестр", КраткийРеестр);         
	
	МассивТабличныхДокументов = Отчеты.СРО_ОтчетПоРазделамДокументовОтчетности.СформироватьТабличныеДокументы(СтруктураПараметров); 	
	ТекТабличныйДокумент = МассивТабличныхДокументов[0];
	
	ЭтотОбъект.РезультатРазделы.Вывести(ТекТабличныйДокумент);	 
	
КонецПроцедуры



&НаКлиенте
Процедура Сформировать(Команда) 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	КраткийРеестр = Новый ТабличныйДокумент;

	СформироватьНаСервере(ТабличныйДокумент, КраткийРеестр);
	
	Если флВыводитьРеестр Тогда
		КраткийРеестр.Показать("Краткий реестр КПК");
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
Функция ПолучитьКПКДокумента(ВыбДокумент)
	//Если ТипЗнч(ВыбДокумент) = Тип("ДокументСсылка.ОтчетностьКПК") 
	//	ИЛИ ТипЗнч(ВыбДокумент) = Тип("ДокументОбъект.ОтчетностьКПК") Тогда
	//	Возврат ВыбДокумент.КПК;
	//Иначе
	//	Возврат Неопределено;		
	//КонецЕсли;
	
КонецФункции


&НаСервере

Процедура ЗаполнитьСписокРазделовНаСервере()
	СписокРазделов.Добавить(Справочники.Разделы.Раздел1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел4);    
	СписокРазделов.Добавить(Справочники.Разделы.Раздел9);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел10);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если СписокРазделов.Количество() = 0 Тогда  
		ЗаполнитьСписокРазделовНаСервере();		
	КонецЕсли;	
	
	ОбновитьДоступностьРеквизитов();
	
	КоличествоРегионовДляОтбора = 2;

	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьРеквизитов()
	
	Элементы.АктивыОт.Доступность = флФильтрыПоАктивам;
	Элементы.АктивыДо.Доступность = флФильтрыПоАктивам;
	
	Элементы.КоличествоЧленовОт.Доступность = флФильтрПоКоличествуЧленов;
	Элементы.КоличествоЧленовДо.Доступность = флФильтрПоКоличествуЧленов;
	
	Элементы.КоличествоРегионовДляОтбора.Доступность = флФильтрПоКоличествуРегионов;
	
	Элементы.СписокРазделов.Доступность = НЕ ВсеРазделы;     	
	Элементы.флВыводитьСопроводительноеПисьмо.Доступность = НЕ ВсеРазделы;

КонецПроцедуры


&НаКлиенте
Процедура флФильтрыПоАктивамПриИзменении(Элемент)
	ОбновитьДоступностьРеквизитов();
КонецПроцедуры


&НаКлиенте
Процедура флФильтрПоКоличествуЧленовПриИзменении(Элемент)
	ОбновитьДоступностьРеквизитов();    
КонецПроцедуры


&НаКлиенте
Процедура флФильтрПоКоличествуРегионовПриИзменении(Элемент)
	ОбновитьДоступностьРеквизитов(); 
КонецПроцедуры


&НаКлиенте
Процедура ВсеРазделыПриИзменении(Элемент)
	ОбновитьДоступностьРеквизитов();
	
КонецПроцедуры

