

Процедура ЗаполнитьТаблицуСчетов(ТаблицаКредитныхСчетов, ТаблицаДляСверки, ТаблицаТекущегоДокумента = Истина)
	
	Для Каждого ТекСтрока Из ТаблицаКредитныхСчетов Цикл
		
		Если ТекСтрока.СуммаНаНачалоОтчетногоПериода <= 0 И ТаблицаТекущегоДокумента = Истина Тогда
			Продолжить;				
		КонецЕсли;
		
		Если ТекСтрока.СуммаНаКонецОтчетногоПериода <= 0 И ТаблицаТекущегоДокумента = Ложь Тогда
			Продолжить;			
		КонецЕсли;  
		
		НоваяСтрока = ТаблицаДляСверки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		
		Если ТаблицаТекущегоДокумента = Истина Тогда
			НоваяСтрока.СуммаНаКонецОтчетногоПериода = 0;			
		Иначе
			НоваяСтрока.СуммаНаНачалоОтчетногоПериода = 0;
		КонецЕсли;    		
		
	КонецЦикла;
	
КонецПроцедуры



&НаСервере
Процедура СформироватьСводныйОтчетОрезультатахПроведенныхМероприятий(ТабличныйДокумент)
	
	Отчет.ТаблицаОшибок.Очистить();
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет"); 	 
	
	СтруктураПараметров  = Новый Структура();      	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МассивКПК", СписокКПК.ВыгрузитьЗначения());   	
	СтруктураПараметров.Вставить("МассивУправленияГУ", СписокУправленийГУ.ВыгрузитьЗначения());   	
	СтруктураПараметров.Вставить("ВидОтбора_КПК_УправлениеГУ", ВидОтбора_КПК_УправлениеГУ); 
	
	СтруктураПараметров.Вставить("ДатаНачалаОтчета", ПериодОтчета.ДатаНачала);
	СтруктураПараметров.Вставить("ДатаОкончанияОтчета", КонецКвартала(ПериодОтчета.ДатаОкончания)); 	
	СтруктураПараметров.Вставить("ОтчетностьСРО", Отчет.ОтчетностьСРО); 	
	СтруктураПараметров.Вставить("ОтборПоПредварительнаяПроверка", Отчет.ПредварительнаяПроверка);
	СтруктураПараметров.Вставить("ПредварительнаяПроверка", Отчет.ПредварительнаяПроверка); 
	СтруктураПараметров.Вставить("ВидОтчета", ВидОтчета); 
	СтруктураПараметров.Вставить("ВыводитьТолькоКПКСОтчетностью", ВыводитьТолькоКПКСОтчетностью);     	
	СтруктураПараметров.Вставить("ТаблицаОшибок", Отчет.ТаблицаОшибок.Выгрузить());  	
	СтруктураПараметров.Вставить("ОтчетВЦБ", ОтчетВЦБ); 
	СтруктураПараметров.Вставить("ФормированиеОтчетаПользователю", Ложь); 
	СтруктураПараметров.Вставить("ОтборПоПредварительнаяПроверка", Отчет.ПредварительнаяПроверка);
	СтруктураПараметров.Вставить("ТекстОшибокПредварительнаяПроверка", "");
	СтруктураПараметров.Вставить("ОтборПоКодуДокумента", ОтборПоКодуДокумента);
	
	СтруктураПараметров.Вставить("ВидКодовТриггеров", ВидКодовТриггеров);

	СтруктураПараметров.Вставить("ТипОтчета",Перечисления.ТипыОчетаПроверки.СводныйОтчет);			
	СтруктураПараметров.Вставить("ОтчетВЦБ", ОтчетВЦБ); 	
	
	СтруктураПараметров.Вставить("ПериодОтчета_ДатаНачала", ПериодОтчета.ДатаНачала);
	СтруктураПараметров.Вставить("ПериодОтчета_ДатаОкончания", ПериодОтчета.ДатаОкончания);

	МассивТабличныхДокументов = Отчеты.СРО_ПроверкаОтчетностиСРассылкойПисем.СформироватьТабличныеДокументы(СТруктураПараметров);

	//	
	//СтруктураПараметров  = Новый Структура();
	//
	//СтруктураПараметров.Вставить("ДатаНачалаОтчета", ПериодОтчета.ДатаНачала);
	//СтруктураПараметров.Вставить("ДатаОкончанияОтчета", ПериодОтчета.ДатаОкончания);
	//СтруктураПараметров.Вставить("ОтчетностьСРО", Отчет.ОтчетностьСРО);
	//СтруктураПараметров.Вставить("ОтборПоПредварительнаяПроверка", Отчет.ПредварительнаяПроверка);
	//СтруктураПараметров.Вставить("ПредварительнаяПроверка", Ложь);
	////СтруктураПараметров.Вставить("Макет", Макет);
	//СтруктураПараметров.Вставить("ВидОтчета", ВидОтчета);
	//СтруктураПараметров.Вставить("ВыводитьТолькоКПКСОтчетностью", ВыводитьТолькоКПКСОтчетностью);
	//СтруктураПараметров.Вставить("СписокКПК", СписокКПК);
	//СтруктураПараметров.Вставить("ТекстОшибокПредварительнаяПроверка", "");
	//СтруктураПараметров.Вставить("ПериодОтчета_ДатаНачала", ПериодОтчета.ДатаНачала);
	//СтруктураПараметров.Вставить("ПериодОтчета_ДатаОкончания", ПериодОтчета.ДатаОкончания);
	//СтруктураПараметров.Вставить("ТипОтчета", Перечисления.ТипыОчетаПроверки.СводныйОтчет); 
	//СтруктураПараметров.Вставить("ТаблицаОшибок", Отчет.ТаблицаОшибок.Выгрузить()); 	
	//
	//СтруктураПараметров.Вставить("ОтчетВЦБ", ОтчетВЦБ); 	
	
	//Если ОтборПоКодуДокумента = 0 Тогда 
	//	СтруктураТабличныхДокументов = СРО_ЗагрузкаОтчетности.СформироватьТабличныйДокументОтчетности(СтруктураПараметров);
	//ИначеЕсли ОтборПоКодуДокумента = 1 Тогда  
	//	СтруктураТабличныхДокументов = СРО_ЗагрузкаОтчетности.СформироватьТабличныйДокументОтчетности_2_16_3_3(СтруктураПараметров);
	//КонецЕсли;
	
	Отчет.ТаблицаОшибок.Загрузить(СтруктураПараметров.ТаблицаОшибок);
	
	Если МассивТабличныхДокументов.Количество() Тогда                           
		ТабличныйДокумент  = МассивТабличныхДокументов[0].ТабличныйДокумент;     		
	КонецЕсли;
	
КонецПроцедуры 


&НаСервере
Процедура СформироватьНаСервере_От4кв2018(ТабличныйДокумент)
	Отчет.ТаблицаОшибок.Очистить();  	
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет"); 	
	
	
	
	НеВыводим_ОКУД0420820 = Ложь;
	
	Если НачалоГода(ДатаОкончанияОтчетногоПериода) = НачалоКвартала(ДатаОкончанияОтчетногоПериода) Тогда		
		// 1 квартала не выводим эту ппроверку
		НеВыводим_ОКУД0420820 = Истина;
	КонецЕсли;		
	
	СтруктураПараметров  = Новый Структура();
	
	СтруктураПараметров.Вставить("ДатаНачалаОтчетногоПериода", ПериодОтчета.ДатаНачала);
	СтруктураПараметров.Вставить("ДатаОкончанияОтчетногоПериода", ПериодОтчета.ДатаОкончания);
	СтруктураПараметров.Вставить("ОтчетностьСРО", Отчет.ОтчетностьСРО);
	СтруктураПараметров.Вставить("ПредварительнаяПроверка", Отчет.ПредварительнаяПроверка);
	//СтруктураПараметров.Вставить("Макет", Новый ТабличныйДокумент);
	СтруктураПараметров.Вставить("ВидОтчета", ВидОтчета);
	СтруктураПараметров.Вставить("ВыводитьТолькоКПКСОтчетностью", ВыводитьТолькоКПКСОтчетностью);
	СтруктураПараметров.Вставить("СписокКПК", СписокКПК);
	СтруктураПараметров.Вставить("ТекстОшибокПредварительнаяПроверка", "");
	СтруктураПараметров.Вставить("ТипОтчета", Перечисления.ТипыОчетаПроверки.ПоРазделам);
	СтруктураПараметров.Вставить("ТаблицаОшибок", Отчет.ТаблицаОшибок.Выгрузить());  	
	
	СтруктураПараметров.Вставить("ВыводимШапкуТаблиц", Истина); 
	СтруктураПараметров.Вставить("ВыводимШапкуНормативов", Истина);   
	
	СтруктураПараметров.Вставить("ОтчетВЦБ", ОтчетВЦБ);
	
	
	Если ВидОтчета = 1 Тогда 
		
		ТаблицаДокументов = СРО_ЗагрузкаОтчетности.ПолучитьТаблицуДокументов(СтруктураПараметров);  
		
		СтруктураПараметров.Вставить("ТабличныйДокумент", Новый ТабличныйДокумент);
		СтруктураПараметров.Вставить("РезультатНадзорныеСоотношения", Новый ТабличныйДокумент);
		СтруктураПараметров.Вставить("РезультатКС", Новый ТабличныйДокумент);
		СтруктураПараметров.Вставить("РезультатНормативы", Новый ТабличныйДокумент);    		
		
		
		ТаблицаКодовДокументов = ТаблицаДокументов.Скопировать();     		
		
		ТаблицаКодовДокументов.Свернуть("КодДокумента");
		ТаблицаКодовДокументов.Сортировать("КодДокумента");		
		
		Для Каждого СтрокаТаблицы ИЗ ТаблицаКодовДокументов Цикл
			//СтруктураПараметров.ВыводимШапкуНормативов = СтруктураПараметров.ВыводимШапкуНормативов = Неопределено;			
			
			НайденныеСтроки = ТаблицаДокументов.НайтиСтроки(Новый Структура("КодДокумента", СтрокаТаблицы.КодДокумента));
			
			Для Каждого СтрокаТаблицы ИЗ НайденныеСтроки Цикл
				
				Если СтруктураПараметров.Свойство("ОтчетностьСРО") Тогда
					СтруктураПараметров.ОтчетностьСРО = СтрокаТаблицы.ДокументОтчетности;
				Иначе
					СтруктураПараметров.Вставить("ОтчетностьСРО", СтрокаТаблицы.ДокументОтчетности);				
				КонецЕсли;                                                                          				
				
				Если СтрокаТаблицы.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21633 
					ИЛИ СтрокаТаблицы.КодДокумента = Перечисления.КодДокумента.ОКУД_0420820_21634 Тогда
					СтруктураТабличныхДокументов = СРО_ЗагрузкаОтчетности.СформироватьТабличныйДокументОтчетности_2_16_3_3(СтруктураПараметров);
				Иначе
					СтруктураТабличныхДокументов = СРО_ЗагрузкаОтчетности.СформироватьТабличныйДокументОтчетности(СтруктураПараметров);
				КонецЕсли;  			
			КонецЦикла;
		КонецЦикла;     
		
	Иначе	
		
		
		Если ОтборПоКодуДокумента = 0 Тогда 
			СтруктураТабличныхДокументов = СРО_ЗагрузкаОтчетности.СформироватьТабличныйДокументОтчетности(СтруктураПараметров);
		ИначеЕсли ОтборПоКодуДокумента = 1 Тогда  
			СтруктураТабличныхДокументов = СРО_ЗагрузкаОтчетности.СформироватьТабличныйДокументОтчетности_2_16_3_3(СтруктураПараметров);
		КонецЕсли;
	КонецЕсли;      		
	
	Отчет.ТаблицаОшибок.Загрузить(СтруктураПараметров.ТаблицаОшибок);
	
	ЭтотОбъект.РезультатНадзорныеСоотношения = СтруктураТабличныхДокументов.РезультатНадзорныеСоотношения;
	
	Если СтруктураТабличныхДокументов.Свойство("СтруктураТаблицФН") Тогда
		Если СтруктураТабличныхДокументов.СтруктураТаблицФН.Свойство("ТаблицаФН1") Тогда
			ЭтотОбъект.РезультатФН1 = СтруктураТабличныхДокументов.СтруктураТаблицФН.ТаблицаФН1;
		КонецЕсли;		
		
		Если СтруктураТабличныхДокументов.СтруктураТаблицФН.Свойство("ТаблицаФН2") Тогда
			ЭтотОбъект.РезультатФН2 = СтруктураТабличныхДокументов.СтруктураТаблицФН.ТаблицаФН2;
		КонецЕсли;		
		
		Если СтруктураТабличныхДокументов.СтруктураТаблицФН.Свойство("ТаблицаФН3") Тогда
			ЭтотОбъект.РезультатФН3 = СтруктураТабличныхДокументов.СтруктураТаблицФН.ТаблицаФН3;
		КонецЕсли;		
		
		Если СтруктураТабличныхДокументов.СтруктураТаблицФН.Свойство("ТаблицаФН4") Тогда
			ЭтотОбъект.РезультатФН4 = СтруктураТабличныхДокументов.СтруктураТаблицФН.ТаблицаФН4;
		КонецЕсли;		
		
		Если СтруктураТабличныхДокументов.СтруктураТаблицФН.Свойство("ТаблицаФН5") Тогда
			ЭтотОбъект.РезультатФН5 = СтруктураТабличныхДокументов.СтруктураТаблицФН.ТаблицаФН5;
		КонецЕсли;		
		
		Если СтруктураТабличныхДокументов.СтруктураТаблицФН.Свойство("ТаблицаФН6") Тогда
			ЭтотОбъект.РезультатФН6 = СтруктураТабличныхДокументов.СтруктураТаблицФН.ТаблицаФН6;
		КонецЕсли;		
		
		Если СтруктураТабличныхДокументов.СтруктураТаблицФН.Свойство("ТаблицаФН7") Тогда
			ЭтотОбъект.РезультатФН7 = СтруктураТабличныхДокументов.СтруктураТаблицФН.ТаблицаФН7;
		КонецЕсли;		
		
		Если СтруктураТабличныхДокументов.СтруктураТаблицФН.Свойство("ТаблицаФН8") Тогда
			ЭтотОбъект.РезультатФН8 = СтруктураТабличныхДокументов.СтруктураТаблицФН.ТаблицаФН8;
		КонецЕсли;		
		
		ЭтотОбъект.РезультатФН1.ФиксацияСверху = 2;
		ЭтотОбъект.РезультатФН2.ФиксацияСверху = 2;
		ЭтотОбъект.РезультатФН3.ФиксацияСверху = 2;
		ЭтотОбъект.РезультатФН4.ФиксацияСверху = 2;
		ЭтотОбъект.РезультатФН5.ФиксацияСверху = 2;
		ЭтотОбъект.РезультатФН6.ФиксацияСверху = 2;
		ЭтотОбъект.РезультатФН7.ФиксацияСверху = 2;
		ЭтотОбъект.РезультатФН8.ФиксацияСверху = 2;
	КонецЕсли; 	
	
	
	Если ВидОтчета = 0 Тогда		
		КолДопКолонок = 0;
	Иначе
		КолДопКолонок = 1;
	КонецЕсли;   	
	
	ЭтотОбъект.РезультатНадзорныеСоотношения.ФиксацияСверху = 4;
	ЭтотОбъект.РезультатНадзорныеСоотношения.ФиксацияСлева = 4 + КолДопКолонок; 
	
	ЭтотОбъект.РезультатКС = СтруктураТабличныхДокументов.РезультатКС;
	ЭтотОбъект.РезультатНормативы = СтруктураТабличныхДокументов.РезультатНормативы; 	
	
КонецПроцедуры 

&НаСервере
Процедура СформироватьНаСервере_От4кв2018_Старый()
	Отчет.ТаблицаОшибок.Очистить();  	
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет"); 	
	
	
	
	НеВыводим_ОКУД0420820 = Ложь;
	
	Если НачалоГода(ДатаОкончанияОтчетногоПериода) = НачалоКвартала(ДатаОкончанияОтчетногоПериода) Тогда		
		// 1 квартала не выводим эту ппроверку
		НеВыводим_ОКУД0420820 = Истина;
	КонецЕсли;		
	
	СтруктураПараметров  = Новый Структура();
	
	СтруктураПараметров.Вставить("ДатаНачалаОтчетногоПериода", ПериодОтчета.ДатаНачала);
	СтруктураПараметров.Вставить("ДатаОкончанияОтчетногоПериода", ДатаОкончанияОтчетногоПериода);
	СтруктураПараметров.Вставить("ОтчетностьСРО", Отчет.ОтчетностьСРО);
	СтруктураПараметров.Вставить("ПредварительнаяПроверка", Отчет.ПредварительнаяПроверка);
	//СтруктураПараметров.Вставить("Макет", Новый ТабличныйДокумент);
	СтруктураПараметров.Вставить("ВидОтчета", ВидОтчета);
	СтруктураПараметров.Вставить("ВыводитьТолькоКПКСОтчетностью", ВыводитьТолькоКПКСОтчетностью);
	СтруктураПараметров.Вставить("СписокКПК", СписокКПК);
	СтруктураПараметров.Вставить("ТекстОшибокПредварительнаяПроверка", "");
	СтруктураПараметров.Вставить("ТипОтчета", Перечисления.ТипыОчетаПроверки.ПоРазделам);
	
	//СтруктураПараметров.Вставить("МВТ", МВТ);
	
	СРО_ЗагрузкаОтчетности.ПолучитьТаблицыРазделовДокументаОтчетности(СтруктураПараметров);
	
	ЗапросПоПСК = СтруктураПараметров.ЗапросПоПСК;
	МВТ = СтруктураПараметров.МВТ;
	
	НачалоПериода = СтруктураПараметров.НачалоПериода;
	ОкончаниеПериода = СтруктураПараметров.ОкончаниеПериода;
	
	ЗапросПоПСК = СтруктураПараметров.ЗапросПоПСК;
	
	РезультатЗапроса = СтруктураПараметров.РезультатЗапроса;
	
	ТЗраздел5_6 = СтруктураПараметров.ТЗраздел5_6;
	
	ТЗразделы7_8 = СтруктураПараметров.ТЗразделы7_8; 
	
	ТЗРаздел9 = СтруктураПараметров.ТЗРаздел9; 
	
	ТЗРаздел10 = СтруктураПараметров.ТЗРаздел10; 	
	
	
	Если ВидОтчета = 0 Тогда		
		КолДопКолонок = 0;
	Иначе
		КолДопКолонок = 1;
	КонецЕсли;
	
	
	// 2 Надзорное соотношение
	Цвет_ОшибкаВПоказателях = Новый Цвет(255, 203, 203);
	
	РезультатНадзорныеСоотношения.Очистить();
	
	Если ВидОтчета = 0 Тогда
		МакетНС = ОтчетОбъект.ПолучитьМакет("МакетКонтрольныеСоотношения_4кв2018");
	Иначе	
		МакетНС = ОтчетОбъект.ПолучитьМакет("МакетКонтрольныеСоотношения_4кв2018Период");
	КонецЕсли;
	
	ОбластьШапка = МакетНС.получитьОбласть("Шапка");
	
	ОбластьШапка.Параметры.ПредставлениеПериода = ПредставлениеПериода(НачалоПериода, ОкончаниеПериода);
	РезультатНадзорныеСоотношения.Вывести(ОбластьШапка);
	
	
	
	// 3. КС
	
	РезультатКС.Очистить();
	
	Если ВидОтчета = 0 Тогда
		МакетКС = ОтчетОбъект.ПолучитьМакет("СРО_МакетКС_4кв2018");
	Иначе
		МакетКС = ОтчетОбъект.ПолучитьМакет("СРО_МакетКС_4кв2018Период");		
	КонецЕсли;
	
	ОбластьШапка = МакетКС.получитьОбласть("Шапка|Основная");
	
	ОбластьШапка.Параметры.ПредставлениеПериода = ПредставлениеПериода(НачалоПериода, ОкончаниеПериода);
	РезультатКС.Вывести(ОбластьШапка);
	
	Если НЕ НеВыводим_ОКУД0420820 Тогда		
		ОбластьШапка_Форма_ОКУД0420820 = МакетКС.получитьОбласть("Шапка|Форма_ОКУД0420820");	
		РезультатКС.Присоединить(ОбластьШапка_Форма_ОКУД0420820);                           
	КонецЕсли;
	
	
	ОбластьСтрокаКС = МакетКС.получитьОбласть("Строка|Основная"); 	
	ОбластьСтрокаКС_Форма_ОКУД0420820 = МакетКС.получитьОбласть("Строка|Форма_ОКУД0420820"); 	
	
	// Графа 4 раздел 6
	
	ЗапроРаздел6Графа4 = Новый Запрос;
	ЗапроРаздел6Графа4.Текст = "ВЫБРАТЬ
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка КАК ДокументОтчетности,
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК КАК КПК,
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.ДатаОкончанияОтчетногоПериода КАК ДатаОкончанияОтчетногоПериода,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Показатель2 = -99999
	|				ТОГДА 0
	|			ИНАЧЕ ОтчетностьКПКТаблицаПоказателей.Показатель2
	|		КОНЕЦ) КАК Графа4
	|ИЗ
	|	Документ.ОтчетностьКПК.ТаблицаПоказателей КАК ОтчетностьКПКТаблицаПоказателей
	|ГДЕ
	|	ОтчетностьКПКТаблицаПоказателей.Раздел В ИЕРАРХИИ(&Раздел)
	|	И ОтчетностьКПКТаблицаПоказателей.Ссылка.ДатаОкончанияОтчетногоПериода МЕЖДУ &ДатаНачала И &ДатаОкончания  
	|	#ОтборПоКПК#
	
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка";
	
	ОтборПоКПК = "";
	Если ВидОтчета = 0 Тогда			
		ЗапроРаздел6Графа4.УстановитьПараметр("ДатаНачала", ДатаОкончанияОтчетногоПериода);
		ЗапроРаздел6Графа4.УстановитьПараметр("ДатаОкончания", ДатаОкончанияОтчетногоПериода);	
	Иначе                                            		
		ЗапроРаздел6Графа4.УстановитьПараметр("ДатаНачала", ПериодОтчета.ДатаНачала);
		ЗапроРаздел6Графа4.УстановитьПараметр("ДатаОкончания", ПериодОтчета.ДатаОкончания);	
		ЗапроРаздел6Графа4.УстановитьПараметр("СписокКПК", СписокКПК);	    	
		ОтборПоКПК = "И ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК В (&СписокКПК)";
	КонецЕсли;
	
	ЗапроРаздел6Графа4.Текст = СтрЗаменить(ЗапроРаздел6Графа4.Текст, "#ОтборПоКПК#", ОтборПоКПК); 	
	ЗапроРаздел6Графа4.УстановитьПараметр("Раздел", Справочники.Разделы.Раздел6);
	
	ТЗРаздел6Графа4 = ЗапроРаздел6Графа4.Выполнить().Выгрузить();
	СРО_ЗагрузкаОтчетности.ЗаполнитьКОлонкуДЛляПоиска(ТЗРаздел6Графа4);
	
	
	// 4. Нормативы
	
	НазваниеТаблицы = "Нормативы";
	// Табличный документ 
	РезультатНормативы.Очистить();
	РезультатНормативы.НачатьАвтогруппировкуСтрок(); 	
	
	НомерСтрокиНормативы = 0;
	
	Если ВидОтчета = 0 Тогда
		МакетНормативы = ОтчетОбъект.ПолучитьМакет("МакетНормативы_4кв2018");
	Иначе
		МакетНормативы = ОтчетОбъект.ПолучитьМакет("МакетНормативы_4кв2018Период");
	КонецЕсли;
	
	ОбластьШапкаПредставлениеПериода = МакетНормативы.получитьОбласть("ШапкаПредставлениеПериода");
	
	ОбластьШапкаПредставлениеПериода.Параметры.ПредставлениеПериода = ПредставлениеПериода(НачалоПериода, ОкончаниеПериода);
	РезультатНормативы.Вывести(ОбластьШапкаПредставлениеПериода);
	
	
	ШапкаПредельныеЗначения = МакетНормативы.ПолучитьОбласть("ШапкаПредельныеЗначения");
	РезультатНормативы.Вывести(ШапкаПредельныеЗначения, 1);
	
	ОбластьСтрокиПредельныеЗначения = МакетНормативы.ПолучитьОбласть("СтрокиПредельныеЗначения");
	РезультатНормативы.Вывести(ОбластьСтрокиПредельныеЗначения, 2);
	
	
	РезультатНормативы.ЗакончитьАвтогруппировкуСтрок();
	
	ОбластьШапкаТаблицы = МакетНормативы.ПолучитьОбласть("ШапкаТаблицы");
	РезультатНормативы.Вывести(ОбластьШапкаТаблицы, 2); 	
	
	ОбластьСтрокаНормативы = МакетНормативы.ПолучитьОбласть("Строка");
	
	// выводим строки   	
	
	СтрокаЧетная = Ложь;
	
	НомерСтроки = 0;
	
	ВыборкаКПК =  РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКПК.Следующий() Цикл
		
		
		ВыборкаДатаОкончанияОтчетногоПериода=  ВыборкаКПК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаДатаОкончанияОтчетногоПериода.Следующий() Цикл  				
			Выборка =  ВыборкаДатаОкончанияОтчетногоПериода.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Если ЗначениеЗаполнено(ВыборкаДатаОкончанияОтчетногоПериода.ДатаОкончанияОтчетногоПериода) = 0 Тогда
				Если ВыводитьТолькоКПКСОтчетностью Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
			
			Пока Выборка.Следующий() Цикл
				НомерСтроки = НомерСтроки +1;
				
				ВсегоОшибок = 0;
				
				ЕстьДокумент = ЗначениеЗаполнено(Выборка.ДокументОтчетности); 
				
				СтруктураЗначение  = Новый Структура;
				
				Если ЕстьДокумент Тогда  				
					ВыборкаРаздел =  Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					// Собираем СтруктураЗначений
					Пока ВыборкаРаздел.Следующий() Цикл 
						Если Не ЗначениеЗаполнено(ВыборкаРаздел.Раздел) Тогда
							Прервать;
						КонецЕсли;
						СтруктураЗначение.Вставить("Раздел" + ВыборкаРаздел.Раздел.Код, ВыборкаРаздел.ЗначениеПоказателя); 								
					КонецЦикла; 
				КонецЕсли;
				
				// выводим в отчет
				
				Если СтрокаЧетная Тогда
					ЦветФонаСтроки = WebЦвета.ШелковыйОттенок;
				Иначе
					ЦветФонаСтроки = WebЦвета.Белый;
				КонецЕсли;
				
				
				
				
				
				
				// Надзоные соотношения 
				Если 1 = 1 Тогда // блок чтобы можно было свернуть
					ОбластьСтрока = МакетНС.получитьОбласть("Строка"); 
					
					
					СтрокаЧетная = ?(СтрокаЧетная, Ложь, Истина);  	
					ОбластьСтрока.Область(1, 1, 1, 66 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;	
					
					Если НЕ ЕстьДокумент Тогда   			
						ОбластьСтрока.Параметры.ДокументОтчетности  = "Нет документа";
						ОбластьСтрока.Область(1, 3, 1, 3).ЦветТекста = WebЦвета.Черный;				
					Иначе	
						ОбластьСтрока.Параметры.ДокументОтчетности  = Выборка.ДокументОтчетности;
						ОбластьСтрока.Область(1, 3, 1, 3).ЦветТекста =  WebЦвета.Синий;
					КонецЕсли;
					
					ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
					ОбластьСтрока.Параметры.НомерВРеестреСРО = Выборка.КПК.НомерВРеестреСРО;
					ОбластьСтрока.Параметры.КраткоеНазваниеКПК = СокрЛП(Выборка.КПК.НаименованиеКраткое);
					
					Если ВидОтчета = 1 Тогда                          
						ОбластьСтрока.Параметры.ПериодОтчетности = СРО_ЗагрузкаОтчетности.ПолучитьПредставлениеДатыотчета(Выборка.ДатаОкончанияОтчетногоПериода);
					КонецЕсли;
					
					Если НЕ ЕстьДокумент Тогда
						ОбластьСтрока.Параметры.ИтогоОшибок = 0;							
						РезультатНадзорныеСоотношения.Вывести(ОбластьСтрока); 		
						
						Прервать;
					КонецЕсли;    
					
					
					НазваниеТаблицы = "НадзорныеСоотношения";
					
					
					// 04.97.80			
					ОбластьСтрока.Параметры.Раздел2_3_1_8 = ?(СтруктураЗначение.Раздел2_3_1_8 = 0, "0", СтруктураЗначение.Раздел2_3_1_8);
					ОбластьСтрока.Параметры.Раздел2_3_1_7 = ?(СтруктураЗначение.Раздел2_3_1_7 = 0, "0", СтруктураЗначение.Раздел2_3_1_7);
					
					Если СтруктураЗначение.Раздел2_3_1_8 > 0 И СтруктураЗначение.Раздел2_3_1_7 = 0  Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						
						ОбластьСтрока.Область(1, 5 + КолДопКолонок, 1, 6 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
						ОписаниеУсловия = "если (строка 3.1.8 раздела II > 0), то (строка  3.1.7) = 0";
						ОписаниеОшибки = "(строка 3.1.8) = "+ Строка(СтруктураЗначение.Раздел2_3_1_8)+" > 0 И (строка  3.1.7) = " + Строка(СтруктураЗначение.Раздел2_3_1_7);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.97.80"); 	
					КонецЕсли; 
					
					// 04.97.81			
					ОбластьСтрока.Параметры.Раздел2_3_2_8 = ?(СтруктураЗначение.Раздел2_3_2_8 = 0, "0", СтруктураЗначение.Раздел2_3_2_8);
					ОбластьСтрока.Параметры.Раздел2_3_2_7 = ?(СтруктураЗначение.Раздел2_3_2_7 = 0, "0", СтруктураЗначение.Раздел2_3_2_7);
					
					Если СтруктураЗначение.Раздел2_3_2_8 > 0 И СтруктураЗначение.Раздел2_3_2_7 = 0  Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						
						ОбластьСтрока.Область(1, 7 + КолДопКолонок, 1, 8 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
						ОписаниеУсловия = "если (строка 3.2.8 раздела II > 0), то (строка  3.2.7) = 0";
						ОписаниеОшибки = "(строка 3.2.8) = "+ Строка(СтруктураЗначение.Раздел2_3_2_8)+" > 0 И (строка  3.2.7) = " + Строка(СтруктураЗначение.Раздел2_3_2_7);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.97.81"); 	
					КонецЕсли; 
					
					// 04.97.82			
					ОбластьСтрока.Параметры.Раздел2_3_1_2 = ?(СтруктураЗначение.Раздел2_3_1_2 = 0, "0", СтруктураЗначение.Раздел2_3_1_2);
					ОбластьСтрока.Параметры.Раздел2_3_1_1 = ?(СтруктураЗначение.Раздел2_3_1_1 = 0, "0", СтруктураЗначение.Раздел2_3_1_1);
					
					Если СтруктураЗначение.Раздел2_3_1_2 > 0 И СтруктураЗначение.Раздел2_3_1_1 = 0  Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						
						ОбластьСтрока.Область(1, 9 + КолДопКолонок, 1, 10 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
						ОписаниеУсловия = "если (строка 3.1.2. раздела II > 0), то (строка 3.1.1) =0";
						ОписаниеОшибки = "(строка 3.1.2) = "+ Строка(СтруктураЗначение.Раздел2_3_1_2)+" > 0 И (строка  3.1.1) = " + Строка(СтруктураЗначение.Раздел2_3_1_1);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.97.82");
					КонецЕсли; 
					
					// 04.97.83		
					ОбластьСтрока.Параметры.Раздел2_3_2_2 = ?(СтруктураЗначение.Раздел2_3_2_2 = 0, "0", СтруктураЗначение.Раздел2_3_2_2);
					ОбластьСтрока.Параметры.Раздел2_3_2_1 = ?(СтруктураЗначение.Раздел2_3_2_1 = 0, "0", СтруктураЗначение.Раздел2_3_2_1);
					
					Если СтруктураЗначение.Раздел2_3_2_2 > 0 И СтруктураЗначение.Раздел2_3_2_1 = 0  Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						
						ОбластьСтрока.Область(1, 11 + КолДопКолонок, 1, 12 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
						ОписаниеУсловия = "если (строка 3.2.2 раздела II > 0), то (строка 3.2.1 = 0) ";
						ОписаниеОшибки = "(строка 3.2.2) = "+ Строка(СтруктураЗначение.Раздел2_3_2_2)+" > 0 И (строка  3.2.1) = " + Строка(СтруктураЗначение.Раздел2_3_2_1);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.97.83");
					КонецЕсли; 
					
					// 04.97.84		
					ОбластьСтрока.Параметры.Раздел2_3_1_4 = ?(СтруктураЗначение.Раздел2_3_1_4 = 0, "0", СтруктураЗначение.Раздел2_3_1_4);
					ОбластьСтрока.Параметры.Раздел2_3_1_3 = ?(СтруктураЗначение.Раздел2_3_1_3 = 0, "0", СтруктураЗначение.Раздел2_3_1_3);
					
					Если СтруктураЗначение.Раздел2_3_1_4 > 0 И СтруктураЗначение.Раздел2_3_1_3 = 0  Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						
						ОбластьСтрока.Область(1, 13 + КолДопКолонок, 1, 14 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
						ОписаниеУсловия = "если (строка 3.1.4. раздела II > 0), то (строка 3.1.3) =0";
						ОписаниеОшибки = "(строка 3.1.4) = "+ Строка(СтруктураЗначение.Раздел2_3_1_4)+" > 0 И (строка  3.1.3) = " + Строка(СтруктураЗначение.Раздел2_3_1_3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.97.84");
					КонецЕсли; 
					
					// 04.97.85	
					ОбластьСтрока.Параметры.Раздел2_3_2_4 = ?(СтруктураЗначение.Раздел2_3_2_4 = 0, "0", СтруктураЗначение.Раздел2_3_2_4);
					ОбластьСтрока.Параметры.Раздел2_3_2_3 = ?(СтруктураЗначение.Раздел2_3_2_3 = 0, "0", СтруктураЗначение.Раздел2_3_2_3);
					
					Если СтруктураЗначение.Раздел2_3_2_4 > 0 И СтруктураЗначение.Раздел2_3_2_3 = 0  Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						
						ОбластьСтрока.Область(1, 15 + КолДопКолонок, 1, 16 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
						ОписаниеУсловия = "если (строка 3.2.4 раздела II > 0), то (строка 3.2.3 = 0) ";
						ОписаниеОшибки = "(строка 3.2.4) = "+ Строка(СтруктураЗначение.Раздел2_3_2_4)+" > 0 И (строка  3.2.3) = " + Строка(СтруктураЗначение.Раздел2_3_2_3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.97.85");
					КонецЕсли; 
					
					// 04.97.86	
					ОбластьСтрока.Параметры.Раздел2_3_1_8_1 = ?(СтруктураЗначение.Раздел2_3_1_8_1 = 0, "0", СтруктураЗначение.Раздел2_3_1_8_1);
					ОбластьСтрока.Параметры.Раздел2_3_1_7_1 = ?(СтруктураЗначение.Раздел2_3_1_7_1 = 0, "0", СтруктураЗначение.Раздел2_3_1_7_1);
					
					Если СтруктураЗначение.Раздел2_3_1_8_1 > 0 И СтруктураЗначение.Раздел2_3_1_7_1 = 0  Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						
						ОбластьСтрока.Область(1, 17 + КолДопКолонок, 1, 18 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
						ОписаниеУсловия = "если (строка 3.1.8.1 раздела II > 0), то (строка 3.1.7.1) =0 ";
						ОписаниеОшибки = "(строка 3.1.8.1) = "+ Строка(СтруктураЗначение.Раздел2_3_1_8_1)+" > 0 И (строка  3.1.7.1) = " + Строка(СтруктураЗначение.Раздел2_3_1_7_1);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.97.86");
					КонецЕсли; 
					
					// 04.97.87	
					ОбластьСтрока.Параметры.Раздел2_3_2_8_1 = ?(СтруктураЗначение.Раздел2_3_2_8_1 = 0, "0", СтруктураЗначение.Раздел2_3_2_8_1);
					ОбластьСтрока.Параметры.Раздел2_3_2_7_1 = ?(СтруктураЗначение.Раздел2_3_2_7_1 = 0, "0", СтруктураЗначение.Раздел2_3_2_7_1);
					
					Если СтруктураЗначение.Раздел2_3_2_8_1 > 0 И СтруктураЗначение.Раздел2_3_2_7_1 = 0  Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						
						ОбластьСтрока.Область(1, 19 + КолДопКолонок, 1, 20 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
						ОписаниеУсловия = "если (строка 3.2.8.1 раздела II > 0), то (строка 3.2.7.1) = 0";
						ОписаниеОшибки = "(строка 3.2.8.1) = "+ Строка(СтруктураЗначение.Раздел2_3_2_8_1)+" > 0 И (строка  3.2.7.1) = " + Строка(СтруктураЗначение.Раздел2_3_2_7_1);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.97.87");
					КонецЕсли; 
					
					// 04.97.88	
					ОбластьСтрока.Параметры.Раздел2_3_1_8_2 = ?(СтруктураЗначение.Раздел2_3_1_8_2 = 0, "0", СтруктураЗначение.Раздел2_3_1_8_2);
					ОбластьСтрока.Параметры.Раздел2_3_1_7_2 = ?(СтруктураЗначение.Раздел2_3_1_7_2 = 0, "0", СтруктураЗначение.Раздел2_3_1_7_2);
					
					Если СтруктураЗначение.Раздел2_3_1_8_2 > 0 И СтруктураЗначение.Раздел2_3_1_7_2 = 0  Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						
						ОбластьСтрока.Область(1, 21 + КолДопКолонок, 1, 22 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
						ОписаниеУсловия = "если (строка 3.1.8.2 раздела II > 0), то (строки 3.1.7.2) =0";
						ОписаниеОшибки = "(строка 3.1.8.2) = "+ Строка(СтруктураЗначение.Раздел2_3_1_8_2)+" > 0 И (строка  3.1.7.2) = " + Строка(СтруктураЗначение.Раздел2_3_1_7_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.97.88");
					КонецЕсли; 
					
					// 04.97.89	
					ОбластьСтрока.Параметры.Раздел2_3_2_8_2 = ?(СтруктураЗначение.Раздел2_3_2_8_2 = 0, "0", СтруктураЗначение.Раздел2_3_2_8_2);
					ОбластьСтрока.Параметры.Раздел2_3_2_7_2 = ?(СтруктураЗначение.Раздел2_3_2_7_2 = 0, "0", СтруктураЗначение.Раздел2_3_2_7_2);
					
					Если СтруктураЗначение.Раздел2_3_2_8_2 > 0 И СтруктураЗначение.Раздел2_3_2_7_2 = 0  Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						
						ОбластьСтрока.Область(1, 23 + КолДопКолонок, 1, 24 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
						ОписаниеУсловия = "если (строка 3.2.8.2 раздела II > 0), то (строки 3.2.7.2) =0";
						ОписаниеОшибки = "(строка 3.1.8.2) = "+ Строка(СтруктураЗначение.Раздел2_3_2_8_2)+" > 0 И (строка  3.1.7.2) = " + Строка(СтруктураЗначение.Раздел2_3_2_7_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.97.89");
					КонецЕсли; 
					
					// 04.97.90	
					ОбластьСтрока.Параметры.Раздел2_3_1_8_3 = ?(СтруктураЗначение.Раздел2_3_1_8_3 = 0, "0", СтруктураЗначение.Раздел2_3_1_8_3);
					ОбластьСтрока.Параметры.Раздел2_3_1_7_3 = ?(СтруктураЗначение.Раздел2_3_1_7_3 = 0, "0", СтруктураЗначение.Раздел2_3_1_7_3);
					
					Если СтруктураЗначение.Раздел2_3_1_8_3 > 0 И СтруктураЗначение.Раздел2_3_1_7_3 = 0  Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						
						ОбластьСтрока.Область(1, 25 + КолДопКолонок, 1, 26 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
						ОписаниеУсловия = "если (строка 3.1.8.3 раздела II > 0), то (строки 3.1.7.3) =0";
						ОписаниеОшибки = "(строка 3.1.8.3) = "+ Строка(СтруктураЗначение.Раздел2_3_1_8_3)+" > 0 И (строка  3.1.7.3) = " + Строка(СтруктураЗначение.Раздел2_3_1_7_3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.97.90");
					КонецЕсли; 
					
					// 04.97.91	
					ОбластьСтрока.Параметры.Раздел2_3_2_8_3 = ?(СтруктураЗначение.Раздел2_3_2_8_3 = 0, "0", СтруктураЗначение.Раздел2_3_2_8_3);
					ОбластьСтрока.Параметры.Раздел2_3_2_7_3 = ?(СтруктураЗначение.Раздел2_3_2_7_3 = 0, "0", СтруктураЗначение.Раздел2_3_2_7_3);
					
					Если СтруктураЗначение.Раздел2_3_2_8_3 > 0 И СтруктураЗначение.Раздел2_3_2_7_3 = 0  Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						
						ОбластьСтрока.Область(1, 27 + КолДопКолонок, 1, 28 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
						ОписаниеУсловия = "если (строка 3.2.8.3 раздела II > 0), то (строки 3.2.7.3) =0";
						ОписаниеОшибки = "(строка 3.2.8.3) = "+ Строка(СтруктураЗначение.Раздел2_3_2_8_3)+" > 0 И (строка  3.2.7.3) = " + Строка(СтруктураЗначение.Раздел2_3_2_7_3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.97.91");
					КонецЕсли; 
					
					// 04.97.92	
					ОбластьСтрока.Параметры.Раздел2_3_1_6 = ?(СтруктураЗначение.Раздел2_3_1_6 = 0, "0", СтруктураЗначение.Раздел2_3_1_6);
					ОбластьСтрока.Параметры.Раздел2_3_1_5 = ?(СтруктураЗначение.Раздел2_3_1_5 = 0, "0", СтруктураЗначение.Раздел2_3_1_5);
					
					Если СтруктураЗначение.Раздел2_3_1_6 > 0 И СтруктураЗначение.Раздел2_3_1_5 = 0  Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						
						ОбластьСтрока.Область(1, 29 + КолДопКолонок, 1, 30 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
						ОписаниеУсловия = "если (строка 3.1.6. раздела II > 0), то (строки 3.1.5) =0";
						ОписаниеОшибки = "(строка 3.1.6) = "+ Строка(СтруктураЗначение.Раздел2_3_1_6)+" > 0 И (строка  3.1.5) = " + Строка(СтруктураЗначение.Раздел2_3_1_5);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.97.92");
					КонецЕсли; 
					
					// 04.97.93	
					ОбластьСтрока.Параметры.Раздел2_3_2_6 = ?(СтруктураЗначение.Раздел2_3_2_6 = 0, "0", СтруктураЗначение.Раздел2_3_2_6);
					ОбластьСтрока.Параметры.Раздел2_3_2_5 = ?(СтруктураЗначение.Раздел2_3_2_5 = 0, "0", СтруктураЗначение.Раздел2_3_2_5);
					
					Если СтруктураЗначение.Раздел2_3_2_6 > 0 И СтруктураЗначение.Раздел2_3_2_5 = 0  Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						
						ОбластьСтрока.Область(1, 31 + КолДопКолонок, 1, 32 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
						ОписаниеУсловия = "если (строка 3.2.6. раздела II > 0), то (строки 3.2.5) =0";
						ОписаниеОшибки = "(строка 3.2.6) = "+ Строка(СтруктураЗначение.Раздел2_3_2_6)+" > 0 И (строка  3.2.5) = " + Строка(СтруктураЗначение.Раздел2_3_2_5);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.97.93");
					КонецЕсли; 
					
					// 04.97.94  				
					ОбластьСтрока.Параметры.Сумма_31_32 = СтруктураЗначение.Раздел2_3_1 + СтруктураЗначение.Раздел2_3_2;
					ОбластьСтрока.Параметры.Раздел4_14 = СтруктураЗначение.Раздел4_14;
					
					Если (СтруктураЗначение.Раздел2_3_1 + СтруктураЗначение.Раздел2_3_2) > 0 И СтруктураЗначение.Раздел4_14 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 33 + КолДопКолонок, 1, 34 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						
						ОписаниеУсловия = "если (строки 3.1 + 3.2 раздела II) > 0, то строка 14 раздела IV = 0";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_1 ) + " + " + Строка(СтруктураЗначение.Раздел2_3_2 )+" > 0; строка 14 = " + Строка(СтруктураЗначение.Раздел4_14) ;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.97.94");  	
						
					КонецЕсли;
					
					// 04.97.95 
					ОбластьСтрока.Параметры.Сумма_311_321 = СтруктураЗначение.Раздел2_3_1_1 + СтруктураЗначение.Раздел2_3_2_1;
					ОбластьСтрока.Параметры.Раздел4_14_1 = СтруктураЗначение.Раздел4_14_1;
					
					Если (СтруктураЗначение.Раздел2_3_1_1 + СтруктураЗначение.Раздел2_3_2_1) > 0 И СтруктураЗначение.Раздел4_14_1 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 35 + КолДопКолонок, 1, 36 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						
						ОписаниеУсловия = "если (строки 3.1.1 + 3.2.1 раздела II) > 0, то строка 14.1 раздела IV = 0";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_1_1 ) + " + " + Строка(СтруктураЗначение.Раздел2_3_1_1 )+" > 0; строка 14.1 = " + Строка(СтруктураЗначение.Раздел4_14_1) ;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.97.95");  	
					КонецЕсли;
					
					// 04.97.96
					ОбластьСтрока.Параметры.Сумма_312_322 = СтруктураЗначение.Раздел2_3_1_2 + СтруктураЗначение.Раздел2_3_2_2;
					
					Если (СтруктураЗначение.Раздел2_3_1_2 + СтруктураЗначение.Раздел2_3_2_2) > 0 И СтруктураЗначение.Раздел4_14_1 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 37 + КолДопКолонок, 1, 38 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;
						
						ОписаниеУсловия = "если (строки 3.1.2 + 3.2.2 раздела II) > 0, то строка 14.1 раздела IV = 0";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_1_2 ) + " + " + Строка(СтруктураЗначение.Раздел2_3_2_2 )+" > 0; строка 14.2 = " + Строка(СтруктураЗначение.Раздел4_14_1) ;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.97.96");  	
					КонецЕсли;
					
					// 04.97.97
					ОбластьСтрока.Параметры.Сумма_313_323 = СтруктураЗначение.Раздел2_3_1_3 + СтруктураЗначение.Раздел2_3_2_3;
					ОбластьСтрока.Параметры.Раздел4_14_2 = СтруктураЗначение.Раздел4_14_2;
					
					Если (СтруктураЗначение.Раздел2_3_1_3 + СтруктураЗначение.Раздел2_3_2_3) > 0 И СтруктураЗначение.Раздел4_14_2 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 39 + КолДопКолонок, 1, 40 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   		
						
						ОписаниеУсловия = "если (строки 3.1.3 + 3.2.3 раздела II) > 0, то строка 14.2 раздела IV = 0";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_1_3 ) + " + " + Строка(СтруктураЗначение.Раздел2_3_2_3 )+" > 0; строка 14.2 = " + Строка(СтруктураЗначение.Раздел4_14_2) ;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.97.97");  	
					КонецЕсли;
					
					// 04.97.98
					ОбластьСтрока.Параметры.Сумма_314_324 = СтруктураЗначение.Раздел2_3_1_4 + СтруктураЗначение.Раздел2_3_2_4;
					
					Если (СтруктураЗначение.Раздел2_3_1_4 + СтруктураЗначение.Раздел2_3_2_4) > 0 И СтруктураЗначение.Раздел4_14_2 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 41 + КолДопКолонок, 1, 42 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   		
						
						ОписаниеУсловия = "если (строки 3.1.4 + 3.2.4 раздела II) > 0, то строка 14.2 раздела IV = 0";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_1_4 ) + " + " + Строка(СтруктураЗначение.Раздел2_3_2_4 )+" > 0; строка 14.2 = " + Строка(СтруктураЗначение.Раздел4_14_2) ;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.97.98");  	
					КонецЕсли;
					
					
					// 04.97.99
					ОбластьСтрока.Параметры.Сумма_317_327 = СтруктураЗначение.Раздел2_3_1_7 + СтруктураЗначение.Раздел2_3_2_7;
					ОбластьСтрока.Параметры.Раздел4_14_3 = СтруктураЗначение.Раздел4_14_3;
					
					Если (СтруктураЗначение.Раздел2_3_1_7 + СтруктураЗначение.Раздел2_3_2_7) > 0 И СтруктураЗначение.Раздел4_14_3 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 43 + КолДопКолонок, 1, 44 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   		
						
						ОписаниеУсловия = "если (строки 3.1.7 + 3.2.7 раздела II) > 0, то строка 14.3 раздела IV = 0";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_1_7 ) + " + " + Строка(СтруктураЗначение.Раздел2_3_2_7 )+" > 0; строка 14.3 = " + Строка(СтруктураЗначение.Раздел4_14_3) ;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.97.99");  	
					КонецЕсли;
					
					// 04.98.0
					ОбластьСтрока.Параметры.Сумма_318_328 = СтруктураЗначение.Раздел2_3_1_8 + СтруктураЗначение.Раздел2_3_2_8;
					
					Если (СтруктураЗначение.Раздел2_3_1_8 + СтруктураЗначение.Раздел2_3_2_8) > 0 И СтруктураЗначение.Раздел4_14_3 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 45 + КолДопКолонок, 1, 46 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   		
						
						ОписаниеУсловия = "если (строки 3.1.8 + 3.2.8 раздела II) > 0, то строка 14.3 раздела IV = 0";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_1_8 ) + " + " + Строка(СтруктураЗначение.Раздел2_3_2_8 )+" > 0; строка 14.3 = " + Строка(СтруктураЗначение.Раздел4_14_3) ;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.0");  	
					КонецЕсли;
					
					// 04.98.1
					ОбластьСтрока.Параметры.Сумма_3171_3271 = СтруктураЗначение.Раздел2_3_1_7_1 + СтруктураЗначение.Раздел2_3_2_7_1;
					ОбластьСтрока.Параметры.Раздел4_14_3_1 = СтруктураЗначение.Раздел4_14_3_1;
					
					
					Если (СтруктураЗначение.Раздел2_3_1_7_1 + СтруктураЗначение.Раздел2_3_2_7_1) > 0 И СтруктураЗначение.Раздел4_14_3_1 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 47 + КолДопКолонок, 1, 48 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   		
						
						ОписаниеУсловия = "если (строки 3.1.7.1 + 3.2.7.1  раздела II) > 0, то строка 14.3.1 раздела IV = 0";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_1_7_1 ) + " + " + Строка(СтруктураЗначение.Раздел2_3_2_7_1 )+" > 0; строка 14.3.1 = " + Строка(СтруктураЗначение.Раздел4_14_3_1) ;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.1");  	
					КонецЕсли;
					
					// 04.98.2
					ОбластьСтрока.Параметры.Сумма_3181_3281 = СтруктураЗначение.Раздел2_3_1_8_1 + СтруктураЗначение.Раздел2_3_2_8_1;
					
					Если (СтруктураЗначение.Раздел2_3_1_8_1 + СтруктураЗначение.Раздел2_3_2_8_1) > 0 И СтруктураЗначение.Раздел4_14_3_1 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 49 + КолДопКолонок, 1, 50 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   		
						
						ОписаниеУсловия = "если (строки 3.1.8.1 + 3.2.8.1  раздела II) > 0, то строка 14.3.1 раздела IV = 0";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_1_8_1 ) + " + " + Строка(СтруктураЗначение.Раздел2_3_2_8_1 )+" > 0; строка 14.3.1 = " + Строка(СтруктураЗначение.Раздел4_14_3_1) ;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.2");  	
					КонецЕсли;
					
					// 04.98.3
					ОбластьСтрока.Параметры.Сумма_3172_3272 = СтруктураЗначение.Раздел2_3_1_7_2 + СтруктураЗначение.Раздел2_3_2_7_2;
					ОбластьСтрока.Параметры.Раздел4_14_3_2 = СтруктураЗначение.Раздел4_14_3_2;
					
					Если (СтруктураЗначение.Раздел2_3_1_7_2 + СтруктураЗначение.Раздел2_3_2_7_2) > 0 И СтруктураЗначение.Раздел4_14_3_2 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 51 + КолДопКолонок, 1, 52 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   		
						
						ОписаниеУсловия = "если (строки 3.1.7.2 + 3.2.7.2  раздела II) > 0, то строка 14.3.2 раздела IV = 0";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_1_7_2 ) + " + " + Строка(СтруктураЗначение.Раздел2_3_2_7_2 )+" > 0; строка 14.3.2 = " + Строка(СтруктураЗначение.Раздел4_14_3_2) ;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.3");  	
					КонецЕсли;
					
					// 04.98.4
					ОбластьСтрока.Параметры.Сумма_3182_3282 = СтруктураЗначение.Раздел2_3_1_8_2 + СтруктураЗначение.Раздел2_3_2_8_2;
					
					Если (СтруктураЗначение.Раздел2_3_1_8_2 + СтруктураЗначение.Раздел2_3_2_8_2) > 0 И СтруктураЗначение.Раздел4_14_3_2 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 53 + КолДопКолонок, 1, 54 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   		
						
						ОписаниеУсловия = "если (строки 3.1.8.2 + 3.2.8.2  раздела II) > 0, то строка 14.3.2 раздела IV = 0";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_1_8_2 ) + " + " + Строка(СтруктураЗначение.Раздел2_3_2_8_2 )+" > 0; строка 14.3.2 = " + Строка(СтруктураЗначение.Раздел4_14_3_2) ;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.4");  	
					КонецЕсли;
					
					// 04.98.5
					ОбластьСтрока.Параметры.Сумма_31_32 = СтруктураЗначение.Раздел2_3_1 + СтруктураЗначение.Раздел2_3_2;				
					ОбластьСтрока.Параметры.Раздел4_14 = СтруктураЗначение.Раздел4_14;
					
					Если СтруктураЗначение.Раздел4_14 > 0 И СтруктураЗначение.Раздел2_3_1 + СтруктураЗначение.Раздел2_3_2 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 55 + КолДопКолонок, 1, 56 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						
						ОписаниеУсловия = "если (строка 14 раздела IV > 0), то (строки 3.1 + 3.2 раздела II) = 0";   			
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_14 ) +" > 0; строки 3.1 + 3.2 раздела II) = " + Строка(СтруктураЗначение.Раздел2_3_1) +" + " + Строка(СтруктураЗначение.Раздел2_3_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.5"); 
					КонецЕсли;
					
					// 04.98.6	
					ОбластьСтрока.Параметры.Сумма_311_321 = СтруктураЗначение.Раздел2_3_1_1 + СтруктураЗначение.Раздел2_3_2_1;				
					ОбластьСтрока.Параметры.Раздел4_14_1 = СтруктураЗначение.Раздел4_14_1;
					
					Если СтруктураЗначение.Раздел4_14_1 > 0 И СтруктураЗначение.Раздел2_3_1_1 + СтруктураЗначение.Раздел2_3_2_1 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 57 + КолДопКолонок, 1, 58 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						
						ОписаниеУсловия = "если (строка 14.1 раздела IV > 0), то (строки 3.1.1 + 3.2.1 раздела II) = 0";   			
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_14_1 ) +" > 0; строки 3.1.1 + 3.2.1 раздела II) = " + Строка(СтруктураЗначение.Раздел2_3_1_1) +" + " + Строка(СтруктураЗначение.Раздел2_3_2_1);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.6"); 
						
					КонецЕсли;
					
					// 04.98.7
					ОбластьСтрока.Параметры.Сумма_312_322 = СтруктураЗначение.Раздел2_3_1_2 + СтруктураЗначение.Раздел2_3_2_2;				
					
					Если СтруктураЗначение.Раздел4_14_1 > 0 И СтруктураЗначение.Раздел2_3_1_2 + СтруктураЗначение.Раздел2_3_2_2 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 59 + КолДопКолонок, 1, 60 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;  
						
						ОписаниеУсловия = "если (строка 14.1 раздела IV > 0), то (строки 3.1.2 + 3.2.2 раздела II) = 0 ";   			
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_14_1 ) +" > 0; строки 3.1.2 + 3.2.2 раздела II) = " + Строка(СтруктураЗначение.Раздел2_3_1_2) +" + " + Строка(СтруктураЗначение.Раздел2_3_2_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.7"); 
						
					КонецЕсли;
					
					// 04.98.8
					ОбластьСтрока.Параметры.Сумма_313_323 = СтруктураЗначение.Раздел2_3_1_3 + СтруктураЗначение.Раздел2_3_2_3;				
					ОбластьСтрока.Параметры.Раздел4_14_2 = СтруктураЗначение.Раздел4_14_2;				
					
					Если СтруктураЗначение.Раздел4_14_2 > 0 И СтруктураЗначение.Раздел2_3_1_3 + СтруктураЗначение.Раздел2_3_2_3 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 61 + КолДопКолонок, 1, 62 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;  
						
						ОписаниеУсловия = "если (строка 14.2 раздела IV > 0), то (строки 3.1.3 + 3.2.3 раздела II) = 0";   			
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_14_2 ) +" > 0; строки 3.1.3 + 3.2.3 раздела II) = " + Строка(СтруктураЗначение.Раздел2_3_1_3) +" + " + Строка(СтруктураЗначение.Раздел2_3_2_3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.8"); 
						
					КонецЕсли;
					
					// 04.98.9
					ОбластьСтрока.Параметры.Сумма_314_324 = СтруктураЗначение.Раздел2_3_1_4 + СтруктураЗначение.Раздел2_3_2_4;				
					
					Если СтруктураЗначение.Раздел4_14_2 > 0 И СтруктураЗначение.Раздел2_3_1_4 + СтруктураЗначение.Раздел2_3_2_4 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 63 + КолДопКолонок, 1, 64 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;  
						
						ОписаниеУсловия = "если (строка 14.2 раздела IV > 0), то (строки 3.1.4 + 3.2.4 раздела II) = 0 ";   			
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_14_2 ) +" > 0; строки 3.1.4 + 3.2.4 раздела II) = " + Строка(СтруктураЗначение.Раздел2_3_1_4) +" + " + Строка(СтруктураЗначение.Раздел2_3_2_4);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.9"); 
						
					КонецЕсли;
					
					// 04.98.10
					ОбластьСтрока.Параметры.Сумма_317_327 = СтруктураЗначение.Раздел2_3_1_7 + СтруктураЗначение.Раздел2_3_2_7;				
					ОбластьСтрока.Параметры.Раздел4_14_3 = СтруктураЗначение.Раздел4_14_3;
					
					Если СтруктураЗначение.Раздел4_14_3 > 0 И СтруктураЗначение.Раздел2_3_1_7 + СтруктураЗначение.Раздел2_3_2_7 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 65 + КолДопКолонок, 1, 66 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;  
						
						ОписаниеУсловия = "если (строка 14.3 раздела IV > 0), то (строки 3.1.7 + 3.2.7 раздела II) = 0 ";   			
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_14_3 ) +" > 0; строки 3.1.7 + 3.2.7 раздела II) = " + Строка(СтруктураЗначение.Раздел2_3_1_7) +" + " + Строка(СтруктураЗначение.Раздел2_3_2_7);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.10"); 
						
					КонецЕсли;
					
					// 04.98.11
					ОбластьСтрока.Параметры.Сумма_318_328 = СтруктураЗначение.Раздел2_3_1_8 + СтруктураЗначение.Раздел2_3_2_8;				
					//ОбластьСтрока.Параметры.Раздел4_14_3 = СтруктураЗначение.Раздел4_14_3;
					
					Если СтруктураЗначение.Раздел4_14_3 > 0 И СтруктураЗначение.Раздел2_3_1_8 + СтруктураЗначение.Раздел2_3_2_8 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 67 + КолДопКолонок, 1, 68 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;  
						
						ОписаниеУсловия = "если (строка 14.3 раздела IV > 0), то (строки 3.1.8 + 3.2.8 раздела II) = 0 ";   			
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_14_3 ) +" > 0; строки 3.1.8 + 3.2.8 раздела II) = " + Строка(СтруктураЗначение.Раздел2_3_1_8) +" + " + Строка(СтруктураЗначение.Раздел2_3_2_8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.11"); 
						
					КонецЕсли;
					
					// 04.98.12
					ОбластьСтрока.Параметры.Сумма_3171_3271 = СтруктураЗначение.Раздел2_3_1_7_1 + СтруктураЗначение.Раздел2_3_2_7_1;				
					ОбластьСтрока.Параметры.Раздел4_14_3_1 = СтруктураЗначение.Раздел4_14_3_1;
					
					Если СтруктураЗначение.Раздел4_14_3_1 > 0 И СтруктураЗначение.Раздел2_3_1_7_1 + СтруктураЗначение.Раздел2_3_2_7_1 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 69 + КолДопКолонок, 1, 70 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;  
						
						ОписаниеУсловия = "если (строка 14.3.1 раздела IV > 0), то (строки 3.1.7.1 + 3.2.7.1 раздела II) = 0 ";   			
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_14_3_1 ) +" > 0; строки 3.1.7.1 + 3.2.7.1 раздела II) = " + Строка(СтруктураЗначение.Раздел2_3_1_7_1) +" + " + Строка(СтруктураЗначение.Раздел2_3_2_7_1);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.12"); 
						
					КонецЕсли;
					
					// 04.98.13
					ОбластьСтрока.Параметры.Сумма_3172_3272 = СтруктураЗначение.Раздел2_3_1_7_2 + СтруктураЗначение.Раздел2_3_2_7_2;				
					ОбластьСтрока.Параметры.Раздел4_14_3_2 = СтруктураЗначение.Раздел4_14_3_2;
					
					Если СтруктураЗначение.Раздел4_14_3_2 > 0 И СтруктураЗначение.Раздел2_3_1_7_2 + СтруктураЗначение.Раздел2_3_2_7_2 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 71 + КолДопКолонок, 1, 72 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;  
						
						ОписаниеУсловия = "если (строка 14.3.2 раздела IV > 0), то (строки 3.1.7.2 + 3.2.7.2 раздела II) = 0 ";   			
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_14_3_2 ) +" > 0; строки 3.1.7.2 + 3.2.7.2 раздела II) = " + Строка(СтруктураЗначение.Раздел2_3_1_7_2) +" + " + Строка(СтруктураЗначение.Раздел2_3_2_7_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.13"); 
						
					КонецЕсли;
					
					// 04.98.14
					ОбластьСтрока.Параметры.Сумма_3181_3281 = СтруктураЗначение.Раздел2_3_1_8_1 + СтруктураЗначение.Раздел2_3_2_8_1;				
					
					Если СтруктураЗначение.Раздел4_14_3_1 > 0 И СтруктураЗначение.Раздел2_3_1_8_1 + СтруктураЗначение.Раздел2_3_2_8_1 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 73 + КолДопКолонок, 1, 74 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;  
						
						ОписаниеУсловия = "если (строка 14.3.1 раздела IV > 0), то (строки 3.1.8.1 + 3.2.8.1  раздела II) = 0 ";   			
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_14_3_1 ) +" > 0; строки 3.1.8.1 + 3.2.8.1 раздела II) = " + Строка(СтруктураЗначение.Раздел2_3_1_8_1) +" + " + Строка(СтруктураЗначение.Раздел2_3_2_8_1);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.14"); 
						
					КонецЕсли;
					
					// 04.98.15
					ОбластьСтрока.Параметры.Сумма_3182_3282 = СтруктураЗначение.Раздел2_3_1_8_2 + СтруктураЗначение.Раздел2_3_2_8_2;				
					
					Если СтруктураЗначение.Раздел4_14_3_2 > 0 И СтруктураЗначение.Раздел2_3_1_8_2 + СтруктураЗначение.Раздел2_3_2_8_2 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 75 + КолДопКолонок, 1, 76 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;  
						
						ОписаниеУсловия = "если (строка 14.3.2 раздела IV > 0), то (строки 3.1.8.2 + 3.2.8.2 раздела II) = 0 ";   			
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_14_3_2 ) +" > 0; строки 3.1.8.2 + 3.2.8.2 раздела II) = " + Строка(СтруктураЗначение.Раздел2_3_1_8_2) +" + " + Строка(СтруктураЗначение.Раздел2_3_2_8_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.15"); 
						
					КонецЕсли;
					
					// 04.98.16
					ОбластьСтрока.Параметры.Сумма_315_325 = СтруктураЗначение.Раздел2_3_1_5 + СтруктураЗначение.Раздел2_3_2_5;  		
					
					Если (СтруктураЗначение.Раздел2_3_1_5 + СтруктураЗначение.Раздел2_3_2_5) > 0 И СтруктураЗначение.Раздел4_14_1 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 77 + КолДопКолонок, 1, 78 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   		
						
						ОписаниеУсловия = "если (строка 3.1.5 + 3.2.5 раздела II) > 0, то строка 14.1 раздела IV = 0";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_1_5 ) + " + " + Строка(СтруктураЗначение.Раздел2_3_2_5 )+" > 0; строка 14.1 = " + Строка(СтруктураЗначение.Раздел4_14_1) ;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.16");  	
					КонецЕсли;
					
					// 04.98.17
					ОбластьСтрока.Параметры.Сумма_316_326 = СтруктураЗначение.Раздел2_3_1_6 + СтруктураЗначение.Раздел2_3_2_6;  							
					
					Если (СтруктураЗначение.Раздел2_3_1_6 + СтруктураЗначение.Раздел2_3_2_6) > 0 И СтруктураЗначение.Раздел4_14_1 = 0 Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 79 + КолДопКолонок, 1, 80 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   		
						
						ОписаниеУсловия = "если (строка 3.1.6 + 3.2.6 раздела II) > 0, то строка 14.1 раздела IV = 0";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_1_6 ) + " + " + Строка(СтруктураЗначение.Раздел2_3_2_6 )+" > 0; строка 14.1 = " + Строка(СтруктураЗначение.Раздел4_14_1) ;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.17");  	
					КонецЕсли;
					
					
					// 04.98.18 				
					ОбластьСтрока.Параметры.Раздел4_11_1 = СтруктураЗначение.Раздел4_11_1;
					
					Если СтруктураЗначение.Раздел4_14_1 > 0 И СтруктураЗначение.Раздел4_11_1 = 0 Тогда  	 
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 81 + КолДопКолонок, 1, 82 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;  
						
						ОписаниеУсловия = "если (строка 14.1 раздела IV) > 0, то строка 11.1 раздела IV = 0";   			
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_14_1 ) +" > 0; строка 11.1 раздела IV = " + Строка(СтруктураЗначение.Раздел4_11_1);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.18"); 
						
					КонецЕсли;
					
					// 04.98.19
					ОбластьСтрока.Параметры.Раздел4_11_2 = СтруктураЗначение.Раздел4_11_2;
					
					Если СтруктураЗначение.Раздел4_14_2 > 0 И СтруктураЗначение.Раздел4_11_2 = 0 Тогда  	 
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 83 + КолДопКолонок, 1, 84 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						
						ОписаниеУсловия = "если (строка 14.2 раздела IV) > 0, то строка 11.2 раздела IV = 0";   			
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_14_2 ) +" > 0; строка 11.2 раздела IV = " + Строка(СтруктураЗначение.Раздел4_11_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.19"); 
						
					КонецЕсли;
					
					// 04.98.20
					ОбластьСтрока.Параметры.Раздел4_15_1 = СтруктураЗначение.Раздел4_15_1;  
					
					Если СтруктураЗначение.Раздел4_15_1 > 0 И СтруктураЗначение.Раздел4_11_1 = 0 Тогда  	 
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 85 + КолДопКолонок, 1, 86 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;  
						
						ОписаниеУсловия = "если (строка 15.1 раздела IV) > 0, то строка 11.1 раздела IV = 0";   			
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_15_1 ) +" > 0; строка 11.1 раздела IV = " + Строка(СтруктураЗначение.Раздел4_11_1);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.20"); 
						
					КонецЕсли;
					
					
					
					
					
					//04.98.21
					ОбластьСтрока.Параметры.Раздел4_15_2 = СтруктураЗначение.Раздел4_15_2;  
					
					Если СтруктураЗначение.Раздел4_15_2 > 0 И СтруктураЗначение.Раздел4_11_2 = 0 Тогда  	 
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 87 + КолДопКолонок, 1, 88 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						
						ОписаниеУсловия = "если (строка 15.2 раздела IV) > 0, то строка 11.2 раздела IV = 0";   			
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_15_2 ) +" > 0; строка 11.2 раздела IV = " + Строка(СтруктураЗначение.Раздел4_11_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.21"); 
					КонецЕсли;	 		
					
					
					// сравнение разделы 7 и 8  		
					
					СтруктураСтрок = Новый Структура;
					
					
					НайденныеСтроки = ТЗразделы7_8.НайтиСтроки(Новый Структура("КодКПК_ДатаОтчетности", СокрЛП(Выборка.КПК.Код)+"_"+Строка(Выборка.ДатаОкончанияОтчетногоПериода))); 			
					
					Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						// Добавляем графы *.1
						СтруктураСтрок.Вставить("Раздел" + НайденнаяСтрока.Раздел.Код, НайденнаяСтрока); 	
					КонецЦикла;
					
					
					
					
					// (04.98.22) 1.1(графа7)РазделаVII*2% <>1.1(графа7)РазделаVIII;     		
					ОписаниеУсловия = "1.1 (графа7) РазделаVII * 2% <> 1.1 (графа7) РазделаVIII";
					ОписаниеОшибки = "";
					Разница = Окр(СтруктураСтрок.Раздел7_1_1.Графа7 *2 /100, 3) - СтруктураСтрок.Раздел8_1_1.Графа7;
					Если ?(Разница>0, Разница, - Разница) > 1 Тогда		
						ОписаниеОшибки = Строка(Окр(СтруктураСтрок.Раздел7_1_1.Графа7 *2 /100, 3)) + " <> " + Строка(СтруктураСтрок.Раздел8_1_1.Графа7);
						ОбластьСтрока.Область(1, 89 + КолДопКолонок, 1, 89 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
						ВсегоОшибок = ВсегоОшибок + 1;  
						
						ОписаниеУсловия = "1.1 (графа7) РазделаVII * 2% <> 1.1 (графа7) РазделаVIII";   			
						ОписаниеОшибки = Строка(Окр(СтруктураСтрок.Раздел7_1_1.Графа7 *2 /100, 3)) +" <> " + Строка(СтруктураСтрок.Раздел8_1_1.Графа7);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.22"); 
						
					КонецЕсли;
					
					Проверка04_98_22 = ОписаниеУсловия+?(ОписаниеОшибки="", "", Символы.ПС+ОписаниеОшибки);					
					ОбластьСтрока.Параметры.Проверка04_98_22 = Проверка04_98_22;
					
					
					// (04.98.23) 1.1(графа8)РазделаVII*5%<>1.1(графа8)РазделаVIII    		
					ОписаниеУсловия = "1.1 (графа8) РазделаVII * 5% <> 1.1 (графа8) РазделаVIII";
					ОписаниеОшибки = "";
					Разница = Окр(СтруктураСтрок.Раздел7_1_1.Графа8 *5 /100, 3) - СтруктураСтрок.Раздел8_1_1.Графа8;   		
					Если ?(Разница>0, Разница, - Разница) > 1 Тогда		
						ОписаниеОшибки = Строка(Окр(СтруктураСтрок.Раздел7_1_1.Графа8 *5 /100, 3)) + " <> " + Строка(СтруктураСтрок.Раздел8_1_1.Графа8);
						ОбластьСтрока.Область(1, 90 + КолДопКолонок, 1, 90 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 	
						ВсегоОшибок = ВсегоОшибок + 1;   
						
					КонецЕсли;
					
					Проверка04_98_23 = ОписаниеУсловия+?(ОписаниеОшибки="", "", Символы.ПС+ОписаниеОшибки);
					ОбластьСтрока.Параметры.Проверка04_98_23 = Проверка04_98_23; 
					
					Если ОписаниеОшибки <> "" Тогда
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.23");     
					КонецЕсли;
					//	
					// ------------------------------------------------------------
					// 3 графа 
					ОписаниеОшибки3Графа = "";
					КоличествоОшибокПо3Графе = 0;
					СтрокаРазделитель = Символы.ПС + "   ";
					
					// (04.98.24) 2.1(графа3)РазделаVII*1,5%<>2.1(графа3)РазделаVIII    		
					ОписаниеУсловия = "(04.98.22) 2.1 (графа3) РазделаVII * 1,5% <> 2.1(графа3)РазделаVIII";   	
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_2_1.Графа3 *1.5 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_2_1.Графа3; 
					ОписаниеОшибки = "";
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель, "04.98.24");
					
					// (04.98.25)  3.1(графа3)РазделаVII*7%<>3.1(графа3)РазделаVIII    		
					ОписаниеУсловия = "(04.98.25) 3.1 (графа3) РазделаVII * 7% <> 3.1 (графа3) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_3_1.Графа3 *7 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_3_1.Графа3 ;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель, "04.98.25");
					
					
					// (04.98.26) 4.1(графа3)РазделаVII*15%<>4.1(графа3)РазделаVIII   		
					ОписаниеУсловия = "(04.98.26) 4.1 (графа3) РазделаVII * 15% <> 3.1 (графа3) РазделаVIII";
					ЗначениеЛевое =  Окр(СтруктураСтрок.Раздел7_4_1.Графа3 *15 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_4_1.Графа3 ;   
					ОписаниеОшибки = "";  
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель, "04.98.26");
					
					// (04.98.27) 5.1(графа3)РазделаVII*30%<>5.1(графа3)РазделаVIII   		
					ОписаниеУсловия = "(04.98.27) 5.1 (графа3) РазделаVII * 30% <> 5.1 (графа3) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_5_1.Графа3 *30 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_5_1.Графа3;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель, "04.98.27");
					
					// (04.98.28) 6.1(графа3)РазделаVII*45%<>6.1(графа3)РазделаVIII  		
					ОписаниеУсловия = "(04.98.28) 6.1 (графа3) РазделаVII * 45% <> 6.1 (графа3) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_6_1.Графа3 *45 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_6_1.Графа3;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель, "04.98.28");
					
					
					// (04.98.29) 7.1(графа3)РазделаVII*60%<>7.1(графа3)РазделаVIII  		
					ОписаниеУсловия = "(04.98.29) 7.1 (графа3) РазделаVII * 60% <> 7.1 (графа3) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_7_1.Графа3 *60 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_7_1.Графа3;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель, "04.98.29");
					
					// 10) (04.98.30) 8.1(графа3)РазделаVII*75%<>8.1(графа3)РазделаVIII  		
					ОписаниеУсловия = "(04.98.30) 8.1 (графа3) РазделаVII * 75 <> 8.1 (графа3) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_8_1.Графа3 *75 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_8_1.Графа3;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель, "04.98.30");
					
					
					// (04.98.31) 9.1(графа3)РазделаVII*100%<>9.1(графа3)РазделаVIII  		
					ОписаниеУсловия = "(04.98.31) 9.1 (графа3) РазделаVII * 100% <> 9.1 (графа3) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_9_1.Графа3 *100 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_9_1.Графа3;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель, "04.98.31");
					
					Если КоличествоОшибокПо3Графе > 0 Тогда
						ОбластьСтрока.Область(1, 91 + КолДопКолонок, 1, 91 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
					КонецЕсли;
					
					ОбластьСтрока.Параметры.КоличествоОшибокПо3Графе = ?(КоличествоОшибокПо3Графе = 0, "", КоличествоОшибокПо3Графе);				
					ОбластьСтрока.Параметры.ОписаниеОшибки3Графа = ОписаниеОшибки3Графа; 
					
					//// ------------------------------------------------------------
					//// 4 графа
					ОписаниеОшибки4Графа = "";
					КоличествоОшибокПо4Графе = 0;	
					
					// (04.98.32) 2.1(графа4)РазделаVII*3%<>2.1(графа4)РазделаVIII  		
					ОписаниеУсловия = "(04.98.32) 2.1 (графа4) РазделаVII * 3% <> 2.1 (графа4) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_2_1.Графа4 *3 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_2_1.Графа4;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель, "04.98.32");
					
					// (04.98.33) 3.1(графа4)РазделаVII*10%<>3.1(графа4)РазделаVIII  				
					ОписаниеУсловия = "(04.98.33) 3.1 (графа4) РазделаVII * 10% <> 3.1 (графа4) РазделаVIII";		
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_3_1.Графа4 *10 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_3_1.Графа4;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель, "04.98.33");
					
					// (04.98.34) 4.1(графа4)РазделаVII*20%<>4.1(графа4)РазделаVIII  		
					ОписаниеУсловия = "(04.98.34) 4.1 (графа4) РазделаVII * 20% <> 4.1 (графа4) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_4_1.Графа4 *20 /100, 3);
					ЗначениеПравое =  СтруктураСтрок.Раздел8_4_1.Графа4;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель, "04.98.34");
					
					// (04.98.35) 5.1(графа4)РазделаVII*40%<>5.1(графа4)РазделаVIII 		
					ОписаниеУсловия = "(04.98.35) 5.1 (графа4) РазделаVII * 40% <> 5.1 (графа4) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_5_1.Графа4 *40 /100, 3);
					ЗначениеПравое =  СтруктураСтрок.Раздел8_5_1.Графа4;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель, "04.98.35");
					
					// (04.98.36) 6.1(графа4)РазделаVII*50%<>6.1(графа4)РазделаVIII 		
					ОписаниеУсловия = "(04.98.36) 6.1 (графа4) РазделаVII * 50% <> 6.1 (графа4) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_6_1.Графа4 *50 /100, 3);
					ЗначениеПравое =  СтруктураСтрок.Раздел8_6_1.Графа4;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель, "04.98.36");
					
					// (04.98.37) 7.1(графа4)РазделаVII*65%<>7.1(графа4)РазделаVIII 		
					ОписаниеУсловия = "(04.98.37) 7.1 (графа4) РазделаVII * 65% <> 7.1 (графа4) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_7_1.Графа4 *65 /100, 3) ;
					ЗначениеПравое =  СтруктураСтрок.Раздел8_7_1.Графа4;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель, "04.98.37");
					
					// (04.98.38) 8.1(графа4)РазделаVII*80%<>8.1(графа4)РазделаVIII		
					ОписаниеУсловия = "(04.98.38) 8.1 (графа4) РазделаVII * 80% <> 8.1 (графа4) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_8_1.Графа4 *80 /100, 3);
					ЗначениеПравое =  СтруктураСтрок.Раздел8_8_1.Графа4;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель, "04.98.38");
					
					
					// (04.98.39) 9.1(графа4)РазделаVII*100%<>9.1(графа4)РазделаVIII		
					ОписаниеУсловия = "(04.98.39) 9.1 (графа4) РазделаVII * 100% <> 9.1 (графа4) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_9_1.Графа4 *100 /100, 3);
					ЗначениеПравое =  СтруктураСтрок.Раздел8_9_1.Графа4;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель, "04.98.39");
					
					
					Если КоличествоОшибокПо4Графе > 0 Тогда
						ОбластьСтрока.Область(1, 92 + КолДопКолонок, 1, 92 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
					КонецЕсли;
					
					ОбластьСтрока.Параметры.КоличествоОшибокПо4Графе = ?(КоличествоОшибокПо4Графе = 0, "", КоличествоОшибокПо4Графе);				
					ОбластьСтрока.Параметры.ОписаниеОшибки4Графа = ОписаниеОшибки4Графа; 
					
					
					// ------------------------------------------------------------
					// 5 графа   		
					
					ОписаниеОшибки5Графа = "";
					КоличествоОшибокПо5Графе = 0;
					
					// (04.98.40) 2.1(графа5)РазделаVII*1,5%<>2.1(графа5)РазделаVIII 		
					ОписаниеУсловия = "(04.98.40) 2.1 (графа5) РазделаVII * 1,5% <> 2.1 (графа5) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_2_1.Графа5 *1.5 /100, 3);
					ЗначениеПравое =  СтруктураСтрок.Раздел8_2_1.Графа5;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель, "04.98.40");
					
					
					// (04.98.41) 3.1(графа5)РазделаVII*7%<>3.1(графа5)РазделаVIII 		
					ОписаниеУсловия = "3.1 (графа5) РазделаVII * 7% <> 3.1 (графа5) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_3_1.Графа5 *7 /100, 3);
					ЗначениеПравое =  СтруктураСтрок.Раздел8_3_1.Графа5;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель, "04.98.41");
					
					// (04.98.42) 4.1(графа5)РазделаVII*15%<>4.1(графа5)РазделаVIII		
					ОписаниеУсловия = "(04.98.42) 4.1 (графа5) РазделаVII * 15% <> 4.1 (графа5) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_4_1.Графа5 *15 /100, 3);
					ЗначениеПравое =  СтруктураСтрок.Раздел8_4_1.Графа5;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель, "04.98.42");
					
					// (04.98.43) 5.1(графа5)РазделаVII*35%<>5.1(графа5)РазделаVIII 		
					ОписаниеУсловия = "(04.98.43) 5.1 (графа5) РазделаVII * 35% <> 5.1 (графа5) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_5_1.Графа5 *35 /100, 3);
					ЗначениеПравое =  СтруктураСтрок.Раздел8_5_1.Графа5;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель, "04.98.43");
					
					// (04.98.44) 6.1(графа5)РазделаVII*55%<>6.1(графа5)РазделаVIII 		
					ОписаниеУсловия = "(04.98.44) 6.1 (графа5) РазделаVII * 55% <> 6.1 (графа5) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_6_1.Графа5 *55 /100, 3);
					ЗначениеПравое =  СтруктураСтрок.Раздел8_6_1.Графа5;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель, "04.98.44");
					
					// (04.98.45) 7.1(графа5)РазделаVII*75%<>7.1(графа5)РазделаVIII		
					ОписаниеУсловия = "(04.98.45) 7.1 (графа5) РазделаVII * 75% <> 7.1 (графа5) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_7_1.Графа5 *75 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_7_1.Графа5;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель, "04.98.45");
					
					// (04.98.46) 8.1(графа5)РазделаVII*95%<>8.1(графа5)РазделаVIII		
					ОписаниеУсловия = "(04.98.46) 8.1 (графа5) РазделаVII * 95% <> 8.1 (графа5) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_8_1.Графа5 *95 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_8_1.Графа5;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель, "04.98.46");
					
					// (04.98.47) 9.1(графа5)РазделаVII*100%<>9.1(графа5)РазделаVIII		
					ОписаниеУсловия = "(04.98.47) 9.1 (графа5) РазделаVII * 100% <> 9.1 (графа5) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_9_1.Графа5 *100 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_9_1.Графа5;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель, "04.98.47");
					
					Если КоличествоОшибокПо5Графе > 0 Тогда
						ОбластьСтрока.Область(1, 93 + КолДопКолонок, 1, 93 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
					КонецЕсли;
					
					ОбластьСтрока.Параметры.КоличествоОшибокПо5Графе = ?(КоличествоОшибокПо5Графе = 0, "", КоличествоОшибокПо5Графе);				
					ОбластьСтрока.Параметры.ОписаниеОшибки5Графа = ОписаниеОшибки5Графа; 
					
					
					// ------------------------------------------------------------
					// 6 графа
					
					ОписаниеОшибки6Графа = "";
					КоличествоОшибокПо6Графе = 0;
					
					// (04.98.48) 2.1(графа6)РазделаVII*3%<>2.1(графа6)РазделаVIII		
					ОписаниеУсловия = "(04.98.48) 2.1 (графа6) РазделаVII * 3% <> 2.1 (графа6) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_2_1.Графа6 *3 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_2_1.Графа6;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель, "04.98.48");
					
					// (04.98.49) 3.1(графа6)РазделаVII*10%<>3.1(графа6)РазделаVIII		
					ОписаниеУсловия = "(04.98.49) 3.1 (графа6) РазделаVII * 10% <> 3.1 (графа6) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_3_1.Графа6 *10 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_3_1.Графа6;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель, "04.98.49");
					
					// (04.98.50) 4.1(графа6)РазделаVII*20%<>4.1(графа6)РазделаVIII		
					ОписаниеУсловия = "(04.98.50) 4.1 (графа6) РазделаVII * 20% <> 4.1 (графа6) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_4_1.Графа6 *20 /100, 3) ;
					ЗначениеПравое = СтруктураСтрок.Раздел8_4_1.Графа6;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель, "04.98.50");
					
					// (04.98.51) 5.1(графа6)РазделаVII*45%<>5.1(графа6)РазделаVIII 		
					ОписаниеУсловия = "(04.98.51) 5.1 (графа6) РазделаVII * 45% <> 5.1 (графа6) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_5_1.Графа6 *45 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_5_1.Графа6;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель, "04.98.51");
					
					// (04.98.52) 6.1(графа6)РазделаVII*70%<>6.1(графа6)РазделаVIII 		
					ОписаниеУсловия = "(04.98.52) 6.1 (графа6) РазделаVII * 70% <> 6.1 (графа6) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_6_1.Графа6 *70 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_6_1.Графа6;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель, "04.98.52");
					
					// (04.98.53) 7.1(графа6)РазделаVII*90%<>7.1(графа6)РазделаVIII		
					ОписаниеУсловия = "(04.98.53) 7.1 (графа6) РазделаVII * 90% <> 7.1 (графа6) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_7_1.Графа6 *90 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_7_1.Графа6;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель, "04.98.53");
					
					// (04.98.54) 8.1(графа6)РазделаVII*100%<>8.1(графа6)РазделаVIII		
					ОписаниеУсловия = "(04.98.54) 8.1 (графа6) РазделаVII * 100% <> 8.1 (графа6) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_8_1.Графа6 *100 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_8_1.Графа6;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель, "04.98.54");
					
					// (04.98.55) 9.1(графа6)РазделаVII*100%<>9.1(графа6)РазделаVIII		
					ОписаниеУсловия = "(04.98.55) 9.1 (графа6) РазделаVII * 100% <> 9.1 (графа6) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_9_1.Графа6 *100 /100, 3) ;
					ЗначениеПравое = СтруктураСтрок.Раздел8_9_1.Графа6;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель, "04.98.55");
					
					Если КоличествоОшибокПо6Графе > 0 Тогда
						ОбластьСтрока.Область(1, 94 + КолДопКолонок, 1, 94 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
					КонецЕсли;
					
					ОбластьСтрока.Параметры.КоличествоОшибокПо6Графе = ?(КоличествоОшибокПо6Графе = 0, "", КоличествоОшибокПо6Графе);				
					ОбластьСтрока.Параметры.ОписаниеОшибки6Графа = ОписаниеОшибки6Графа; 
					
					
					// ------------------------------------------------------------
					// 7 графа
					
					ОписаниеОшибки7Графа = "";
					КоличествоОшибокПо7Графе = 0;
					
					// (04.98.56) 2.1(графа6)РазделаVII*3%<>2.1(графа6)РазделаVIII		
					ОписаниеУсловия = "(04.98.56) 2.1 (графа7) РазделаVII * 5% <> 2.1 (графа7) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_2_1.Графа7 *5 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_2_1.Графа7;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель, "04.98.56");
					
					// (04.98.57) 3.1(графа7)РазделаVII*20%<>3.1(графа7)РазделаVIII		
					ОписаниеУсловия = "(04.98.57) 3.1 (графа7) РазделаVII * 20% <> 3.1 (графа7) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_3_1.Графа7 *20 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_3_1.Графа7;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель, "04.98.57");
					
					// (04.98.58) 4.1(графа7)РазделаVII*40%<>4.1(графа7)РазделаVIIII		
					ОписаниеУсловия = "(04.98.58) 4.1 (графа7) РазделаVII * 40% <> 4.1 (графа7) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_4_1.Графа7 *40 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_4_1.Графа7;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель, "04.98.58");
					
					// (04.98.59) 5.1(графа7)РазделаVII*60%<>5.1(графа7)РазделаVIII		
					ОписаниеУсловия = "(04.98.59) 5.1 (графа7) РазделаVII * 60% <> 5.1 (графа7) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_5_1.Графа7 *60 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_5_1.Графа7;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель, "04.98.59");
					
					// (04.98.60) 6.1(графа7)РазделаVII*80%<>6.1(графа7)РазделаVIII 		
					ОписаниеУсловия = "(04.98.60) 6.1 (графа7) РазделаVII * 80% <> 6.1 (графа7) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_6_1.Графа7 *80 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_6_1.Графа7;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель, "04.98.60");
					
					// (04.98.61) 7.1(графа7)РазделаVII*95%<>7.1(графа7)РазделаVIII		
					ОписаниеУсловия = "(04.98.61) 7.1 (графа7) РазделаVII * 95% <> 7.1 (графа7) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_7_1.Графа7 *95 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_7_1.Графа7;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель, "04.98.61");
					
					// (04.98.62) 8.1(графа7)РазделаVII*100%<>8.1(графа7)РазделаVIIII		
					ОписаниеУсловия = "(04.98.62) 8.1 (графа7) РазделаVII * 100% <> 8.1 (графа7) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_8_1.Графа7 *100 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_8_1.Графа7;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель, "04.98.62");
					
					// (04.98.63) 9.1(графа7)РазделаVII*100%<>9.1(графа7)РазделаVIII		
					ОписаниеУсловия = "(04.98.63) 9.1 (графа7) РазделаVII * 100% <> 9.1 (графа7) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_9_1.Графа7 *100 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_9_1.Графа7;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель, "04.98.63");
					
					Если КоличествоОшибокПо7Графе > 0 Тогда
						ОбластьСтрока.Область(1, 95 + КолДопКолонок, 1, 95 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
					КонецЕсли;
					
					ОбластьСтрока.Параметры.КоличествоОшибокПо7Графе = ?(КоличествоОшибокПо7Графе = 0, "", КоличествоОшибокПо7Графе);				
					ОбластьСтрока.Параметры.ОписаниеОшибки7Графа = ОписаниеОшибки7Графа; 
					
					// ------------------------------------------------------------
					// 8 графа
					
					ОписаниеОшибки8Графа = "";
					КоличествоОшибокПо8Графе = 0;
					
					// (04.98.64) 2.1(графа8)РазделаVII*10%<>2.1(графа8)РазделаVIII
					ОписаниеУсловия = "(04.98.64) 2.1 (графа8) РазделаVII * 10% <> 2.1 (графа8) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_2_1.Графа8 *10 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_2_1.Графа8;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель, "04.98.64");
					
					// (04.98.65) 3.1(графа8)РазделаVII*30%<>3.1(графа8)РазделаVIII		
					ОписаниеУсловия = "(04.98.65) 3.1 (графа8) РазделаVII * 30% <> 3.1 (графа8) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_3_1.Графа8 *30 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_3_1.Графа8;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель, "04.98.65");
					
					// (04.98.66) 4.1(графа8)РазделаVII*50%<>4.1(графа8)РазделаVIII		
					ОписаниеУсловия = "(04.98.66) 4.1 (графа8) РазделаVII * 50% <> 4.1 (графа8) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_4_1.Графа8 *50 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_4_1.Графа8;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель, "04.98.66");
					
					// (04.98.67) 5.1(графа8)РазделаVII*70%<>5.1(графа8)РазделаVIII		
					ОписаниеУсловия = "(04.98.67) 5.1 (графа8) РазделаVII * 70% <> 5.1 (графа8) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_5_1.Графа8 *70 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_5_1.Графа8;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель, "04.98.67");
					
					// (04.98.68) 6.1(графа8)РазделаVII*90%<>6.1(графа8)РазделаVIII		
					ОписаниеУсловия = "(04.98.68) 6.1 (графа8) РазделаVII * 90% <> 6.1 (графа8) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_6_1.Графа8 *90 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_6_1.Графа8;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель, "04.98.68");
					
					// (04.98.69) 7.1(графа8)РазделаVII*100%<>7.1(графа8)РазделаVIII		
					ОписаниеУсловия = "(04.98.69) 7.1 (графа8) РазделаVII * 100% <> 7.1 (графа8) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_7_1.Графа8 *100 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_7_1.Графа8;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель, "04.98.69");
					
					// (04.98.70) 8.1(графа8)РазделаVII*100%<>8.1(графа8)РазделаVIIII		
					ОписаниеУсловия = "(04.98.70) 8.1 (графа8) РазделаVII * 100% <> 8.1 (графа8) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_8_1.Графа8 *100 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_8_1.Графа8;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель, "04.98.70");
					
					// (04.98.71) 9.1(графа8)РазделаVII*100%<>9.1(графа8)РазделаVIII		
					ОписаниеУсловия = "9.1 (графа8) РазделаVII * 100% <> 9.1 (графа8) РазделаVIII";
					ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_9_1.Графа8 *100 /100, 3);
					ЗначениеПравое = СтруктураСтрок.Раздел8_9_1.Графа8;   
					ОписаниеОшибки = ""; 
					
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель, "04.98.71");
					
					Если КоличествоОшибокПо8Графе > 0 Тогда
						ОбластьСтрока.Область(1, 96 + КолДопКолонок, 1, 96 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
					КонецЕсли;
					
					ОбластьСтрока.Параметры.КоличествоОшибокПо8Графе = ?(КоличествоОшибокПо8Графе = 0, "", КоличествоОшибокПо8Графе);				
					ОбластьСтрока.Параметры.ОписаниеОшибки8Графа = ОписаниеОшибки8Графа; 
					
					
					
					//////////////////////////////////////////////////////
					//    Проценты                                      //
					//////////////////////////////////////////////////////
					
					// (04.98.72) 1.1(графа7)РазделаVIII/1.1(графа7)РазделаVII*100<>1.2(графа7)Раздела VIII/1.2(графа7)РазделаVII*100
					ОписаниеУсловия = "(04.98.72) 1.1 (графа7) РазделаVIII / 1.1 (графа7) РазделаVII * 100 <> 1.2 (графа7) Раздела VIII / 1.2 (графа7) Раздела VII * 100";
					ОписаниеОшибки = "";
					
					Если СтруктураСтрок.Раздел7_1_1.Графа7 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_1_1.Графа7 / СтруктураСтрок.Раздел7_1_1.Графа7*100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_1_2.Графа7 = 0 Тогда
						Если СтруктураСтрок.Раздел8_1_2.Графа7 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе	 			
							ЗначениеПравое = 0;	
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_1_2.Графа7  / СтруктураСтрок.Раздел7_1_2.Графа7*100, 0);
					КонецЕсли;      		
					
					
					Разница = ЗначениеЛевое - ЗначениеПравое;
					Если ?(Разница > 0, Разница, -Разница) > 1 Тогда		
						ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_1_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_1_1.Графа7) + " * 100 <> " + Строка(СтруктураСтрок.Раздел8_1_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_1_2.Графа7) + " * 100";
						ОбластьСтрока.Область(1, 97 + КолДопКолонок, 1, 97 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
						ВсегоОшибок = ВсегоОшибок + 1;   
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.72");   
					КонецЕсли;
					
					Проверка04_98_72 = ОписаниеУсловия+?(ОписаниеОшибки="", "", Символы.ПС+ОписаниеОшибки);					
					ОбластьСтрока.Параметры.Проверка04_98_72 = Проверка04_98_72;
					
					// (04.98.73) 1.1(графа8)РазделаVIII/1.1(графа8)РазделаVII*100<>1.2(графа8)Раздела VIII/1.2(графа8)РазделаVII*100   		
					ОписаниеУсловия = "1.1 (графа8) РазделаVIII / 1.1(графа8)РазделаVII * 100 <> 1.2 (графа8) Раздела VIII / 1.2 (графа8) РазделаVII * 100";
					ОписаниеОшибки = "";
					
					Если СтруктураСтрок.Раздел7_1_1.Графа8 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_1_1.Графа8 / СтруктураСтрок.Раздел7_1_1.Графа8*100, 0) ;
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_1_2.Графа8 = 0 Тогда
						Если СтруктураСтрок.Раздел8_1_2.Графа8 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе	 
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_1_2.Графа8 / СтруктураСтрок.Раздел7_1_2.Графа8*100, 0);
					КонецЕсли;    	
					
					Разница = ЗначениеЛевое - ЗначениеПравое;
					Если ?(Разница > 0, Разница, -Разница) > 1 Тогда		
						
						ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_1_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_1_1.Графа8) + " * 100 <> " + Строка(СтруктураСтрок.Раздел8_1_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_1_2.Графа8) + " * 100";
						
						ОбластьСтрока.Область(1, 98 + КолДопКолонок, 1, 98 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
						ВсегоОшибок = ВсегоОшибок + 1;   
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.98.73");    		
					КонецЕсли;
					
					Проверка04_98_73 = ОписаниеУсловия+?(ОписаниеОшибки="", "", Символы.ПС+ОписаниеОшибки);
					ОбластьСтрока.Параметры.Проверка04_98_73 = Проверка04_98_73; 
					
					
					// ------------------------------------------------------------
					// 3 графа проценты
					ОписаниеОшибки3Графа = "(Проценты) ";
					КоличествоОшибокПо3ГрафеПроценты = 0;
					
					
					// (04.98.74) 2.1 (графа3) РазделаVIII / 2.1 (графа3) РазделаVII*100 <> 2.2 (графа3) РазделаVIII / 2.2 (графа3) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.74) 2.1 (графа3) РазделаVIII / 2.1 (графа3) РазделаVII*100 <> 2.2 (графа3) РазделаVIII / 2.2 (графа3) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_2_1.Графа3 = 0 Тогда  
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_2_1.Графа3 / СтруктураСтрок.Раздел7_2_1.Графа3 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_2_2.Графа3 = 0 Тогда    					
						Если СтруктураСтрок.Раздел8_2_2.Графа3 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе	
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_2_2.Графа3 / СтруктураСтрок.Раздел7_2_2.Графа3 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_2_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_2_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_2_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_2_2.Графа3) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель, "04.98.74");
					
					// (04.98.75) 3.1 (графа3) РазделаVIII / 3.1 (графа3) РазделаVII*100 <> 3.2 (графа3) РазделаVIII / 3.2 (графа3) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.75) 3.1 (графа3) РазделаVIII / 3.1 (графа3) РазделаVII*100 <> 3.2 (графа3) РазделаVIII / 3.2 (графа3) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_3_1.Графа3 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_3_1.Графа3 / СтруктураСтрок.Раздел7_3_1.Графа3 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_3_2.Графа3 = 0 Тогда
						Если СтруктураСтрок.Раздел8_3_2.Графа3 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе	
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_3_2.Графа3 / СтруктураСтрок.Раздел7_3_2.Графа3 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_3_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_3_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_3_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_3_2.Графа3) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель, "04.98.75");
					
					// (04.98.76) 4.1 (графа3) РазделаVIII / 4.1 (графа3) РазделаVII*100 <> 4.2 (графа3) РазделаVIII / 4.2 (графа3) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.76) 4.1 (графа3) РазделаVIII / 4.1 (графа3) РазделаVII*100 <> 4.2 (графа3) РазделаVIII / 4.2 (графа3) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_4_1.Графа3 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_4_1.Графа3 / СтруктураСтрок.Раздел7_4_1.Графа3 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_4_2.Графа3 = 0 Тогда
						Если СтруктураСтрок.Раздел8_4_2.Графа3 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе	  
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_4_2.Графа3 / СтруктураСтрок.Раздел7_4_2.Графа3 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_4_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_4_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_4_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_4_2.Графа3) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель, "04.98.76");
					
					// (04.98.77) 5.1 (графа3) РазделаVIII / 5.1 (графа3) РазделаVII*100 <> 5.2 (графа3) РазделаVIII / 5.2 (графа3) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.77) 5.1 (графа3) РазделаVIII / 5.1 (графа3) РазделаVII*100 <> 5.2 (графа3) РазделаVIII / 5.2 (графа3) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_5_1.Графа3 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_5_1.Графа3 / СтруктураСтрок.Раздел7_5_1.Графа3 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_5_2.Графа3 = 0 Тогда
						Если СтруктураСтрок.Раздел8_5_2.Графа3 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе	  
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_5_2.Графа3 / СтруктураСтрок.Раздел7_5_2.Графа3 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_5_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_5_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_5_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_5_2.Графа3) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель, "04.98.77");
					
					// (04.98.78) 6.1 (графа3) РазделаVIII / 6.1 (графа3) РазделаVII*100 <> 6.2 (графа3) РазделаVIII / 6.2 (графа3) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.78) 6.1 (графа3) РазделаVIII / 6.1 (графа3) РазделаVII*100 <> 6.2 (графа3) РазделаVIII / 6.2 (графа3) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_6_1.Графа3 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_6_1.Графа3 / СтруктураСтрок.Раздел7_6_1.Графа3 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_6_2.Графа3 = 0 Тогда
						Если СтруктураСтрок.Раздел8_6_2.Графа3 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе	  
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_6_2.Графа3 / СтруктураСтрок.Раздел7_6_2.Графа3 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_6_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_6_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_6_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_6_2.Графа3) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель, "04.98.78");
					
					// (04.98.79) 7.1 (графа3) РазделаVIII / 7.1 (графа3) РазделаVII*100 <> 7.2 (графа3) РазделаVIII / 7.2 (графа3) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.79) 7.1 (графа3) РазделаVIII / 7.1 (графа3) РазделаVII*100 <> 7.2 (графа3) РазделаVIII / 7.2 (графа3) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_7_1.Графа3 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_7_1.Графа3 / СтруктураСтрок.Раздел7_7_1.Графа3 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_7_2.Графа3 = 0 Тогда
						Если СтруктураСтрок.Раздел8_7_2.Графа3 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_7_2.Графа3 / СтруктураСтрок.Раздел7_7_2.Графа3 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_7_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_7_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_7_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_7_2.Графа3) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель, "04.98.79");
					
					// (04.98.80) 8.1 (графа3) РазделаVIII / 8.1 (графа3) РазделаVII*100 <> 8.2 (графа3) РазделаVIII / 8.2 (графа3) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.80) 8.1 (графа3) РазделаVIII / 8.1 (графа3) РазделаVII*100 <> 8.2 (графа3) РазделаVIII / 8.2 (графа3) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_8_1.Графа3 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_8_1.Графа3 / СтруктураСтрок.Раздел7_8_1.Графа3 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_8_2.Графа3 = 0 Тогда
						Если СтруктураСтрок.Раздел8_8_2.Графа3 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_8_2.Графа3 / СтруктураСтрок.Раздел7_8_2.Графа3 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_8_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_8_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_8_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_8_2.Графа3) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель, "04.98.80");
					
					// (04.98.81) 9.1 (графа3) РазделаVIII / 9.1 (графа3) РазделаVII*100 <> 9.2 (графа3) РазделаVIII / 9.2 (графа3) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.81) 9.1 (графа3) РазделаVIII / 9.1 (графа3) РазделаVII*100 <> 9.2 (графа3) РазделаVIII / 9.2 (графа3) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_9_1.Графа3 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_9_1.Графа3 / СтруктураСтрок.Раздел7_9_1.Графа3 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_9_2.Графа3 = 0 Тогда
						Если СтруктураСтрок.Раздел8_9_2.Графа3 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_9_2.Графа3 / СтруктураСтрок.Раздел7_9_2.Графа3 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_9_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_9_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_9_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_9_2.Графа3) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель, "04.98.81");
					
					Если КоличествоОшибокПо3ГрафеПроценты > 0 Тогда
						ОбластьСтрока.Область(1, 99 + КолДопКолонок, 1, 99 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;
					КонецЕсли;
					
					ОбластьСтрока.Параметры.КоличествоОшибокПо3ГрафеПроценты = ?(КоличествоОшибокПо3ГрафеПроценты = 0, "", КоличествоОшибокПо3ГрафеПроценты);				
					ОбластьСтрока.Параметры.ОписаниеОшибки3ГрафаПроценты = ОписаниеОшибки3Графа; 
					
					// 4 графа проценты
					ОписаниеОшибки4Графа = "(Проценты) ";
					КоличествоОшибокПо4ГрафеПроценты = 0;
					
					
					// (04.98.82) 2.1 (Графа4) РазделаVIII / 2.1 (графа4) РазделаVII*100 <> 2.2 (графа4) РазделаVIII / 2.2 (графа4) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.82) 2.1 (графа4) РазделаVIII / 2.1 (графа4) РазделаVII*100 <> 2.2 (графа4) РазделаVIII / 2.2 (графа4) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_2_1.Графа4 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_2_1.Графа4 / СтруктураСтрок.Раздел7_2_1.Графа4 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_2_2.Графа4 = 0 Тогда
						Если СтруктураСтрок.Раздел8_2_2.Графа4 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_2_2.Графа4 / СтруктураСтрок.Раздел7_2_2.Графа4 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_2_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_2_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_2_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_2_2.Графа4) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель, "04.98.82");
					
					// (04.98.83) 3.1 (графа4) РазделаVIII / 3.1 (графа4) РазделаVII*100 <> 3.2 (графа4) РазделаVIII / 3.2 (графа4) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.83) 3.1 (графа4) РазделаVIII / 3.1 (графа4) РазделаVII*100 <> 3.2 (графа4) РазделаVIII / 3.2 (графа4) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_3_1.Графа4 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_3_1.Графа4 / СтруктураСтрок.Раздел7_3_1.Графа4 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_3_2.Графа4 = 0 Тогда
						Если СтруктураСтрок.Раздел8_3_2.Графа4 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе  
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_3_2.Графа4 / СтруктураСтрок.Раздел7_3_2.Графа4 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_3_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_3_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_3_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_3_2.Графа4) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель, "04.98.83");
					
					// (04.98.84) 4.1 (графа4) РазделаVIII / 4.1 (графа4) РазделаVII*100 <> 4.2 (графа4) РазделаVIII / 4.2 (графа4) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.84) 4.1 (графа4) РазделаVIII / 4.1 (графа4) РазделаVII*100 <> 4.2 (графа4) РазделаVIII / 4.2 (графа4) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_4_1.Графа4 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_4_1.Графа4 / СтруктураСтрок.Раздел7_4_1.Графа4 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_4_2.Графа4 = 0 Тогда
						Если СтруктураСтрок.Раздел8_4_2.Графа4 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе  
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_4_2.Графа4 / СтруктураСтрок.Раздел7_4_2.Графа4 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_4_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_4_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_4_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_4_2.Графа4) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель, "04.98.84");
					
					// (04.98.85) 5.1 (графа4) РазделаVIII / 5.1 (графа4) РазделаVII*100 <> 5.2 (графа4) РазделаVIII / 5.2 (графа4) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.85) 5.1 (графа4) РазделаVIII / 5.1 (графа4) РазделаVII*100 <> 5.2 (графа4) РазделаVIII / 5.2 (графа4) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_5_1.Графа4 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_5_1.Графа4 / СтруктураСтрок.Раздел7_5_1.Графа4 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_5_2.Графа4 = 0 Тогда
						Если СтруктураСтрок.Раздел8_5_2.Графа4 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_5_2.Графа4 / СтруктураСтрок.Раздел7_5_2.Графа4 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_5_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_5_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_5_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_5_2.Графа4) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель, "04.98.85");
					
					// (04.98.86) 6.1 (графа4) РазделаVIII / 6.1 (графа4) РазделаVII*100 <> 6.2 (графа4) РазделаVIII / 6.2 (графа4) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.86) 6.1 (графа4) РазделаVIII / 6.1 (графа4) РазделаVII*100 <> 6.2 (графа4) РазделаVIII / 6.2 (графа4) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_6_1.Графа4 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_6_1.Графа4 / СтруктураСтрок.Раздел7_6_1.Графа4 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_6_2.Графа4 = 0 Тогда
						Если СтруктураСтрок.Раздел8_6_2.Графа4 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе    
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_6_2.Графа4 / СтруктураСтрок.Раздел7_6_2.Графа4 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_6_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_6_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_6_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_6_2.Графа4) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель, "04.98.86");
					
					// (04.98.87) 7.1 (графа4) РазделаVIII / 7.1 (графа4) РазделаVII*100 <> 7.2 (графа4) РазделаVIII / 7.2 (графа4) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.87) 7.1 (графа4) РазделаVIII / 7.1 (графа4) РазделаVII*100 <> 7.2 (графа4) РазделаVIII / 7.2 (графа4) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_7_1.Графа4 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_7_1.Графа4 / СтруктураСтрок.Раздел7_7_1.Графа4 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_7_2.Графа4 = 0 Тогда
						Если СтруктураСтрок.Раздел8_7_2.Графа4 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_7_2.Графа4 / СтруктураСтрок.Раздел7_7_2.Графа4 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_7_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_7_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_7_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_7_2.Графа4) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель, "04.98.87");
					
					// (04.98.88) 8.1 (графа4) РазделаVIII / 8.1 (графа4) РазделаVII*100 <> 8.2 (графа4) РазделаVIII / 8.2 (графа4) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.88) 8.1 (графа4) РазделаVIII / 8.1 (графа4) РазделаVII*100 <> 8.2 (графа4) РазделаVIII / 8.2 (графа4) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_8_1.Графа4 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_8_1.Графа4 / СтруктураСтрок.Раздел7_8_1.Графа4 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_8_2.Графа4 = 0 Тогда
						Если СтруктураСтрок.Раздел8_8_2.Графа4 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_8_2.Графа4 / СтруктураСтрок.Раздел7_8_2.Графа4 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_8_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_8_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_8_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_8_2.Графа4) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель, "04.98.88");
					
					// (04.98.89) 9.1 (графа4) РазделаVIII / 9.1 (графа4) РазделаVII*100 <> 9.2 (графа4) РазделаVIII / 9.2 (графа4) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.89) 9.1 (графа4) РазделаVIII / 9.1 (графа4) РазделаVII*100 <> 9.2 (графа4) РазделаVIII / 9.2 (графа4) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_9_1.Графа4 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_9_1.Графа4 / СтруктураСтрок.Раздел7_9_1.Графа4 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_9_2.Графа4 = 0 Тогда
						Если СтруктураСтрок.Раздел8_9_2.Графа4 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_9_2.Графа4 / СтруктураСтрок.Раздел7_9_2.Графа4 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_9_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_9_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_9_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_9_2.Графа4) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель, "04.98.89");
					
					Если КоличествоОшибокПо4ГрафеПроценты > 0 Тогда
						ОбластьСтрока.Область(1, 100 + КолДопКолонок, 1, 100 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
					КонецЕсли;
					
					ОбластьСтрока.Параметры.КоличествоОшибокПо4ГрафеПроценты = ?(КоличествоОшибокПо4ГрафеПроценты = 0, "", КоличествоОшибокПо4ГрафеПроценты);				
					ОбластьСтрока.Параметры.ОписаниеОшибки4ГрафаПроценты = ОписаниеОшибки4Графа; 
					
					
					// 5 графа проценты
					ОписаниеОшибки5Графа = "(Проценты) ";
					КоличествоОшибокПо5ГрафеПроценты = 0;
					
					// (04.98.90) 2.1 (Графа5) РазделаVIII / 2.1 (Графа5) РазделаVII*100 <> 2.2 (Графа5) РазделаVIII / 2.2 (Графа5) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.90) 2.1 (Графа5) РазделаVIII / 2.1 (Графа5) РазделаVII*100 <> 2.2 (Графа5) РазделаVIII / 2.2 (Графа5) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_2_1.Графа5 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_2_1.Графа5 / СтруктураСтрок.Раздел7_2_1.Графа5 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_2_2.Графа5 = 0 Тогда
						Если СтруктураСтрок.Раздел8_2_2.Графа5 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе      
							ЗначениеПравое = 0;
						КонецЕсли; 
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_2_2.Графа5 / СтруктураСтрок.Раздел7_2_2.Графа5 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_2_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_2_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_2_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_2_2.Графа5) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель, "04.98.90");
					
					// (04.98.91) 3.1 (Графа5) РазделаVIII / 3.1 (Графа5) РазделаVII*100 <> 3.2 (Графа5) РазделаVIII / 3.2 (Графа5) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.91) 3.1 (Графа5) РазделаVIII / 3.1 (Графа5) РазделаVII*100 <> 3.2 (Графа5) РазделаVIII / 3.2 (Графа5) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_3_1.Графа5 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_3_1.Графа5 / СтруктураСтрок.Раздел7_3_1.Графа5 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_3_2.Графа5 = 0 Тогда
						Если СтруктураСтрок.Раздел8_3_2.Графа5 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_3_2.Графа5 / СтруктураСтрок.Раздел7_3_2.Графа5 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_3_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_3_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_3_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_3_2.Графа5) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель, "04.98.91");
					
					// (04.98.92) 4.1 (Графа5) РазделаVIII / 4.1 (Графа5) РазделаVII*100 <> 4.2 (Графа5) РазделаVIII / 4.2 (Графа5) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.92) 4.1 (Графа5) РазделаVIII / 4.1 (Графа5) РазделаVII*100 <> 4.2 (Графа5) РазделаVIII / 4.2 (Графа5) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_4_1.Графа5 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_4_1.Графа5 / СтруктураСтрок.Раздел7_4_1.Графа5 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_4_2.Графа5 = 0 Тогда
						Если СтруктураСтрок.Раздел8_4_2.Графа5 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли; 
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_4_2.Графа5 / СтруктураСтрок.Раздел7_4_2.Графа5 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_4_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_4_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_4_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_4_2.Графа5) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель, "04.98.92");
					
					// (04.98.93) 5.1 (Графа5) РазделаVIII / 5.1 (Графа5) РазделаVII*100 <> 5.2 (Графа5) РазделаVIII / 5.2 (Графа5) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.93) 5.1 (Графа5) РазделаVIII / 5.1 (Графа5) РазделаVII*100 <> 5.2 (Графа5) РазделаVIII / 5.2 (Графа5) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_5_1.Графа5 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_5_1.Графа5 / СтруктураСтрок.Раздел7_5_1.Графа5 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_5_2.Графа5 = 0 Тогда
						Если СтруктураСтрок.Раздел8_5_2.Графа5 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_5_2.Графа5 / СтруктураСтрок.Раздел7_5_2.Графа5 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_5_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_5_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_5_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_5_2.Графа5) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель, "04.98.93");
					
					
					// (04.98.94) 6.1 (Графа5) РазделаVIII / 6.1 (Графа5) РазделаVII*100 <> 6.2 (Графа5) РазделаVIII / 6.2 (Графа5) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.94) 6.1 (Графа5) РазделаVIII / 6.1 (Графа5) РазделаVII*100 <> 6.2 (Графа5) РазделаVIII / 6.2 (Графа5) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_6_1.Графа5 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_6_1.Графа5 / СтруктураСтрок.Раздел7_6_1.Графа5 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_6_2.Графа5 = 0 Тогда
						Если СтруктураСтрок.Раздел8_6_2.Графа5 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе  
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_6_2.Графа5 / СтруктураСтрок.Раздел7_6_2.Графа5 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_6_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_6_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_6_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_6_2.Графа5) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель, "04.98.94");
					
					// (04.98.95) 7.1 (Графа5) РазделаVIII / 7.1 (Графа5) РазделаVII*100 <> 7.2 (Графа5) РазделаVIII / 7.2 (Графа5) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.95) 7.1 (Графа5) РазделаVIII / 7.1 (Графа5) РазделаVII*100 <> 7.2 (Графа5) РазделаVIII / 7.2 (Графа5) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_7_1.Графа5 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_7_1.Графа5 / СтруктураСтрок.Раздел7_7_1.Графа5 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_7_2.Графа5 = 0 Тогда
						Если СтруктураСтрок.Раздел8_7_2.Графа5 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_7_2.Графа5 / СтруктураСтрок.Раздел7_7_2.Графа5 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_7_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_7_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_7_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_7_2.Графа5) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель, "04.98.95");
					
					// (04.98.96) 8.1 (Графа5) РазделаVIII / 8.1 (Графа5) РазделаVII*100 <> 8.2 (Графа5) РазделаVIII / 8.2 (Графа5) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.96) 8.1 (Графа5) РазделаVIII / 8.1 (Графа5) РазделаVII*100 <> 8.2 (Графа5) РазделаVIII / 8.2 (Графа5) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_8_1.Графа5 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_8_1.Графа5 / СтруктураСтрок.Раздел7_8_1.Графа5 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_8_2.Графа5 = 0 Тогда
						Если СтруктураСтрок.Раздел8_8_2.Графа5 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_8_2.Графа5 / СтруктураСтрок.Раздел7_8_2.Графа5 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_8_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_8_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_8_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_8_2.Графа5) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель, "04.98.96");
					
					// (04.98.97) 9.1 (Графа5) РазделаVIII / 9.1 (Графа5) РазделаVII*100 <> 9.2 (Графа5) РазделаVIII / 9.2 (Графа5) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.97) 9.1 (Графа5) РазделаVIII / 9.1 (Графа5) РазделаVII*100 <> 9.2 (Графа5) РазделаVIII / 9.2 (Графа5) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_9_1.Графа5 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_9_1.Графа5 / СтруктураСтрок.Раздел7_9_1.Графа5 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_9_2.Графа5 = 0 Тогда  			
						Если СтруктураСтрок.Раздел8_9_2.Графа5 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     	
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_9_2.Графа5 / СтруктураСтрок.Раздел7_9_2.Графа5 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_9_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_9_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_9_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_9_2.Графа5) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель, "04.98.97");
					
					Если КоличествоОшибокПо5ГрафеПроценты > 0 Тогда
						ОбластьСтрока.Область(1, 101 + КолДопКолонок, 1, 101 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
					КонецЕсли;
					
					ОбластьСтрока.Параметры.КоличествоОшибокПо5ГрафеПроценты = ?(КоличествоОшибокПо5ГрафеПроценты = 0, "", КоличествоОшибокПо5ГрафеПроценты);				
					ОбластьСтрока.Параметры.ОписаниеОшибки5ГрафаПроценты = ОписаниеОшибки5Графа; 
					
					// 6 графа проценты
					ОписаниеОшибки6Графа = "(Проценты) ";
					КоличествоОшибокПо6ГрафеПроценты = 0;
					
					// (04.98.98) 2.1 (Графа6) РазделаVIII / 2.1 (Графа6) РазделаVII*100 <> 2.2 (Графа6) РазделаVIII / 2.2 (Графа6) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.98) 2.1 (Графа6) РазделаVIII / 2.1 (Графа6) РазделаVII*100 <> 2.2 (Графа6) РазделаVIII / 2.2 (Графа6) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_2_1.Графа6 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_2_1.Графа6 / СтруктураСтрок.Раздел7_2_1.Графа6 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_2_2.Графа6 = 0 Тогда
						Если СтруктураСтрок.Раздел8_2_2.Графа6 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_2_2.Графа6 / СтруктураСтрок.Раздел7_2_2.Графа6 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_2_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_2_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_2_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_2_2.Графа6) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель, "04.98.98");
					
					// (04.98.99) 3.1 (Графа6) РазделаVIII / 3.1 (Графа6) РазделаVII*100 <> 3.2 (Графа6) РазделаVIII / 3.2 (Графа6) РазделаVII*100   		
					ОписаниеУсловия = "(04.98.99) 3.1 (Графа6) РазделаVIII / 3.1 (Графа6) РазделаVII*100 <> 3.2 (Графа6) РазделаVIII / 3.2 (Графа6) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_3_1.Графа6 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_3_1.Графа6 / СтруктураСтрок.Раздел7_3_1.Графа6 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_3_2.Графа6 = 0 Тогда
						Если СтруктураСтрок.Раздел8_3_2.Графа6 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе    
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_3_2.Графа6 / СтруктураСтрок.Раздел7_3_2.Графа6 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_3_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_3_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_3_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_3_2.Графа6) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель, "04.98.99");
					
					// (04.99.0) 4.1 (Графа6) РазделаVIII / 4.1 (Графа6) РазделаVII*100 <> 4.2 (Графа6) РазделаVIII / 4.2 (Графа6) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.0) 4.1 (Графа6) РазделаVIII / 4.1 (Графа6) РазделаVII*100 <> 4.2 (Графа6) РазделаVIII / 4.2 (Графа6) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_4_1.Графа6 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_4_1.Графа6 / СтруктураСтрок.Раздел7_4_1.Графа6 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_4_2.Графа6 = 0 Тогда
						Если СтруктураСтрок.Раздел8_4_2.Графа6 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе 
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_4_2.Графа6 / СтруктураСтрок.Раздел7_4_2.Графа6 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_4_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_4_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_4_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_4_2.Графа6) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель, "04.99.0");
					
					// (04.99.1) 5.1 (Графа6) РазделаVIII / 5.1 (Графа6) РазделаVII*100 <> 5.2 (Графа6) РазделаVIII / 5.2 (Графа6) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.1) 5.1 (Графа6) РазделаVIII / 5.1 (Графа6) РазделаVII*100 <> 5.2 (Графа6) РазделаVIII / 5.2 (Графа6) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_5_1.Графа6 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_5_1.Графа6 / СтруктураСтрок.Раздел7_5_1.Графа6 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_5_2.Графа6 = 0 Тогда
						Если СтруктураСтрок.Раздел8_5_2.Графа6 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_5_2.Графа6 / СтруктураСтрок.Раздел7_5_2.Графа6 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_5_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_5_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_5_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_5_2.Графа6) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель, "04.99.1");
					
					// (04.99.2) 6.1 (Графа6) РазделаVIII / 6.1 (Графа6) РазделаVII*100 <> 6.2 (Графа6) РазделаVIII / 6.2 (Графа6) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.2) 6.1 (Графа6) РазделаVIII / 6.1 (Графа6) РазделаVII*100 <> 6.2 (Графа6) РазделаVIII / 6.2 (Графа6) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_6_1.Графа6 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_6_1.Графа6 / СтруктураСтрок.Раздел7_6_1.Графа6 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_6_2.Графа6 = 0 Тогда
						Если СтруктураСтрок.Раздел8_6_2.Графа6 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_6_2.Графа6 / СтруктураСтрок.Раздел7_6_2.Графа6 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_6_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_6_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_6_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_6_2.Графа6) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель, "04.99.2");
					
					// (04.99.3) 7.1 (Графа6) РазделаVIII / 7.1 (Графа6) РазделаVII*100 <> 7.2 (Графа6) РазделаVIII / 7.2 (Графа6) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.3) 7.1 (Графа6) РазделаVIII / 7.1 (Графа6) РазделаVII*100 <> 7.2 (Графа6) РазделаVIII / 7.2 (Графа6) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_7_1.Графа6 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_7_1.Графа6 / СтруктураСтрок.Раздел7_7_1.Графа6 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_7_2.Графа6 = 0 Тогда
						Если СтруктураСтрок.Раздел8_7_2.Графа6 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_7_2.Графа6 / СтруктураСтрок.Раздел7_7_2.Графа6 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_7_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_7_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_7_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_7_2.Графа6) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель, "04.99.3");
					
					// (04.99.4) 8.1 (Графа6) РазделаVIII / 8.1 (Графа6) РазделаVII*100 <> 8.2 (Графа6) РазделаVIII / 8.2 (Графа6) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.4) 8.1 (Графа6) РазделаVIII / 8.1 (Графа6) РазделаVII*100 <> 8.2 (Графа6) РазделаVIII / 8.2 (Графа6) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_8_1.Графа6 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_8_1.Графа6 / СтруктураСтрок.Раздел7_8_1.Графа6 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_8_2.Графа6 = 0 Тогда
						Если СтруктураСтрок.Раздел8_8_2.Графа6 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_8_2.Графа6 / СтруктураСтрок.Раздел7_8_2.Графа6 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_8_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_8_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_8_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_8_2.Графа6) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель, "04.99.4");
					
					// (04.99.5) 9.1 (Графа6) РазделаVIII / 9.1 (Графа6) РазделаVII*100 <> 9.2 (Графа6) РазделаVIII / 9.2 (Графа6) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.5) 9.1 (Графа6) РазделаVIII / 9.1 (Графа6) РазделаVII*100 <> 9.2 (Графа6) РазделаVIII / 9.2 (Графа6) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_9_1.Графа6 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_9_1.Графа6 / СтруктураСтрок.Раздел7_9_1.Графа6 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_9_2.Графа6 = 0 Тогда
						Если СтруктураСтрок.Раздел8_9_2.Графа6 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_9_2.Графа6 / СтруктураСтрок.Раздел7_9_2.Графа6 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_9_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_9_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_9_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_9_2.Графа6) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель, "04.99.5");
					
					Если КоличествоОшибокПо6ГрафеПроценты > 0 Тогда
						ОбластьСтрока.Область(1, 102 + КолДопКолонок, 1, 102 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
					КонецЕсли;
					
					ОбластьСтрока.Параметры.КоличествоОшибокПо6ГрафеПроценты = ?(КоличествоОшибокПо6ГрафеПроценты = 0, "", КоличествоОшибокПо6ГрафеПроценты);				
					ОбластьСтрока.Параметры.ОписаниеОшибки6ГрафаПроценты = ОписаниеОшибки6Графа; 
					
					// 7 графа проценты
					ОписаниеОшибки7Графа = "(Проценты) ";
					КоличествоОшибокПо7ГрафеПроценты = 0;
					
					// (04.99.6) 2.1 (Графа7) РазделаVIII / 2.1 (Графа7) РазделаVII*100 <> 2.2 (Графа7) РазделаVIII / 2.2 (Графа7) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.6) 2.1 (Графа7) РазделаVIII / 2.1 (Графа7) РазделаVII*100 <> 2.2 (Графа7) РазделаVIII / 2.2 (Графа7) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_2_1.Графа7 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_2_1.Графа7 / СтруктураСтрок.Раздел7_2_1.Графа7 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_2_2.Графа7 = 0 Тогда
						Если СтруктураСтрок.Раздел8_2_2.Графа7 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_2_2.Графа7 / СтруктураСтрок.Раздел7_2_2.Графа7 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_2_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_2_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_2_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_2_2.Графа7) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель, "04.99.6");
					
					// (04.99.7) 3.1 (Графа7) РазделаVIII / 3.1 (Графа7) РазделаVII*100 <> 3.2 (Графа7) РазделаVIII / 3.2 (Графа7) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.7) 3.1 (Графа7) РазделаVIII / 3.1 (Графа7) РазделаVII*100 <> 3.2 (Графа7) РазделаVIII / 3.2 (Графа7) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_3_1.Графа7 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_3_1.Графа7 / СтруктураСтрок.Раздел7_3_1.Графа7 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_3_2.Графа7 = 0 Тогда
						Если СтруктураСтрок.Раздел8_3_2.Графа7 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе   
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_3_2.Графа7 / СтруктураСтрок.Раздел7_3_2.Графа7 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_3_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_3_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_3_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_3_2.Графа7) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель, "04.99.7");
					
					// (04.99.8) 4.1 (Графа7) РазделаVIII / 4.1 (Графа7) РазделаVII*100 <> 4.2 (Графа7) РазделаVIII / 4.2 (Графа7) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.8) 4.1 (Графа7) РазделаVIII / 4.1 (Графа7) РазделаVII*100 <> 4.2 (Графа7) РазделаVIII / 4.2 (Графа7) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_4_1.Графа7 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_4_1.Графа7 / СтруктураСтрок.Раздел7_4_1.Графа7 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_4_2.Графа7 = 0 Тогда
						Если СтруктураСтрок.Раздел8_4_2.Графа7 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_4_2.Графа7 / СтруктураСтрок.Раздел7_4_2.Графа7 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_4_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_4_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_4_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_4_2.Графа7) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель, "04.99.8");
					
					// (04.99.9) 5.1 (Графа7) РазделаVIII / 5.1 (Графа7) РазделаVII*100 <> 5.2 (Графа7) РазделаVIII / 5.2 (Графа7) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.9) 5.1 (Графа7) РазделаVIII / 5.1 (Графа7) РазделаVII*100 <> 5.2 (Графа7) РазделаVIII / 5.2 (Графа7) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_5_1.Графа7 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_5_1.Графа7 / СтруктураСтрок.Раздел7_5_1.Графа7 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_5_2.Графа7 = 0 Тогда
						Если СтруктураСтрок.Раздел8_5_2.Графа7 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе  
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_5_2.Графа7 / СтруктураСтрок.Раздел7_5_2.Графа7 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_5_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_5_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_5_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_5_2.Графа7) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель, "04.99.9");
					
					// (04.99.10) 6.1 (Графа7) РазделаVIII / 6.1 (Графа7) РазделаVII*100 <> 6.2 (Графа7) РазделаVIII / 6.2 (Графа7) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.10) 6.1 (Графа7) РазделаVIII / 6.1 (Графа7) РазделаVII*100 <> 6.2 (Графа7) РазделаVIII / 6.2 (Графа7) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_6_1.Графа7 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_6_1.Графа7 / СтруктураСтрок.Раздел7_6_1.Графа7 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_6_2.Графа7 = 0 Тогда
						Если СтруктураСтрок.Раздел8_6_2.Графа7 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе  
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_6_2.Графа7 / СтруктураСтрок.Раздел7_6_2.Графа7 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_6_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_6_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_6_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_6_2.Графа7) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель, "04.99.10");
					
					// (04.99.11) 7.1 (Графа7) РазделаVIII / 7.1 (Графа7) РазделаVII*100 <> 7.2 (Графа7) РазделаVIII / 7.2 (Графа7) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.11) 7.1 (Графа7) РазделаVIII / 7.1 (Графа7) РазделаVII*100 <> 7.2 (Графа7) РазделаVIII / 7.2 (Графа7) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_7_1.Графа7 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_7_1.Графа7 / СтруктураСтрок.Раздел7_7_1.Графа7 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_7_2.Графа7 = 0 Тогда
						Если СтруктураСтрок.Раздел8_7_2.Графа7 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе  
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_7_2.Графа7 / СтруктураСтрок.Раздел7_7_2.Графа7 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_7_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_7_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_7_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_7_2.Графа7) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель, "04.99.11");
					
					// (04.99.12) 8.1 (Графа7) РазделаVIII / 8.1 (Графа7) РазделаVII*100 <> 8.2 (Графа7) РазделаVIII / 8.2 (Графа7) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.12) 8.1 (Графа7) РазделаVIII / 8.1 (Графа7) РазделаVII*100 <> 8.2 (Графа7) РазделаVIII / 8.2 (Графа7) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_8_1.Графа7 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_8_1.Графа7 / СтруктураСтрок.Раздел7_8_1.Графа7 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_8_2.Графа7 = 0 Тогда
						Если СтруктураСтрок.Раздел8_8_2.Графа7 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_8_2.Графа7 / СтруктураСтрок.Раздел7_8_2.Графа7 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_8_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_8_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_8_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_8_2.Графа7) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель, "04.99.12");
					
					// (04.99.13) 9.1 (Графа7) РазделаVIII / 9.1 (Графа7) РазделаVII*100 <> 9.2 (Графа7) РазделаVIII / 9.2 (Графа7) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.13) 9.1 (Графа7) РазделаVIII / 9.1 (Графа7) РазделаVII*100 <> 9.2 (Графа7) РазделаVIII / 9.2 (Графа7) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_9_1.Графа7 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_9_1.Графа7 / СтруктураСтрок.Раздел7_9_1.Графа7 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_9_2.Графа7 = 0 Тогда
						Если СтруктураСтрок.Раздел8_9_2.Графа7 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе   
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_9_2.Графа7 / СтруктураСтрок.Раздел7_9_2.Графа7 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_9_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_9_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_9_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_9_2.Графа7) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель, "04.99.13");
					
					Если КоличествоОшибокПо7ГрафеПроценты > 0 Тогда
						ОбластьСтрока.Область(1, 103 + КолДопКолонок, 1, 103 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
					КонецЕсли;
					
					ОбластьСтрока.Параметры.КоличествоОшибокПо7ГрафеПроценты = ?(КоличествоОшибокПо7ГрафеПроценты = 0, "", КоличествоОшибокПо7ГрафеПроценты);				
					ОбластьСтрока.Параметры.ОписаниеОшибки7ГрафаПроценты = ОписаниеОшибки7Графа; 
					
					// 8 графа проценты
					ОписаниеОшибки8Графа = "(Проценты) ";
					КоличествоОшибокПо8ГрафеПроценты = 0;
					
					// (04.99.14) 2.1 (Графа8) РазделаVIII / 2.1 (Графа8) РазделаVII*100 <> 2.2 (Графа8) РазделаVIII / 2.2 (Графа8) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.14) 2.1 (Графа8) РазделаVIII / 2.1 (Графа8) РазделаVII*100 <> 2.2 (Графа8) РазделаVIII / 2.2 (Графа8) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_2_1.Графа8 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_2_1.Графа8 / СтруктураСтрок.Раздел7_2_1.Графа8 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_2_2.Графа8 = 0 Тогда   			
						Если СтруктураСтрок.Раздел8_2_2.Графа8 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_2_2.Графа8 / СтруктураСтрок.Раздел7_2_2.Графа8 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_2_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_2_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_2_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_2_2.Графа8) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель, "04.99.14");
					
					// (04.99.15) 3.1 (Графа8) РазделаVIII / 3.1 (Графа8) РазделаVII*100 <> 3.2 (Графа8) РазделаVIII / 3.2 (Графа8) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.15) 3.1 (Графа8) РазделаVIII / 3.1 (Графа8) РазделаVII*100 <> 3.2 (Графа8) РазделаVIII / 3.2 (Графа8) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_3_1.Графа8 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_3_1.Графа8 / СтруктураСтрок.Раздел7_3_1.Графа8 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_3_2.Графа8 = 0 Тогда
						Если СтруктураСтрок.Раздел8_3_2.Графа8 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе  
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_3_2.Графа8 / СтруктураСтрок.Раздел7_3_2.Графа8 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_3_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_3_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_3_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_3_2.Графа8) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель,"04.99.15");
					
					// (04.99.16) 4.1 (Графа8) РазделаVIII / 4.1 (Графа8) РазделаVII*100 <> 4.2 (Графа8) РазделаVIII / 4.2 (Графа8) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.16) 4.1 (Графа8) РазделаVIII / 4.1 (Графа8) РазделаVII*100 <> 4.2 (Графа8) РазделаVIII / 4.2 (Графа8) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_4_1.Графа8 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_4_1.Графа8 / СтруктураСтрок.Раздел7_4_1.Графа8 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_4_2.Графа8 = 0 Тогда
						Если СтруктураСтрок.Раздел8_4_2.Графа8 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_4_2.Графа8 / СтруктураСтрок.Раздел7_4_2.Графа8 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_4_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_4_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_4_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_4_2.Графа8) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель, "04.99.16");
					
					// (04.99.17) 5.1 (Графа8) РазделаVIII / 5.1 (Графа8) РазделаVII*100 <> 5.2 (Графа8) РазделаVIII / 5.2 (Графа8) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.17) 5.1 (Графа8) РазделаVIII / 5.1 (Графа8) РазделаVII*100 <> 5.2 (Графа8) РазделаVIII / 5.2 (Графа8) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_5_1.Графа8 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_5_1.Графа8 / СтруктураСтрок.Раздел7_5_1.Графа8 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_5_2.Графа8 = 0 Тогда
						Если СтруктураСтрок.Раздел8_5_2.Графа8 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе     
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_5_2.Графа8 / СтруктураСтрок.Раздел7_5_2.Графа8 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_5_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_5_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_5_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_5_2.Графа8) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель, "04.99.17");
					
					// (04.99.18) 6.1 (Графа8) РазделаVIII / 6.1 (Графа8) РазделаVII*100 <> 6.2 (Графа8) РазделаVIII / 6.2 (Графа8) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.18) 6.1 (Графа8) РазделаVIII / 6.1 (Графа8) РазделаVII*100 <> 6.2 (Графа8) РазделаVIII / 6.2 (Графа8) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_6_1.Графа8 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_6_1.Графа8 / СтруктураСтрок.Раздел7_6_1.Графа8 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_6_2.Графа8 = 0 Тогда
						Если СтруктураСтрок.Раздел8_6_2.Графа8 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе 
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_6_2.Графа8 / СтруктураСтрок.Раздел7_6_2.Графа8 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_6_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_6_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_6_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_6_2.Графа8) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель, "04.99.18");
					
					// (04.99.19) 7.1 (Графа8) РазделаVIII / 7.1 (Графа8) РазделаVII*100 <> 7.2 (Графа8) РазделаVIII / 7.2 (Графа8) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.19) 7.1 (Графа8) РазделаVIII / 7.1 (Графа8) РазделаVII*100 <> 7.2 (Графа8) РазделаVIII / 7.2 (Графа8) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_7_1.Графа8 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_7_1.Графа8 / СтруктураСтрок.Раздел7_7_1.Графа8 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_7_2.Графа8 = 0 Тогда
						Если СтруктураСтрок.Раздел8_7_2.Графа8 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе  
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_7_2.Графа8 / СтруктураСтрок.Раздел7_7_2.Графа8 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_7_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_7_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_7_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_7_2.Графа8) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель, "04.99.19");
					
					// (04.99.20) 8.1 (Графа8) РазделаVIII / 8.1 (Графа8) РазделаVII*100 <> 8.2 (Графа8) РазделаVIII / 8.2 (Графа8) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.20) 8.1 (Графа8) РазделаVIII / 8.1 (Графа8) РазделаVII*100 <> 8.2 (Графа8) РазделаVIII / 8.2 (Графа8) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_8_1.Графа8 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_8_1.Графа8 / СтруктураСтрок.Раздел7_8_1.Графа8 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_8_2.Графа8 = 0 Тогда
						Если СтруктураСтрок.Раздел8_8_2.Графа8 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе  
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_8_2.Графа8 / СтруктураСтрок.Раздел7_8_2.Графа8 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_8_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_8_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_8_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_8_2.Графа8) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель, "04.99.20");
					
					// (04.99.21) 9.1 (Графа8) РазделаVIII / 9.1 (Графа8) РазделаVII*100 <> 9.2 (Графа8) РазделаVIII / 9.2 (Графа8) РазделаVII*100   		
					ОписаниеУсловия = "(04.99.21) 9.1 (Графа8) РазделаVIII / 9.1 (Графа8) РазделаVII*100 <> 9.2 (Графа8) РазделаVIII / 9.2 (Графа8) РазделаVII*100";   	
					Если СтруктураСтрок.Раздел7_9_1.Графа8 = 0 Тогда
						ЗначениеЛевое = 0;
					Иначе			
						ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_9_1.Графа8 / СтруктураСтрок.Раздел7_9_1.Графа8 *100, 0);
					КонецЕсли;
					
					Если СтруктураСтрок.Раздел7_9_2.Графа8 = 0 Тогда
						Если СтруктураСтрок.Раздел8_9_2.Графа8 = 0 Тогда
							ЗначениеПравое = ЗначениеЛевое;
						Иначе  
							ЗначениеПравое = 0;
						КонецЕсли;
					Иначе			
						ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_9_2.Графа8 / СтруктураСтрок.Раздел7_9_2.Графа8 *100, 0);
					КонецЕсли;  
					
					ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_9_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_9_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_9_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_9_2.Графа8) + "*100";    		
					ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель, "04.99.21");
					
					Если КоличествоОшибокПо8ГрафеПроценты > 0 Тогда
						ОбластьСтрока.Область(1, 104 + КолДопКолонок, 1, 104 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
					КонецЕсли;
					
					ОбластьСтрока.Параметры.КоличествоОшибокПо8ГрафеПроценты = ?(КоличествоОшибокПо8ГрафеПроценты = 0, "", КоличествоОшибокПо8ГрафеПроценты);				
					ОбластьСтрока.Параметры.ОписаниеОшибки8ГрафаПроценты = ОписаниеОшибки8Графа; 
					
					// проверки по ПСК
					ЗапросПоПСКПоДокументу = Новый Запрос;
					ЗапросПоПСКПоДокументу.МенеджерВременныхТаблиц = МВТ;
					ЗапросПоПСКПоДокументу.Текст = "      
					|ВЫБРАТЬ
					|	ОтчетностьКПКТаблицаПоказателей.Раздел КАК Раздел,
					|	ОтчетностьКПКТаблицаПоказателей.Показатель1 КАК ПСКДокумента,
					|	ЕСТЬNULL(ВТ_ЗначенияПСК.ЗначениеПСК, 0) КАК ЗначениеПСК,
					|	ЕСТЬNULL(ВТ_ЗначенияПСК.ПредельноеЗначениеПСК, 0) КАК ПредельноеЗначениеПСК
					|ИЗ
					|	Документ.ОтчетностьКПК.ТаблицаПоказателей КАК ОтчетностьКПКТаблицаПоказателей
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗначенияПСК КАК ВТ_ЗначенияПСК
					|		ПО ОтчетностьКПКТаблицаПоказателей.Раздел = ВТ_ЗначенияПСК.Раздел
					|ГДЕ
					|	ОтчетностьКПКТаблицаПоказателей.Раздел В ИЕРАРХИИ(&Раздел6)
					|	И ОтчетностьКПКТаблицаПоказателей.Ссылка = &Ссылка
					|	И ОтчетностьКПКТаблицаПоказателей.Показатель1 > 0
					|
					|УПОРЯДОЧИТЬ ПО
					|	ОтчетностьКПКТаблицаПоказателей.Раздел.КодРаздела";
					
					ЗапросПоПСКПоДокументу.УстановитьПараметр("Раздел6", Справочники.Разделы.Раздел6);
					ЗапросПоПСКПоДокументу.УстановитьПараметр("Ссылка", Выборка.ДокументОтчетности);
					
					ВыборкаПСК = ЗапросПоПСКПоДокументу.Выполнить().Выбрать();
					
					ОписаниеОшибокПоПСК = "";
					КоличествоОшибокПоПСК = 0;
					
					Пока ВыборкаПСК.Следующий() Цикл
						Если ВыборкаПСК.ПСКДокумента > ВыборкаПСК.ПредельноеЗначениеПСК Тогда
							КоличествоОшибокПоПСК = КоличествоОшибокПоПСК + 1;
							ОписаниеОшибки  = "В строке " + Строка(ВыборкаПСК.Раздел.КодРаздела) + " значение " + Строка(ВыборкаПСК.ПСКДокумента) + " > предельные значение " + Строка(ВыборкаПСК.ПредельноеЗначениеПСК) + " более чем на 1/3";				
							ОписаниеОшибокПоПСК = ОписаниеОшибокПоПСК + ?(ОписаниеОшибокПоПСК="", "", СтрокаРазделитель) + ОписаниеОшибки;  
							ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, "", ОписаниеОшибки);   
						КонецЕсли;			
					КонецЦикла;
					
					Если КоличествоОшибокПоПСК > 0 Тогда
						ОбластьСтрока.Область(1, 105 + КолДопКолонок, 1, 105 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
					КонецЕсли;
					
					ОбластьСтрока.Параметры.КоличествоОшибокПоПСК = ?(КоличествоОшибокПоПСК = 0, "", КоличествоОшибокПоПСК);				
					ОбластьСтрока.Параметры.ОписаниеОшибокПоПСК = ОписаниеОшибокПоПСК; 	
					
					// Проверка по Разделу 9
					Значение_Строка3Раздел9 = 0;
					СтруктураСтрок9 = Новый Структура();
					
					КодКПК_ДатаОтчетности = СокрЛП(Выборка.КПК.Код) + "_" + СокрЛП(Выборка.ДатаОкончанияОтчетногоПериода);
					
					НайденныеСтроки = ТЗРаздел9.НайтиСтроки(Новый Структура("КодКПК_ДатаОтчетности", КодКПК_ДатаОтчетности));
					
					Для Каждого НайденнаяСтрока ИЗ НайденныеСтроки Цикл
						
						// Добавляем графы *.1
						КодРаздела = НайденнаяСтрока.КодРаздела;
						КодРаздела = СтрЗаменить(КодРаздела, ".", "_");
						КодРаздела = СтрЗаменить(КодРаздела, ",", "_");
						
						Если КодРаздела = "-" Тогда
							Продолжить;	
						КонецЕсли;
						
						СтруктураСтрок9.Вставить("Строка" + КодРаздела, НайденнаяСтрока); 
						
						Если найденнаяСтрока.КодРаздела = "3" Тогда
							Значение_Строка3Раздел9 = НайденнаяСтрока.СуммаРазмещаемыхСредств;					
						КонецЕсли;
					КонецЦикла;
					
					СтруктураСтрок10 = Новый Структура();
					
					
					
					НайденныеСтроки = ТЗРаздел10.НайтиСтроки(Новый Структура("КодКПК_ДатаОтчетности", КодКПК_ДатаОтчетности));
					
					Для Каждого НайденнаяСтрока ИЗ НайденныеСтроки Цикл
						// Добавляем графы *.1
						СтруктураСтрок10.Вставить("Строка" + СтрЗаменить(НайденнаяСтрока.КодРаздела, ".", "_"), НайденнаяСтрока); 
					КонецЦикла;
					
					
					//	
					//
					//Если НайденныеСтроки.Количество() > 0 Тогда 			
					//	Значение_Строка3Раздел9 = НайденныеСтроки[0].СуммаРазмещаемыхСредств;				
					//КонецЕсли;
					
					// 04.99.43
					ОбластьСтрока.Параметры.Раздел9_3 = Значение_Строка3Раздел9;
					ОбластьСтрока.Параметры.Раздел2_2_2 = СтруктураЗначение.Раздел2_2_2;
					
					Если окр(Значение_Строка3Раздел9, 3)  > Окр(0.45 * СтруктураЗначение.Раздел2_2_2, 3) Тогда
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 108 + КолДопКолонок, 1, 109 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   		
						
						ОписаниеУсловия = "у КПК строка 3 раздела IX > 0,45*строка 2.2 раздела II";
						ОписаниеОшибки = Строка(Значение_Строка3Раздел9) + " > 0.45 * " + Строка(СтруктураЗначение.Раздел2_2_2) ;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.43");  	
					КонецЕсли;
					
					// 04.99.46 		
					ДокументОтчетности = Выборка.ДокументОтчетности;
					
					ДанныеПоКПК2УровняНеЗаполнены = СокрЛП(ДокументОтчетности.КПК2УровняПолноеНаименование) = "" И СокрЛП(ДокументОтчетности.КПК2УровняИНН)  = "" И СокрЛП(ДокументОтчетности.КПК2УровняОГРН) = ""	И НЕ ЗначениеЗаполнено(ДокументОтчетности.ДатаВступленияКПКВКПК2Уровня);
					
					Если Значение_Строка3Раздел9 <> 0 И ДанныеПоКПК2УровняНеЗаполнены Тогда
						
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 112 + КолДопКолонок, 1, 112 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   		
						
						ОписаниеУсловия = "Строка 3 раздела IX <> 0 при не заполненных строка 27, 28, 29, 30 раздела I";
						ОписаниеОшибки = "Строка 3 раздела IX = " + Строка(Значение_Строка3Раздел9);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.46");  	
					КонецЕсли;
					
					
					// 04.99.47 	
					ОбластьСтрока.Параметры.Раздел2_1_1_4 = СтруктураЗначение.Раздел2_1_1_4;
					
					Если СтруктураЗначение.Раздел2_1_1_4 <> 0 И ДанныеПоКПК2УровняНеЗаполнены Тогда
						
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 113 + КолДопКолонок, 1, 113 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   		
						
						ОписаниеУсловия = "Строка 1.1.4 раздела II <> 0 при не заполненных строка 27, 28, 29, 30 раздела I";
						ОписаниеОшибки = "Строка 1.1.4 раздела II = " + Строка(СтруктураЗначение.Раздел2_1_1_4);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.47");  	
					КонецЕсли;
					
					// 04.99.48 
					ОбластьСтрока.Параметры.Раздел2_1_2_4 = СтруктураЗначение.Раздел2_1_2_4;
					
					Если СтруктураЗначение.Раздел2_1_2_4 <> 0 И ДанныеПоКПК2УровняНеЗаполнены Тогда
						
						ВсегоОшибок = ВсегоОшибок + 1;   
						ОбластьСтрока.Область(1, 114 + КолДопКолонок, 1, 114 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   		
						
						ОписаниеУсловия = "Строка 1.2.4 раздела II <> 0 при не заполненных строка 27, 28, 29, 30 раздела I";
						ОписаниеОшибки = "Строка 1.2.4 раздела II = " + Строка(СтруктураЗначение.Раздел2_1_1_4);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.48");  	
					КонецЕсли;
					
					
					
					ВсегоОшибок = ВсегоОшибок + КоличествоОшибокПо3Графе + КоличествоОшибокПо4Графе + КоличествоОшибокПо5Графе + КоличествоОшибокПо6Графе + КоличествоОшибокПо7Графе + КоличествоОшибокПо8Графе + КоличествоОшибокПо3ГрафеПроценты + КоличествоОшибокПо4ГрафеПроценты + КоличествоОшибокПо5ГрафеПроценты + КоличествоОшибокПо6ГрафеПроценты + КоличествоОшибокПо7ГрафеПроценты + КоличествоОшибокПо8ГрафеПроценты + КоличествоОшибокПоПСК;
					ОбластьСтрока.Параметры.ИтогоОшибок = Строка(ВсегоОшибок);
					
					Если ВсегоОшибок > 0 Тогда
						ОбластьСтрока.Область(1, 4 + КолДопКолонок, 1, 4 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 	
					КонецЕсли;                                        	 		
					
					//		ОбластьСтрока.Параметры.ИтогоОшибок = ВсегоОшибок;				
					РезультатНадзорныеСоотношения.Вывести(ОбластьСтрока); 		
				КонецЕсли;
				
				
				// 3. КС
				Если 1 = 1 Тогда  // просто блок чтобы можно было свернуть
					ИтогоОшибокКС = 0;
					НазваниеТаблицы = "КС";
					
					ОбластьСтрокаКС.Параметры.НомерСтроки = НомерСтроки;
					ОбластьСтрокаКС.Параметры.НомерВРеестреСРО = Выборка.НомерВРеестреСРО;
					ОбластьСтрокаКС.Параметры.КраткоеНазваниеКПК = СокрЛП(Выборка.КПК.НаименованиеКраткое);
					
					Если ВидОтчета = 1 Тогда
						ОбластьСтрокаКС.Параметры.ПериодОтчетности = СРО_ЗагрузкаОтчетности.ПолучитьПредставлениеДатыотчета(Выборка.ДатаОкончанияОтчетногоПериода);
					КонецЕсли;
					
					
					ОбластьСтрокаКС.Область(1, 1, 1, 143).ЦветФона = ЦветФонаСтроки;	
					
					Если Выборка.ДокументОтчетности = null Тогда   			
						ОбластьСтрокаКС.Параметры.ДокументОтчетности  = "Нет документа";
						ОбластьСтрокаКС.Область(1, 3, 1, 3).ЦветТекста = WebЦвета.Черный;				
					Иначе	
						ОбластьСтрокаКС.Параметры.ДокументОтчетности  = Выборка.ДокументОтчетности;
						ОбластьСтрокаКС.Область(1, 3, 1, 3).ЦветТекста =  WebЦвета.Синий;
					КонецЕсли;
					
					//05.03.04.01 Раздел 1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					СуммаРазделов = СтруктураЗначение.Раздел2_1_1 + СтруктураЗначение.Раздел2_1_2 + СтруктураЗначение.Раздел2_1_3 +СтруктураЗначение.Раздел2_1_4 + СтруктураЗначение.Раздел2_1_5 + СтруктураЗначение.Раздел2_1_6 + СтруктураЗначение.Раздел2_1_7 + СтруктураЗначение.Раздел2_1_8 + СтруктураЗначение.Раздел2_1_9 + СтруктураЗначение.Раздел2_1_10 + СтруктураЗначение.Раздел2_1_11 + СтруктураЗначение.Раздел2_1_12 + СтруктураЗначение.Раздел2_1_13;
					Если СтруктураЗначение.Раздел2_1 <>  СуммаРазделов Тогда
						ОписаниеУсловия= "Значение, указанное в строке 1 Раздела II, должно быть равно сумме значений, указанных в строках 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 1.10, 1.11, 1.12 и 1.13.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_1) + " <> " + Строка(СуммаРазделов);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.01");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 6 + КолДопКолонок, 1, 6 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 6 + КолДопКолонок, 1, 6 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					Разница = СтруктураЗначение.Раздел2_1 - СуммаРазделов;
					ОбластьСтрокаКС.Параметры.Раздел1 = ?(Разница = 0, "0", Разница);			
					ОбластьСтрокаКС.Параметры.Проверка_Раздел1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					
					// 05.03.04.02 Раздел 1.1 		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";		
					
					СуммаРазделов = СтруктураЗначение.Раздел2_1_1_1 + СтруктураЗначение.Раздел2_1_1_2 + СтруктураЗначение.Раздел2_1_1_3 + СтруктураЗначение.Раздел2_1_1_4;
					Если СтруктураЗначение.Раздел2_1_1 <>  СуммаРазделов Тогда
						ОписаниеУсловия= "Значение, указанное в строке 1.1 Раздела II, должно быть равно сумме значений, указанных в строках 1.1.1, 1.1.2, 1.1.3 И 1.1.4.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_1_1) + " <> " + Строка(СуммаРазделов);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.02");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 7 + КолДопКолонок, 1, 7 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;    	
					Иначе
						ОбластьСтрокаКС.Область(1, 7 + КолДопКолонок, 1, 7 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;  
					КонецЕсли;
					
					//Разница = СтруктураЗначение.Раздел2_1_1 - СуммаРазделов;  
					//ОбластьСтрокаКС.Параметры.Раздел1_1 = ?(Разница = 0, "0", Разница);			
					ОбластьСтрокаКС.Параметры.Проверка_Раздел1_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.03 Раздел 1.2 		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";		
					
					СуммаРазделов = СтруктураЗначение.Раздел2_1_2_1 + СтруктураЗначение.Раздел2_1_2_2 + СтруктураЗначение.Раздел2_1_2_3 + СтруктураЗначение.Раздел2_1_2_4;
					Если СтруктураЗначение.Раздел2_1_2 <>  СуммаРазделов Тогда
						ОписаниеУсловия= "Значение, указанное в строке 1.2 Раздела II, должно быть равно сумме значений, указанных в строках 1.2.1, 1.2.2, 1.2.3 и 1.2.4.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_1_2) + " <> " + Строка(СуммаРазделов);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.03");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 8 + КолДопКолонок, 1, 8 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;    	
					Иначе
						ОбластьСтрокаКС.Область(1, 8 + КолДопКолонок, 1, 8 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;  
					КонецЕсли;
					
					Разница = СтруктураЗначение.Раздел2_1_2 - СуммаРазделов;
					ОбластьСтрокаКС.Параметры.Раздел2_1 =  ?(Разница = 0, "0", Разница);		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.05 Раздел 1.1.1 и 1.2.1 		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";	
					
					УсловиеРазделов3 = СтруктураСтрок.Раздел7_1_1.Графа3 = 0 И СтруктураСтрок.Раздел7_2_1.Графа3 = 0 И СтруктураСтрок.Раздел7_3_1.Графа3 = 0 И СтруктураСтрок.Раздел7_4_1.Графа3 = 0 И СтруктураСтрок.Раздел7_5_1.Графа3 = 0 И СтруктураСтрок.Раздел7_6_1.Графа3 = 0 И СтруктураСтрок.Раздел7_7_1.Графа3  = 0 И СтруктураСтрок.Раздел7_8_1.Графа3 = 0 И СтруктураСтрок.Раздел7_9_1.Графа3 = 0;
					УсловиеРазделов4 = СтруктураСтрок.Раздел7_1_1.Графа4 = 0 И СтруктураСтрок.Раздел7_2_1.Графа4 = 0 И СтруктураСтрок.Раздел7_3_1.Графа4 = 0 И СтруктураСтрок.Раздел7_4_1.Графа4 = 0 И СтруктураСтрок.Раздел7_5_1.Графа4 = 0 И СтруктураСтрок.Раздел7_6_1.Графа4 = 0 И СтруктураСтрок.Раздел7_7_1.Графа4  = 0 И СтруктураСтрок.Раздел7_8_1.Графа4 = 0 И СтруктураСтрок.Раздел7_9_1.Графа4 = 0;
					УсловиеРазделов7 = СтруктураСтрок.Раздел7_1_1.Графа7 = 0 И СтруктураСтрок.Раздел7_2_1.Графа7 = 0 И СтруктураСтрок.Раздел7_3_1.Графа7 = 0 И СтруктураСтрок.Раздел7_4_1.Графа7 = 0 И СтруктураСтрок.Раздел7_5_1.Графа7 = 0 И СтруктураСтрок.Раздел7_6_1.Графа7 = 0 И СтруктураСтрок.Раздел7_7_1.Графа7  = 0 И СтруктураСтрок.Раздел7_8_1.Графа7 = 0 И СтруктураСтрок.Раздел7_9_1.Графа7 = 0;
					УсловиеРазделов8 = СтруктураСтрок.Раздел7_1_1.Графа8 = 0 И СтруктураСтрок.Раздел7_2_1.Графа8 = 0 И СтруктураСтрок.Раздел7_3_1.Графа8 = 0 И СтруктураСтрок.Раздел7_4_1.Графа8 = 0 И СтруктураСтрок.Раздел7_5_1.Графа8 = 0 И СтруктураСтрок.Раздел7_6_1.Графа8 = 0 И СтруктураСтрок.Раздел7_7_1.Графа8  = 0 И СтруктураСтрок.Раздел7_8_1.Графа8 = 0 И СтруктураСтрок.Раздел7_9_1.Графа8 = 0;
					
					УсловиеРазделов = УсловиеРазделов3 И УсловиеРазделов4 И УсловиеРазделов7 И УсловиеРазделов8;
					
					Если (СтруктураЗначение.Раздел2_1_1_1 <> 0 ИЛИ СтруктураЗначение.Раздел2_1_2_1 <> 0) И УсловиеРазделов Тогда
						
						ОписаниеУсловия= "Если в строках 1.1.1 и (или) 1.2.1 указаны значения, отличные от нуля, то как минимум в одной из граф 3, 4, 7, 8 строк 1.1, 2.1, 3.1, 4.1, 5.1, 6.1, 7.1, 8.1 и 9.1 Раздела VII должно быть указано значение, отличное от нуля.";
						//	ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_1_2) + " <> " + Строка(СуммаРазделов);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.05");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 9 + КолДопКолонок, 1, 9 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;    	
					Иначе
						ОбластьСтрокаКС.Область(1, 9 + КолДопКолонок, 1, 9 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;  
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_1_1_1 = ОписаниеУсловия;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_1_1 = ОписаниеУсловия;
					
					// 05.03.04.06 Раздел 1.1.2 и 1.2.2 		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";	
					
					УсловиеРазделов5 = СтруктураСтрок.Раздел7_1_1.Графа5 = 0 И СтруктураСтрок.Раздел7_2_1.Графа5 = 0 И СтруктураСтрок.Раздел7_3_1.Графа5 = 0 И СтруктураСтрок.Раздел7_4_1.Графа5 = 0 И СтруктураСтрок.Раздел7_5_1.Графа5 = 0 И СтруктураСтрок.Раздел7_6_1.Графа5 = 0 И СтруктураСтрок.Раздел7_7_1.Графа5  = 0 И СтруктураСтрок.Раздел7_8_1.Графа5 = 0 И СтруктураСтрок.Раздел7_9_1.Графа5 = 0;
					УсловиеРазделов6 = СтруктураСтрок.Раздел7_1_1.Графа6 = 0 И СтруктураСтрок.Раздел7_2_1.Графа6 = 0 И СтруктураСтрок.Раздел7_3_1.Графа6 = 0 И СтруктураСтрок.Раздел7_4_1.Графа6 = 0 И СтруктураСтрок.Раздел7_5_1.Графа6 = 0 И СтруктураСтрок.Раздел7_6_1.Графа6 = 0 И СтруктураСтрок.Раздел7_7_1.Графа6  = 0 И СтруктураСтрок.Раздел7_8_1.Графа6 = 0 И СтруктураСтрок.Раздел7_9_1.Графа6 = 0;
					УсловиеРазделов7 = СтруктураСтрок.Раздел7_1_1.Графа7 = 0 И СтруктураСтрок.Раздел7_2_1.Графа7 = 0 И СтруктураСтрок.Раздел7_3_1.Графа7 = 0 И СтруктураСтрок.Раздел7_4_1.Графа7 = 0 И СтруктураСтрок.Раздел7_5_1.Графа7 = 0 И СтруктураСтрок.Раздел7_6_1.Графа7 = 0 И СтруктураСтрок.Раздел7_7_1.Графа7  = 0 И СтруктураСтрок.Раздел7_8_1.Графа7 = 0 И СтруктураСтрок.Раздел7_9_1.Графа7 = 0;
					УсловиеРазделов8 = СтруктураСтрок.Раздел7_1_1.Графа8 = 0 И СтруктураСтрок.Раздел7_2_1.Графа8 = 0 И СтруктураСтрок.Раздел7_3_1.Графа8 = 0 И СтруктураСтрок.Раздел7_4_1.Графа8 = 0 И СтруктураСтрок.Раздел7_5_1.Графа8 = 0 И СтруктураСтрок.Раздел7_6_1.Графа8 = 0 И СтруктураСтрок.Раздел7_7_1.Графа8  = 0 И СтруктураСтрок.Раздел7_8_1.Графа8 = 0 И СтруктураСтрок.Раздел7_9_1.Графа8 = 0;
					
					УсловиеРазделов = УсловиеРазделов5 И УсловиеРазделов6 И УсловиеРазделов7 И УсловиеРазделов8;
					
					Если (СтруктураЗначение.Раздел2_1_1_2 <> 0 ИЛИ СтруктураЗначение.Раздел2_1_2_2 <> 0) И УсловиеРазделов Тогда   			
						ОписаниеУсловия= "Если в строках 1.1.2 и (или) 1.2.2 Раздела II указаны значения, отличные от нуля, то как минимум в одной из граф 5, 6, 7, 8 строк 1.1, 2.1, 3.1, 4.1, 5.1, 6.1, 7.1, 8.1 и 9.1 Раздела VII должно быть указано значение, отличное от нуля.";
						//	ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_1_2) + " <> " + Строка(СуммаРазделов);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.06");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 10 + КолДопКолонок, 1, 10 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;    	
					Иначе
						ОбластьСтрокаКС.Область(1, 10 + КолДопКолонок, 1, 10 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;  
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_1_1_2 = ОписаниеУсловия;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_1_2 = ОписаниеУсловия;
					
					
					// 05.03.04.07 строках 1.1 или 1.2 
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если (СтруктураЗначение.Раздел2_1_1 <> 0 ИЛИ СтруктураЗначение.Раздел2_1_2 <> 0) И СтруктураЗначение.Раздел4_15 = 0 Тогда
						ОписаниеУсловия= "Если в строках 1.1 или 1.2 Раздела II указано значение, отличное от нуля, то и в строке 15 Раздела IV должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "1.1 = " + Строка(СтруктураЗначение.Раздел2_1_1) +"; 1.2 = " + Строка(СтруктураЗначение.Раздел2_1_2)+"; строка 15 Раздела IV = " + Строка(СтруктураЗначение.Раздел4_15);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.07");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 11 + КолДопКолонок, 1, 12 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 11 + КолДопКолонок, 1, 12 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Сумма_1_1_и_1_2 = СтруктураЗначение.Раздел2_1_1 + СтруктураЗначение.Раздел2_1_2;
					ОбластьСтрокаКС.Параметры.Раздел4_15 = СтруктураЗначение.Раздел4_15;                  		
					ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_и_1_2 =  ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;  	
					
					// 05.03.04.08 строках 1.1.1 или 1.2.1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если (СтруктураЗначение.Раздел2_1_1_1 <> 0 ИЛИ СтруктураЗначение.Раздел2_1_2_1 <> 0) И СтруктураЗначение.Раздел4_15_1 = 0 Тогда
						ОписаниеУсловия= "Если в строках 1.1.1 или 1.2.1 Раздела II указано значение, отличное от нуля, то и в строке 15.1 Раздела IV должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "1.1.1 = " + Строка(СтруктураЗначение.Раздел2_1_1_1) +"; 1.2.1 = " + Строка(СтруктураЗначение.Раздел2_1_2_1)+"; строка 15.1 Раздела IV = " + Строка(СтруктураЗначение.Раздел4_15_1);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.08");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 13 + КолДопКолонок, 1, 14 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 13 + КолДопКолонок, 1, 14 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Сумма_1_1_1_и_1_2_1 = СтруктураЗначение.Раздел2_1_1_1 + СтруктураЗначение.Раздел2_1_2_1;
					ОбластьСтрокаКС.Параметры.Раздел4_15_1 = СтруктураЗначение.Раздел4_15_1;                  		
					ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_1_и_1_2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;	
					
					
					// 05.03.04.09 строках 1.1.2 или 1.2.2
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если (СтруктураЗначение.Раздел2_1_1_2 <> 0 ИЛИ СтруктураЗначение.Раздел2_1_2_2 <> 0) И СтруктураЗначение.Раздел4_15_2 = 0 Тогда
						ОписаниеУсловия= "Если в строках 1.1.2 или 1.2.2 Раздела II указано значение, отличное от нуля, то и в строке 15.2 Раздела IV должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "1.1.2 = " + Строка(СтруктураЗначение.Раздел2_1_1_2) +"; 1.2.2 = " + Строка(СтруктураЗначение.Раздел2_1_2_2)+"; строка 15.2 Раздела IV = " + Строка(СтруктураЗначение.Раздел4_15_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.09");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 15 + КолДопКолонок, 1, 16 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 15 + КолДопКолонок, 1, 16 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Сумма_1_1_2_и_1_2_2 = СтруктураЗначение.Раздел2_1_1_2 + СтруктураЗначение.Раздел2_1_2_2;
					ОбластьСтрокаКС.Параметры.Раздел4_15_2 = СтруктураЗначение.Раздел4_15_2;                  		
					ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_2_и_1_2_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;
					
					//05.03.04.10 строках 1.1.4 или 1.2.4
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если (СтруктураЗначение.Раздел2_1_1_4 <> 0 ИЛИ СтруктураЗначение.Раздел2_1_2_4 <> 0) И СтруктураЗначение.Раздел4_15_3 = 0 Тогда
						ОписаниеУсловия= "Если в строках 1.1.4 или 1.2.4 Раздела II указано значение, отличное от нуля, то и в строке 15.3 Раздела IV должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "1.1.4 = " + Строка(СтруктураЗначение.Раздел2_1_1_4) +"; 1.2.4 = " + Строка(СтруктураЗначение.Раздел2_1_2_4)+"; строка 15.3 Раздела IV = " + Строка(СтруктураЗначение.Раздел4_15_3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.10");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 17 + КолДопКолонок, 1, 18 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 17 + КолДопКолонок, 1, 18 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Сумма_1_1_4_и_1_2_4 = СтруктураЗначение.Раздел2_1_1_4 + СтруктураЗначение.Раздел2_1_2_4;
					ОбластьСтрокаКС.Параметры.Раздел4_15_3 = СтруктураЗначение.Раздел4_15_3;                  		
					ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_4_и_1_2_4 =  ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;
					
					// 05.03.04.11 Раздел 1.8.1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";	
					
					УсловиеРазделов3 = СтруктураСтрок.Раздел7_1_2.Графа3 = 0 И СтруктураСтрок.Раздел7_2_2.Графа3 = 0 И СтруктураСтрок.Раздел7_3_2.Графа3 = 0 И СтруктураСтрок.Раздел7_4_2.Графа3 = 0 И СтруктураСтрок.Раздел7_5_2.Графа3 = 0 И СтруктураСтрок.Раздел7_6_2.Графа3 = 0 И СтруктураСтрок.Раздел7_7_2.Графа3  = 0 И СтруктураСтрок.Раздел7_8_2.Графа3 = 0 И СтруктураСтрок.Раздел7_9_2.Графа3 = 0;
					УсловиеРазделов4 = СтруктураСтрок.Раздел7_1_2.Графа4 = 0 И СтруктураСтрок.Раздел7_2_2.Графа4 = 0 И СтруктураСтрок.Раздел7_3_2.Графа4 = 0 И СтруктураСтрок.Раздел7_4_2.Графа4 = 0 И СтруктураСтрок.Раздел7_5_2.Графа4 = 0 И СтруктураСтрок.Раздел7_6_2.Графа4 = 0 И СтруктураСтрок.Раздел7_7_2.Графа4  = 0 И СтруктураСтрок.Раздел7_8_2.Графа4 = 0 И СтруктураСтрок.Раздел7_9_2.Графа4 = 0;
					УсловиеРазделов7 = СтруктураСтрок.Раздел7_1_2.Графа7 = 0 И СтруктураСтрок.Раздел7_2_2.Графа7 = 0 И СтруктураСтрок.Раздел7_3_2.Графа7 = 0 И СтруктураСтрок.Раздел7_4_2.Графа7 = 0 И СтруктураСтрок.Раздел7_5_2.Графа7 = 0 И СтруктураСтрок.Раздел7_6_2.Графа7 = 0 И СтруктураСтрок.Раздел7_7_2.Графа7  = 0 И СтруктураСтрок.Раздел7_8_2.Графа7 = 0 И СтруктураСтрок.Раздел7_9_2.Графа7 = 0;
					УсловиеРазделов8 = СтруктураСтрок.Раздел7_1_2.Графа8 = 0 И СтруктураСтрок.Раздел7_2_2.Графа8 = 0 И СтруктураСтрок.Раздел7_3_2.Графа8 = 0 И СтруктураСтрок.Раздел7_4_2.Графа8 = 0 И СтруктураСтрок.Раздел7_5_2.Графа8 = 0 И СтруктураСтрок.Раздел7_6_2.Графа8 = 0 И СтруктураСтрок.Раздел7_7_2.Графа8  = 0 И СтруктураСтрок.Раздел7_8_2.Графа8 = 0 И СтруктураСтрок.Раздел7_9_2.Графа8 = 0;
					
					УсловиеРазделов = УсловиеРазделов3 И УсловиеРазделов4 И УсловиеРазделов7 И УсловиеРазделов8;
					
					Если СтруктураЗначение.Раздел2_1_8_1 <> 0  И УсловиеРазделов Тогда
						
						ОписаниеУсловия= "Если в строке 1.8.1 Раздела II указано значение, отличное от нуля, то как минимум в одной из граф 3, 4, 7, 8 строк 1.2, 2.2, 3.2, 4.2, 5.2, 6.2, 7.2, 8.2 и 9.2 Раздела VII должно быть указано значение, отличное от нуля.";
						//	ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_1_2) + " <> " + Строка(СуммаРазделов);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.11");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 19 + КолДопКолонок, 1, 19 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;    	
					Иначе
						ОбластьСтрокаКС.Область(1, 19 + КолДопКолонок, 1, 19 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;  
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_1_8_1 = ОписаниеУсловия;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_8_1 = ОписаниеУсловия;
					
					// 05.03.04.12 Раздел 1.8.2
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";	
					
					УсловиеРазделов5 = СтруктураСтрок.Раздел7_1_2.Графа5 = 0 И СтруктураСтрок.Раздел7_2_2.Графа5 = 0 И СтруктураСтрок.Раздел7_3_2.Графа5 = 0 И СтруктураСтрок.Раздел7_4_2.Графа5 = 0 И СтруктураСтрок.Раздел7_5_2.Графа5 = 0 И СтруктураСтрок.Раздел7_6_2.Графа5 = 0 И СтруктураСтрок.Раздел7_7_2.Графа5  = 0 И СтруктураСтрок.Раздел7_8_2.Графа5 = 0 И СтруктураСтрок.Раздел7_9_2.Графа5 = 0;
					УсловиеРазделов6 = СтруктураСтрок.Раздел7_1_2.Графа6 = 0 И СтруктураСтрок.Раздел7_2_2.Графа6 = 0 И СтруктураСтрок.Раздел7_3_2.Графа6 = 0 И СтруктураСтрок.Раздел7_4_2.Графа6 = 0 И СтруктураСтрок.Раздел7_5_2.Графа6 = 0 И СтруктураСтрок.Раздел7_6_2.Графа6 = 0 И СтруктураСтрок.Раздел7_7_2.Графа6  = 0 И СтруктураСтрок.Раздел7_8_2.Графа6 = 0 И СтруктураСтрок.Раздел7_9_2.Графа6 = 0;
					УсловиеРазделов7 = СтруктураСтрок.Раздел7_1_2.Графа7 = 0 И СтруктураСтрок.Раздел7_2_2.Графа7 = 0 И СтруктураСтрок.Раздел7_3_2.Графа7 = 0 И СтруктураСтрок.Раздел7_4_2.Графа7 = 0 И СтруктураСтрок.Раздел7_5_2.Графа7 = 0 И СтруктураСтрок.Раздел7_6_2.Графа7 = 0 И СтруктураСтрок.Раздел7_7_2.Графа7  = 0 И СтруктураСтрок.Раздел7_8_2.Графа7 = 0 И СтруктураСтрок.Раздел7_9_2.Графа7 = 0;
					УсловиеРазделов8 = СтруктураСтрок.Раздел7_1_2.Графа8 = 0 И СтруктураСтрок.Раздел7_2_2.Графа8 = 0 И СтруктураСтрок.Раздел7_3_2.Графа8 = 0 И СтруктураСтрок.Раздел7_4_2.Графа8 = 0 И СтруктураСтрок.Раздел7_5_2.Графа8 = 0 И СтруктураСтрок.Раздел7_6_2.Графа8 = 0 И СтруктураСтрок.Раздел7_7_2.Графа8  = 0 И СтруктураСтрок.Раздел7_8_2.Графа8 = 0 И СтруктураСтрок.Раздел7_9_2.Графа8 = 0;
					
					УсловиеРазделов = УсловиеРазделов5 И УсловиеРазделов6 И УсловиеРазделов7 И УсловиеРазделов8;
					
					Если СтруктураЗначение.Раздел2_1_8_2 <> 0  И УсловиеРазделов Тогда
						
						ОписаниеУсловия = "Если в строках 1.8.2 Раздела II указано значение, отличное от нуля, то как минимум в одной из граф 5, 6, 7, 8 строк 1.2, 2.2, 3.2, 4.2, 5.2, 6.2, 7.2, 8.2 и 9.2 Раздела VII должно быть указано значение, отличное от нуля.";
						//	ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_1_2) + " <> " + Строка(СуммаРазделов);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.12");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 20 + КолДопКолонок, 1, 20 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;    	
					Иначе
						ОбластьСтрокаКС.Область(1, 20 + КолДопКолонок, 1, 20 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;  
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_1_8_2 = ОписаниеУсловия;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_8_2 = ОписаниеУсловия;
					
					// 05.03.04.13 строках 1.3
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел2_1_3 < СтруктураЗначение.Раздел2_1_3_1 + СтруктураЗначение.Раздел2_1_3_2 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 1.3 Раздела II, должно быть больше или равно сумме значений, указанных в строках 1.3.1 и 1.3.2.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_1_3) +" < " + Строка(СтруктураЗначение.Раздел2_1_3_1 + СтруктураЗначение.Раздел2_1_3_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.13");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 21 + КолДопКолонок, 1, 21 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 21 + КолДопКолонок, 1, 21 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_1_3 = СтруктураЗначение.Раздел2_1_3 - СтруктураЗначение.Раздел2_1_3_1  - СтруктураЗначение.Раздел2_1_3_2;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_3 =  ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.14 строках 1.4
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел2_1_4 < СтруктураЗначение.Раздел2_1_4_1 + СтруктураЗначение.Раздел2_1_4_2 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 1.4 Раздела II, должно быть больше или равно сумме значений, указанных в строках 1.4.1 и 1.4.2.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_1_4) +" < " + Строка(СтруктураЗначение.Раздел2_1_4_1 + СтруктураЗначение.Раздел2_1_4_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.14");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 22 + КолДопКолонок, 1, 22 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 22 + КолДопКолонок, 1, 22 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_1_4 = СтруктураЗначение.Раздел2_1_4 - СтруктураЗначение.Раздел2_1_4_1  - СтруктураЗначение.Раздел2_1_4_2;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_4 =  ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.15 строках 1.5
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел2_1_5 < СтруктураЗначение.Раздел2_1_5_1 + СтруктураЗначение.Раздел2_1_5_2 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 1.5 Раздела II, должно быть равно сумме значений, указанных в строках 1.5.1 и 1.5.2.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_1_5) +" < " + Строка(СтруктураЗначение.Раздел2_1_5_1 + СтруктураЗначение.Раздел2_1_5_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.15");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 23 + КолДопКолонок, 1, 23 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 23 + КолДопКолонок, 1, 23 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_1_5 = СтруктураЗначение.Раздел2_1_5 - СтруктураЗначение.Раздел2_1_5_1  - СтруктураЗначение.Раздел2_1_5_2;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_5 =  ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.16 строках 1.7
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел2_1_7 < СтруктураЗначение.Раздел2_1_7_1 + СтруктураЗначение.Раздел2_1_7_2 + СтруктураЗначение.Раздел2_1_7_3 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 1.7 Раздела II, должно быть равно сумме значений, указанных в строках 1.7.1, 1.7.2 и 1.7.3.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_1_7) +" < " + Строка(СтруктураЗначение.Раздел2_1_7_1 + СтруктураЗначение.Раздел2_1_7_2 + СтруктураЗначение.Раздел2_1_7_3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.16");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 24 + КолДопКолонок, 1, 24 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 24 + КолДопКолонок, 1, 24 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_1_7 = СтруктураЗначение.Раздел2_1_7 - СтруктураЗначение.Раздел2_1_7_1  - СтруктураЗначение.Раздел2_1_7_2  - СтруктураЗначение.Раздел2_1_7_3;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_7 =  ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.17 строках 1.8
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел2_1_8 < СтруктураЗначение.Раздел2_1_8_1 + СтруктураЗначение.Раздел2_1_8_2 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 1.8 Раздела II, должно быть больше или равно сумме значений, указанных в строках 1.8.1 и 1.8.2";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_1_8) +" < " + Строка(СтруктураЗначение.Раздел2_1_8_1 + СтруктураЗначение.Раздел2_1_8_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.17");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 25 + КолДопКолонок, 1, 25 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 25 + КолДопКолонок, 1, 25 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_1_8 = СтруктураЗначение.Раздел2_1_8 - СтруктураЗначение.Раздел2_1_8_1  - СтруктураЗначение.Раздел2_1_8_2;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_8 =  ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.18 строках 1.12
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел2_1_12 < СтруктураЗначение.Раздел2_1_12_1 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 1.12, должно быть больше или равно значению, указанному в строке 1.12.1.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_1_12) +" < " + Строка(СтруктураЗначение.Раздел2_1_12_1);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.18");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 26 + КолДопКолонок, 1, 26 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 26 + КолДопКолонок, 1, 26 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_1_12 = СтруктураЗначение.Раздел2_1_12 - СтруктураЗначение.Раздел2_1_12_1;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_12 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.19 строках 1.12.1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел2_1_12_1 < СтруктураЗначение.Раздел2_1_12_1_1 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 1.12.1 Раздела II, должно быть больше или равно значению, указанному в строке 1.12.1.1.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_1_12_1) +" < " + Строка(СтруктураЗначение.Раздел2_1_12_1_1);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.19");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 27 + КолДопКолонок, 1, 27 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 27 + КолДопКолонок, 1, 27 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_1_12_1 = СтруктураЗначение.Раздел2_1_12_1  - СтруктураЗначение.Раздел2_1_12_1_1;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_12_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.20 строках 1.12.1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  
					
					Массив_1 = Выборка.ДокументОтчетности.ТаблицаПоказателей.НайтиСтроки(Новый Структура("Раздел", Справочники.Разделы.Раздел5_1));		
					Раздел5_1_Графа6 = Массив_1[0].Показатель4;
					Массив_2 = Выборка.ДокументОтчетности.ТаблицаПоказателей.НайтиСтроки(Новый Структура("Раздел", Справочники.Разделы.Раздел5_2));		
					Раздел5_2_Графа6 = Массив_2[0].Показатель4;
					Массив_3 = Выборка.ДокументОтчетности.ТаблицаПоказателей.НайтиСтроки(Новый Структура("Раздел", Справочники.Разделы.Раздел5_3));		
					Раздел5_3_Графа6 = Массив_3[0].Показатель4;   
					
					
					Если СтруктураЗначение.Раздел2_1_12 < Раздел5_1_Графа6 + Раздел5_2_Графа6 + Раздел5_3_Графа6 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 1.12 Раздела II, должно быть больше или равно сумме значений строк 1, 2 и 3, указанных в графе 6 Раздела V.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_1_12) +" < " + Строка(Раздел5_1_Графа6 + Раздел5_2_Графа6 + Раздел5_3_Графа6);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.20");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 28 + КолДопКолонок, 1, 28 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 28 + КолДопКолонок, 1, 28 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_1_12_Графы = СтруктураЗначение.Раздел2_1_12  - Раздел5_1_Графа6 - Раздел5_2_Графа6 - Раздел5_3_Графа6 ;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_12_Графы = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 		
					
					
					// 05.03.04.21 строках 2
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел2_2 <> СтруктураЗначение.Раздел2_2_1 + СтруктураЗначение.Раздел2_2_2 + СтруктураЗначение.Раздел2_2_3 + СтруктураЗначение.Раздел2_2_4 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 2 Раздела II, должно быть равно сумме значений, указанных в строке 2.1, 2.2, 2.3 и 2.4.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_2) +" <> " + Строка(СтруктураЗначение.Раздел2_2_1 + СтруктураЗначение.Раздел2_2_2 + СтруктураЗначение.Раздел2_2_3 + СтруктураЗначение.Раздел2_2_4);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.21");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 29 + КолДопКолонок, 1, 29 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 29 + КолДопКолонок, 1, 29 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_2 = СтруктураЗначение.Раздел2_2 - СтруктураЗначение.Раздел2_2_1 - СтруктураЗначение.Раздел2_2_2 - СтруктураЗначение.Раздел2_2_3 - СтруктураЗначение.Раздел2_2_4;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.22 строках 2_1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел2_2_1 < СтруктураЗначение.Раздел2_2_1_1 + СтруктураЗначение.Раздел2_2_1_2 + СтруктураЗначение.Раздел2_2_1_3 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 2.1, должно быть равно сумме значений, указанных в строках 2.1.1, 2.1.2 и 2.1.3.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_2_1) +" < " + Строка(СтруктураЗначение.Раздел2_2_1_1 + СтруктураЗначение.Раздел2_2_1_2 + СтруктураЗначение.Раздел2_2_1_3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.22");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 30 + КолДопКолонок, 1, 30 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 30 + КолДопКолонок, 1, 30 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_2_1 = СтруктураЗначение.Раздел2_2_1 - СтруктураЗначение.Раздел2_2_1_1 - СтруктураЗначение.Раздел2_2_1_2 - СтруктураЗначение.Раздел2_2_1_3;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.23 строках 2_1.1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел2_2_1_1 < СтруктураЗначение.Раздел2_2_1_1_1 + СтруктураЗначение.Раздел2_2_1_1_2 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 2.1 Раздела II, должно быть больше или равно сумме значений, указанных в строках 2.1.1 и 2.1.2.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_2_1_1) +" < " + Строка(СтруктураЗначение.Раздел2_2_1_1_1 + СтруктураЗначение.Раздел2_2_1_1_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.23");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 31 + КолДопКолонок, 1, 31 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 31 + КолДопКолонок, 1, 31 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_2_1_1 = СтруктураЗначение.Раздел2_2_1_1 - СтруктураЗначение.Раздел2_2_1_1_1 - СтруктураЗначение.Раздел2_2_1_1_2;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_2_1_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.24 строках 2_1.2
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел2_2_1_2 < СтруктураЗначение.Раздел2_2_1_2_1 + СтруктураЗначение.Раздел2_2_1_2_2 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 2.1.2 Раздела II, должно быть больше или равно сумме значений, указанных в строках 2.1.2.1 и 2.1.2.2.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_2_1_2) +" < " + Строка(СтруктураЗначение.Раздел2_2_1_2_1 + СтруктураЗначение.Раздел2_2_1_2_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.24");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 32 + КолДопКолонок, 1, 32 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 32 + КолДопКолонок, 1, 32 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_2_1_2 = СтруктураЗначение.Раздел2_2_1_2 - СтруктураЗначение.Раздел2_2_1_2_1 - СтруктураЗначение.Раздел2_2_1_2_2;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_2_1_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.25 строках 2.3
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел2_2_3 < СтруктураЗначение.Раздел2_2_3_1 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 2.3 Раздела II, должно быть больше или равно значению, указанному в строке 2.3.1.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_2_3) +" < " + Строка(СтруктураЗначение.Раздел2_2_3_1);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.25");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 33 + КолДопКолонок, 1, 33 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 33 + КолДопКолонок, 1, 33 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_2_3 = СтруктураЗначение.Раздел2_2_3 - СтруктураЗначение.Раздел2_2_3_1 ;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_2_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.26 строках 3.1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел2_3_1 < СтруктураЗначение.Раздел2_3_1_1 + СтруктураЗначение.Раздел2_3_1_2 + СтруктураЗначение.Раздел2_3_1_3 + СтруктураЗначение.Раздел2_3_1_4 + СтруктураЗначение.Раздел2_3_1_5 + СтруктураЗначение.Раздел2_3_1_6 + СтруктураЗначение.Раздел2_3_1_7 + СтруктураЗначение.Раздел2_3_1_8 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 3.1, должно быть равно сумме значений, указанных в строках 3.1.1, 3.1.2, 3.1.3, 3.1.4, 3.1.5, 3.1.6, 3.1.7 и 3.1.8.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_1) +" < " + Строка(СтруктураЗначение.Раздел2_3_1_1 - СтруктураЗначение.Раздел2_3_1_2 - СтруктураЗначение.Раздел2_3_1_3 - СтруктураЗначение.Раздел2_3_1_4 - СтруктураЗначение.Раздел2_3_1_5 - СтруктураЗначение.Раздел2_3_1_6 - СтруктураЗначение.Раздел2_3_1_7 - СтруктураЗначение.Раздел2_3_1_8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.26");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 34 + КолДопКолонок, 1, 34 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 34 + КолДопКолонок, 1, 34 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_3_1 = СтруктураЗначение.Раздел2_3_1 - СтруктураЗначение.Раздел2_3_1_1 - СтруктураЗначение.Раздел2_3_1_2 - СтруктураЗначение.Раздел2_3_1_3 - СтруктураЗначение.Раздел2_3_1_4 - СтруктураЗначение.Раздел2_3_1_5 - СтруктураЗначение.Раздел2_3_1_6 - СтруктураЗначение.Раздел2_3_1_7 - СтруктураЗначение.Раздел2_3_1_8;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_3_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					//	// строках 3.1.2
					//	ОписаниеУсловия = "";
					//	ОписаниеОшибки = "";  		
					//	
					//	Если СтруктураЗначение.Раздел2_3_1_2 < СтруктураЗначение.Раздел2_3_1_2_1 Тогда
					//		ОписаниеУсловия= "Значение, указанное в строке 3.1.2 Раздела II, должно быть больше или равно значению, указанному в строке 3.1.2.1.";
					//		ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_1_2) +" < " + Строка(СтруктураЗначение.Раздел2_3_1_2_1);
					//		ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
					//		ИтогоОшибокКС = ИтогоОшибокКС + 1;
					//		
					//		ОбластьСтрокаКС.Область(1, 35 + КолДопКолонок, 1, 35 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					//	Иначе
					//		ОбластьСтрокаКС.Область(1, 35 + КолДопКолонок, 1, 35 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					//	КонецЕсли;
					//	
					//	ОбластьСтрокаКС.Параметры.Раздел2_3_1_2 = СтруктураЗначение.Раздел2_3_1_2 - СтруктураЗначение.Раздел2_3_1_2_1;		
					//	ОбластьСтрокаКС.Параметры.Проверка_Раздел2_3_1_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					//	
					// 05.03.04.28 строках 3.1.3
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел2_3_1_3 < СтруктураЗначение.Раздел2_3_1_3_1 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 3.1.3, должно быть больше или равно значению, указанному в строке 3.1.3.1.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_1_3) +" <> " + Строка(СтруктураЗначение.Раздел2_3_1_3_1);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.28");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 36 + КолДопКолонок, 1, 36 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 36 + КолДопКолонок, 1, 36 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_3_1_3 = СтруктураЗначение.Раздел2_3_1_3 - СтруктураЗначение.Раздел2_3_1_3_1;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_3_1_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.29 строках 3.2
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел2_3_2 <> СтруктураЗначение.Раздел2_3_2_1 + СтруктураЗначение.Раздел2_3_2_2 + СтруктураЗначение.Раздел2_3_2_3 + СтруктураЗначение.Раздел2_3_2_4 + СтруктураЗначение.Раздел2_3_2_5 + СтруктураЗначение.Раздел2_3_2_6 + СтруктураЗначение.Раздел2_3_2_7 + СтруктураЗначение.Раздел2_3_2_8 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 3.2, должно быть равно сумме значений, указанных в строках 3.2.1, 3.2.2, 3.2.3, 3.2.4, 3.2.5, 3.2.6, 3.2.7 и 3.2.8.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_2) +" <> " + Строка(СтруктураЗначение.Раздел2_3_2_1 + СтруктураЗначение.Раздел2_3_2_2 + СтруктураЗначение.Раздел2_3_2_3 + СтруктураЗначение.Раздел2_3_2_4 + СтруктураЗначение.Раздел2_3_2_5 + СтруктураЗначение.Раздел2_3_2_6 + СтруктураЗначение.Раздел2_3_2_7 + СтруктураЗначение.Раздел2_3_2_8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.29");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 37 + КолДопКолонок, 1, 37 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 37 + КолДопКолонок, 1, 37 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_3_2 = СтруктураЗначение.Раздел2_3_2 - СтруктураЗначение.Раздел2_3_2_1 - СтруктураЗначение.Раздел2_3_2_2 - СтруктураЗначение.Раздел2_3_2_3 - СтруктураЗначение.Раздел2_3_2_4 - СтруктураЗначение.Раздел2_3_2_5 - СтруктураЗначение.Раздел2_3_2_6 - СтруктураЗначение.Раздел2_3_2_7 - СтруктураЗначение.Раздел2_3_2_8;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_3_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					//	// строках 3.2.2
					//	ОписаниеУсловия = "";
					//	ОписаниеОшибки = "";  		
					//	
					//	Если СтруктураЗначение.Раздел2_3_2_2 < СтруктураЗначение.Раздел2_3_2_2_1 Тогда
					//		ОписаниеУсловия= "Значение, указанное в строке 3.2.2 Раздела II, должно быть больше или равно значению, указанному в строке 3.2.2.1.";
					//		ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_2_2) +" < " + Строка(СтруктураЗначение.Раздел2_3_2_2_1);
					//		ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
					//		ИтогоОшибокКС = ИтогоОшибокКС + 1;
					//		
					//		ОбластьСтрокаКС.Область(1, 38 + КолДопКолонок, 1, 38 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					//	Иначе
					//		ОбластьСтрокаКС.Область(1, 38 + КолДопКолонок, 1, 38 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					//	КонецЕсли;
					//	
					//	ОбластьСтрокаКС.Параметры.Раздел2_3_2_2 = СтруктураЗначение.Раздел2_3_2_2 - СтруктураЗначение.Раздел2_3_2_2_1;		
					//	ОбластьСтрокаКС.Параметры.Проверка_Раздел2_3_2_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					//	
					// 05.03.04.31 строках 3.2.3
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел2_3_2_3 < СтруктураЗначение.Раздел2_3_2_3_1 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 3.2.3, должно быть больше или равно значению, указанному в строке 3.2.3.1.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_2_3) +" < " + Строка(СтруктураЗначение.Раздел2_3_2_3_1);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.31");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 39 + КолДопКолонок, 1, 39 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 39 + КолДопКолонок, 1, 39 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_3_2_3 = СтруктураЗначение.Раздел2_3_2_3 - СтруктураЗначение.Раздел2_3_2_3_1;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_3_2_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.32 строках 3.3
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел2_3_3 <> СтруктураЗначение.Раздел2_3_3_1 + СтруктураЗначение.Раздел2_3_3_2 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 3.3, должно быть равно сумме значений, указанных в строках 3.3.1 и 3.3.2.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_3) +" <> " + Строка(СтруктураЗначение.Раздел2_3_3_1 + СтруктураЗначение.Раздел2_3_3_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.32");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 40 + КолДопКолонок, 1, 40 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 40 + КолДопКолонок, 1, 40 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел2_3_3 = СтруктураЗначение.Раздел2_3_3 - СтруктураЗначение.Раздел2_3_3_1 - СтруктураЗначение.Раздел2_3_3_2;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел2_3_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.33 строках 1.1.1 и 1.8.1.1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если (СтруктураЗначение.Раздел2_1_8_1_1 <> 0 И СтруктураЗначение.Раздел2_1_1_1 = 0) Тогда
						ОписаниеУсловия= "Если в строке 1.8.1.1 раздела II указано значение, отличное от нуля, то и в строке 1.1.1 раздела II должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "1.8.1.1 = " + Строка(СтруктураЗначение.Раздел2_1_8_1_1) +"; 1.1.1 = " + Строка(СтруктураЗначение.Раздел2_1_1_1);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.33");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 41 + КолДопКолонок, 1, 42 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 41 + КолДопКолонок, 1, 42 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Сумма_1_1_1 = СтруктураЗначение.Раздел2_1_1_1;
					ОбластьСтрокаКС.Параметры.Раздел2_1_8_1_1 = СтруктураЗначение.Раздел2_1_8_1_1;                  		
					ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;	
					
					
					// 05.03.04.300 строках 1.1.1 и 1.8.1.1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если (СтруктураЗначение.Раздел2_1_8_2_1 <> 0 И СтруктураЗначение.Раздел2_1_2_1 = 0) Тогда
						ОписаниеУсловия= "Если в строке 1.8.1.1 раздела II указано значение, отличное от нуля, то и в строке 1.2.1 раздела II должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "1.8.2.1 = " + Строка(СтруктураЗначение.Раздел2_1_8_2_1) +"; 1.2.1 = " + Строка(СтруктураЗначение.Раздел2_1_2_1);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.300");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 43 + КолДопКолонок, 1, 44 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 43 + КолДопКолонок, 1, 44 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Сумма_1_2_1 = СтруктураЗначение.Раздел2_1_2_1;
					ОбластьСтрокаКС.Параметры.Раздел2_1_8_2_1 = СтруктураЗначение.Раздел2_1_8_2_1;                  		
					ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;	
					
					
					// 05.03.04.34 строках 1.1.2 и 1.8.1.2
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если (СтруктураЗначение.Раздел2_1_8_1_2 <> 0 И СтруктураЗначение.Раздел2_1_1_2 = 0) Тогда
						ОписаниеУсловия= "Если в строке 1.8.1.2 раздела II указано значение, отличное от нуля, то и в строке 1.1.2 раздела II должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "1.8.1.2 = " + Строка(СтруктураЗначение.Раздел2_1_8_1_2) +"; 1.1.2 = " + Строка(СтруктураЗначение.Раздел2_1_1_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.34");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 45 + КолДопКолонок, 1, 46 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 45 + КолДопКолонок, 1, 46 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Сумма_1_1_2 = СтруктураЗначение.Раздел2_1_1_2;
					ОбластьСтрокаКС.Параметры.Раздел2_1_8_1_2 = СтруктураЗначение.Раздел2_1_8_1_2;                  		
					ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;	
					
					// 05.03.04.301 строках 1.2.2 и 1.8.2.2
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если (СтруктураЗначение.Раздел2_1_8_2_2 <> 0 И СтруктураЗначение.Раздел2_1_2_2 = 0) Тогда
						ОписаниеУсловия= "Если в строке 1.8.2.2 раздела II указано значение, отличное от нуля, то и в строке 1.2.2 раздела II должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "1.8.2.2 = " + Строка(СтруктураЗначение.Раздел2_1_8_2_2) +"; 1.2.2 = " + Строка(СтруктураЗначение.Раздел2_1_2_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.301");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 47 + КолДопКолонок, 1, 48 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 47 + КолДопКолонок, 1, 48 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Сумма_1_2_2 = СтруктураЗначение.Раздел2_1_2_2;
					ОбластьСтрокаКС.Параметры.Раздел2_1_8_2_2 = СтруктураЗначение.Раздел2_1_8_2_2;                  		
					ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_2_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;	
					
					
					// 05.03.04.302 строках 1.2.2 и 1.8.2.2
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если (СтруктураЗначение.Раздел2_1_8_2_2 <> 0 И СтруктураЗначение.Раздел2_1_2_2 = 0) Тогда
						ОписаниеУсловия= "Если в строке 1.8.2.2 раздела II указано значение, отличное от нуля, то и в строке 1.2.2 раздела II должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "1.8.2.2 = " + Строка(СтруктураЗначение.Раздел2_1_8_2_2) +"; 1.2.2 = " + Строка(СтруктураЗначение.Раздел2_1_2_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.302");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 49 + КолДопКолонок, 1, 50 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 49 + КолДопКолонок, 1, 50 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Сумма_1_2_2 = СтруктураЗначение.Раздел2_1_2_2;
					ОбластьСтрокаКС.Параметры.Раздел2_1_8_2_2 = СтруктураЗначение.Раздел2_1_8_2_2;                  		
					ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_2_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;	
					
					
					// 05.03.04.303 строках 1.2.3 и 1.8.2.3
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если (СтруктураЗначение.Раздел2_1_8_2_3 <> 0 И СтруктураЗначение.Раздел2_1_2_3 = 0) Тогда
						ОписаниеУсловия= "Если в строке 1.8.2.3 раздела II указано значение, отличное от нуля, то и в строке 1.2.3 раздела II должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "1.8.2.3 = " + Строка(СтруктураЗначение.Раздел2_1_8_2_3) +"; 1.2.3 = " + Строка(СтруктураЗначение.Раздел2_1_2_3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.303");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 51 + КолДопКолонок, 1, 52 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 51 + КолДопКолонок, 1, 52 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Сумма_1_2_3 = СтруктураЗначение.Раздел2_1_2_3;
					ОбластьСтрокаКС.Параметры.Раздел2_1_8_2_3 = СтруктураЗначение.Раздел2_1_8_2_3;                  		
					ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_2_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;	
					
					// 05.03.04.35 строках 1.1.4 и 1.8.1.4
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если (СтруктураЗначение.Раздел2_1_8_1_4 <> 0 И СтруктураЗначение.Раздел2_1_1_4 = 0) Тогда
						ОписаниеУсловия= "Если в строке 1.8.2.3 раздела II указано значение, отличное от нуля, то и в строке 1.2.3 раздела II должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "1.8.1.4 = " + Строка(СтруктураЗначение.Раздел2_1_8_1_4) +"; 1.1.4 = " + Строка(СтруктураЗначение.Раздел2_1_1_4);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.35");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 53 + КолДопКолонок, 1, 54 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 53 + КолДопКолонок, 1, 54 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Сумма_1_1_4 = СтруктураЗначение.Раздел2_1_1_4;
					ОбластьСтрокаКС.Параметры.Раздел2_1_8_1_4 = СтруктураЗначение.Раздел2_1_8_1_4;                  		
					ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_4 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;	
					
					// 05.03.04.304 строках 1.1.4 и 1.8.1.4
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если (СтруктураЗначение.Раздел2_1_8_2_4 <> 0 И СтруктураЗначение.Раздел2_1_2_4 = 0) Тогда
						ОписаниеУсловия= "Если в строке 1.8.2.4 раздела II указано значение, отличное от нуля, то и в строках 1.2.4 раздела II должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "1.8.2.4 = " + Строка(СтруктураЗначение.Раздел2_1_8_2_4) +"; 1.2.4 = " + Строка(СтруктураЗначение.Раздел2_1_2_4);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.304");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 55 + КолДопКолонок, 1, 56 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 55 + КолДопКолонок, 1, 56 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Сумма_1_2_4 = СтруктураЗначение.Раздел2_1_2_4;
					ОбластьСтрокаКС.Параметры.Раздел2_1_8_2_4 = СтруктураЗначение.Раздел2_1_8_2_4;                  		
					ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_2_4 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;	
					
					
					// 05.03.04.36 строках 1, 2 И 3
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел2_1 <> СтруктураЗначение.Раздел2_2 + СтруктураЗначение.Раздел2_3 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 1, должно быть равно сумме значений, указанных в строках 2 и 3.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_1) +" <> " + Строка(СтруктураЗначение.Раздел2_2 + СтруктураЗначение.Раздел2_3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.36");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 57 + КолДопКолонок, 1, 57 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 57 + КолДопКолонок, 1, 57 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел1_Проверка2_3 = СтруктураЗначение.Раздел2_1 - СтруктураЗначение.Раздел2_2 - СтруктураЗначение.Раздел2_3;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел1_Проверка2_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.37 строка 4 
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел3_4 <> СтруктураЗначение.Раздел3_4_1 + СтруктураЗначение.Раздел3_4_2 + СтруктураЗначение.Раздел3_4_3 + СтруктураЗначение.Раздел3_4_4 + СтруктураЗначение.Раздел3_4_5 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 4 Раздела III, должно быть равно сумме значений, указанных в строках 4.1, 4.2, 4.3, 4.4 и 4.5.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_4) +" <> " + Строка(СтруктураЗначение.Раздел3_4_1 + СтруктураЗначение.Раздел3_4_2 + СтруктураЗначение.Раздел3_4_3 + СтруктураЗначение.Раздел3_4_4 + СтруктураЗначение.Раздел3_4_5);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.37");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 49 + КолДопКолонок, 1, 49 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 49 + КолДопКолонок, 1, 49 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел3_4 = СтруктураЗначение.Раздел3_4 - СтруктураЗначение.Раздел3_4_1 - СтруктураЗначение.Раздел3_4_2 - СтруктураЗначение.Раздел3_4_3 - СтруктураЗначение.Раздел3_4_4 - СтруктураЗначение.Раздел3_4_5;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел3_4 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.38 строка 4.1 
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел3_4_1 < СтруктураЗначение.Раздел3_4_1_1 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 4 Раздела III, должно быть равно сумме значений, указанных в строках 4.1, 4.2, 4.3, 4.4 и 4.5.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_4_1) +" < " + Строка(СтруктураЗначение.Раздел3_4_1_1);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.38");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 50 + КолДопКолонок, 1, 50 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 50 + КолДопКолонок, 1, 50 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел3_4_1 = СтруктураЗначение.Раздел3_4_1 - СтруктураЗначение.Раздел3_4_1_1;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел3_4_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.39 строка 5 
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел3_5 <> СтруктураЗначение.Раздел3_5_1 + СтруктураЗначение.Раздел3_5_2 + СтруктураЗначение.Раздел3_5_3 + СтруктураЗначение.Раздел3_5_4 + СтруктураЗначение.Раздел3_5_5  + СтруктураЗначение.Раздел3_5_6 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 5 Раздела III, должно быть равно сумме значений, указанных в строках 5.1, 5.2, 5.3, 5.4, 5.5 и 5.6.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_5) +" <> " + Строка(СтруктураЗначение.Раздел3_5_1 + СтруктураЗначение.Раздел3_5_2 + СтруктураЗначение.Раздел3_5_3 + СтруктураЗначение.Раздел3_5_4 + СтруктураЗначение.Раздел3_5_5  + СтруктураЗначение.Раздел3_5_6);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.39");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 51 + КолДопКолонок, 1, 51 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 51 + КолДопКолонок, 1, 51 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел3_5 = СтруктураЗначение.Раздел3_5 - СтруктураЗначение.Раздел3_5_1 - СтруктураЗначение.Раздел3_5_2 - СтруктураЗначение.Раздел3_5_3 - СтруктураЗначение.Раздел3_5_4 - СтруктураЗначение.Раздел3_5_5  - СтруктураЗначение.Раздел3_5_6;		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел3_5 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.40 строка 5.3 
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел3_5_3 < СтруктураЗначение.Раздел3_5_3_1 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 5.3 Раздела III, должно быть больше или равно значению, указанному в строке 5.3.1.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_5_3) +" < " + Строка(СтруктураЗначение.Раздел3_5_3_1);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.40");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 52 + КолДопКолонок, 1, 52 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 52 + КолДопКолонок, 1, 52 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел3_5_3 = СтруктураЗначение.Раздел3_5 - СтруктураЗначение.Раздел3_5_3 - СтруктураЗначение.Раздел3_5_3_1;	
					ОбластьСтрокаКС.Параметры.Проверка_Раздел3_5_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.41 строка 9.1 
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел3_9_1 < СтруктураЗначение.Раздел3_9_1_1 + СтруктураЗначение.Раздел3_9_1_2 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 9.1 Раздела III, должно быть больше или равно сумме значений, указанных в строках 9.1.1 и 9.1.2.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_9_1) +" < " + Строка(СтруктураЗначение.Раздел3_9_1_1 + СтруктураЗначение.Раздел3_9_1_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.41");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 53 + КолДопКолонок, 1, 53 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 53 + КолДопКолонок, 1, 53 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел3_9_1 = СтруктураЗначение.Раздел3_9_1 - СтруктураЗначение.Раздел3_9_1_1 - СтруктураЗначение.Раздел3_9_1_2;	
					ОбластьСтрокаКС.Параметры.Проверка_Раздел3_9_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.42 строка 10 
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел3_10 < СтруктураЗначение.Раздел3_10_1 + СтруктураЗначение.Раздел3_10_2 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 9.1 Раздела III, должно быть больше или равно сумме значений, указанных в строках 9.1.1 и 9.1.2.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_10) +" < " + Строка(СтруктураЗначение.Раздел3_10_1 + СтруктураЗначение.Раздел3_10_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.42");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 54 + КолДопКолонок, 1, 54 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 54 + КолДопКолонок, 1, 54 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел3_10 = СтруктураЗначение.Раздел3_10 - СтруктураЗначение.Раздел3_10_1 - СтруктураЗначение.Раздел3_10_2;	
					ОбластьСтрокаКС.Параметры.Проверка_Раздел3_10 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.43 строка 11
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_11 <> СтруктураЗначение.Раздел4_11_1 + СтруктураЗначение.Раздел4_11_2 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 11, должно быть равно сумме значений, указанных в строках 11.1 и 11.2.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_11) +" <> " + Строка(СтруктураЗначение.Раздел4_11_1 + СтруктураЗначение.Раздел4_11_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.43");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 56 + КолДопКолонок, 1, 56 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 56 + КолДопКолонок, 1, 56 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_11 = СтруктураЗначение.Раздел4_11 - СтруктураЗначение.Раздел4_11_1 - СтруктураЗначение.Раздел4_11_2;	
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_11 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.44 строка 12
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_12 <> СтруктураЗначение.Раздел4_12_1 + СтруктураЗначение.Раздел4_12_2 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 12, должно быть равно сумме значений, указанных в строках 12.1 и 12.2.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_12) +" <> " + Строка(СтруктураЗначение.Раздел4_12_1 + СтруктураЗначение.Раздел4_12_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.44");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 57 + КолДопКолонок, 1, 57 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 57 + КолДопКолонок, 1, 57 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_12 = СтруктураЗначение.Раздел4_12 - СтруктураЗначение.Раздел4_12_1 - СтруктураЗначение.Раздел4_12_2;	
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_12 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.45 строка 13
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_13 <> СтруктураЗначение.Раздел4_13_1 + СтруктураЗначение.Раздел4_13_2 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 13, должно быть равно сумме значений, указанных в строках 13.1 и 13.2.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_13) +" <> " + Строка(СтруктураЗначение.Раздел4_13_1 + СтруктураЗначение.Раздел4_13_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.45");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 58 + КолДопКолонок, 1, 58 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 58 + КолДопКолонок, 1, 58 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_13 = СтруктураЗначение.Раздел4_13 - СтруктураЗначение.Раздел4_13_1 - СтруктураЗначение.Раздел4_13_2;	
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_13 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.46 строка 14
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_14 <> СтруктураЗначение.Раздел4_14_1 + СтруктураЗначение.Раздел4_14_2 + СтруктураЗначение.Раздел4_14_3  Тогда
						ОписаниеУсловия= "Значение, указанное в строке 14, должно быть равно сумме значений, указанных в строках 14.1, 14.2 и 14.3.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_14) +" <> " + Строка(СтруктураЗначение.Раздел4_14_1 + СтруктураЗначение.Раздел4_14_2 + СтруктураЗначение.Раздел4_14_3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.46");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 59 + КолДопКолонок, 1, 59 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 59 + КолДопКолонок, 1, 59 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_14 = СтруктураЗначение.Раздел4_14 - СтруктураЗначение.Раздел4_14_1 - СтруктураЗначение.Раздел4_14_2 - СтруктураЗначение.Раздел4_14_3;	
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_14 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.47 строка 14.3
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_14_3 < СтруктураЗначение.Раздел4_14_3_1 + СтруктураЗначение.Раздел4_14_3_2 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 14.3, должно быть больше или равно сумме значений, указанных в строках 14.3.1 и 14.3.2.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_14_3) +" <> " + Строка(СтруктураЗначение.Раздел4_14_3_1 + СтруктураЗначение.Раздел4_14_3_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.47");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 60 + КолДопКолонок, 1, 60 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 60 + КолДопКолонок, 1, 60 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_14_3 = СтруктураЗначение.Раздел4_14_3 - СтруктураЗначение.Раздел4_14_3_1 - СтруктураЗначение.Раздел4_14_3_2;	
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_14_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.48 строка 15 и 1.1. и 1.2
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_15 <> 0 И (СтруктураЗначение.Раздел2_1_1 + СтруктураЗначение.Раздел2_1_2) = 0 Тогда
						ОписаниеУсловия= "Если в строке 15 указано значение, отличное от нуля, то и в строках 1.1. или 1.2 раздела II должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Строка 15 = " + Строка(СтруктураЗначение.Раздел4_15) +"; 1.1 = " + Строка(СтруктураЗначение.Раздел2_1_1)+"; 1.2 = " + Строка(СтруктураЗначение.Раздел2_1_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.48");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 61 + КолДопКолонок, 1, 62 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 61 + КолДопКолонок, 1, 62 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_15 = СтруктураЗначение.Раздел4_15;
					ОбластьСтрокаКС.Параметры.Сумма_1_1_и_1_2 = СтруктураЗначение.Раздел2_1_1 + СтруктураЗначение.Раздел2_1_2;	
					ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_и_1_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.49 Если в строке 15.1 раздела IV указано значение, отличное от нуля, то и в строках 1.1.1 или 1.1.3 или 1.2.1 или 1.2.3 раздела II должно быть указано значение, отличное от нуля.
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					СуммаСтрок = СтруктураЗначение.Раздел2_1_1_1 + СтруктураЗначение.Раздел2_1_1_3 + СтруктураЗначение.Раздел2_1_2_1 + СтруктураЗначение.Раздел2_1_2_3;
					Если СтруктураЗначение.Раздел4_15_1 <> 0 И СуммаСтрок = 0 Тогда
						ОписаниеУсловия= "Если в строке 15.1 раздела IV указано значение, отличное от нуля, то и в строках 1.1.1 или 1.1.3 или 1.2.1 или 1.2.3 раздела II должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Строка 15.1 = " + Строка(СтруктураЗначение.Раздел4_15_1) +"; 1.1.1 = " + Строка(СтруктураЗначение.Раздел2_1_1_1) +"; 1.1.3 = " + Строка(СтруктураЗначение.Раздел2_1_1_3)+"; 1.2.1 = " + Строка(СтруктураЗначение.Раздел2_1_2_1)+"; 1.2.3 = " + Строка(СтруктураЗначение.Раздел2_1_2_3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.49");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 73 + КолДопКолонок, 1, 74 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 73 + КолДопКолонок, 1, 74 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_15_1 = СтруктураЗначение.Раздел4_15_1;
					ОбластьСтрокаКС.Параметры.Сумма_1_1_1_и_1_2_1 = СуммаСтрок;	
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_15_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.50 Если в строке 15.2 указано значение, отличное от нуля, то и в строках 1.1.2 или 1.2.2 раздела II должно быть указано значение, отличное от нуля.
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_15_2 <> 0 И (СтруктураЗначение.Раздел2_1_1_2 + СтруктураЗначение.Раздел2_1_2_2) = 0 Тогда
						ОписаниеУсловия= "Если в строке 15.2 указано значение, отличное от нуля, то и в строках 1.1.2 или 1.2.2 раздела II должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Строка 15.2 = " + Строка(СтруктураЗначение.Раздел4_15_2) +"; 1.1.2 = " + Строка(СтруктураЗначение.Раздел2_1_1_2)+"; 1.2.2 = " + Строка(СтруктураЗначение.Раздел2_1_2_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.50");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 75 + КолДопКолонок, 1, 76 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 75 + КолДопКолонок, 1, 76 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_15_2 = СтруктураЗначение.Раздел4_15_2;
					ОбластьСтрокаКС.Параметры.Сумма_1_1_2_и_1_2_2 = СтруктураЗначение.Раздел2_1_1_2 + СтруктураЗначение.Раздел2_1_2_2;	
					ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_2_и_1_2_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.51 строка 15.3 и 1.1.4 и 1.2.4
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_15_3 <> 0 И (СтруктураЗначение.Раздел2_1_1_4 + СтруктураЗначение.Раздел2_1_2_4) = 0 Тогда
						ОписаниеУсловия= "Если в строке 15.3 указано значение, отличное от нуля, то и в строках 1.1.4 или 1.2.4 раздела II должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Строка 15.3 = " + Строка(СтруктураЗначение.Раздел4_15_3) +"; 1.1.4 = " + Строка(СтруктураЗначение.Раздел2_1_1_4)+"; 1.2.4 = " + Строка(СтруктураЗначение.Раздел2_1_2_4);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.51");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 77 + КолДопКолонок, 1, 78 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 77 + КолДопКолонок, 1, 78 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_15_3 = СтруктураЗначение.Раздел4_15_3;
					ОбластьСтрокаКС.Параметры.Сумма_1_1_4_и_1_2_4 = СтруктураЗначение.Раздел2_1_1_4 + СтруктураЗначение.Раздел2_1_2_4;	
					ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_3_и_1_2_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.52 строка 15 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_15 <> СтруктураЗначение.Раздел4_15_1 + СтруктураЗначение.Раздел4_15_2 + СтруктураЗначение.Раздел4_15_3 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 15, должно быть равно сумме значений, указанных в строках 15.1, 15.2 и 15.3.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_15) +" <> " + Строка(СтруктураЗначение.Раздел4_15_1 + СтруктураЗначение.Раздел4_15_2 + СтруктураЗначение.Раздел4_15_3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.52");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 79 + КолДопКолонок, 1, 79 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 79 + КолДопКолонок, 1, 79 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_15_Сумма = СтруктураЗначение.Раздел4_15 - СтруктураЗначение.Раздел4_15_1 - СтруктураЗначение.Раздел4_15_2 - СтруктураЗначение.Раздел4_15_3;	
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_15_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.53 строка 17 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_17 <> СтруктураЗначение.Раздел4_17_1 + СтруктураЗначение.Раздел4_17_2 + СтруктураЗначение.Раздел4_17_3 + СтруктураЗначение.Раздел4_17_4 + СтруктураЗначение.Раздел4_17_5 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 17, должно быть равно сумме значений, указанных в строках 17.1, 17.2, 17.3, 17.4 и 17.5.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_17) +" <> " + Строка(СтруктураЗначение.Раздел4_17_1 + СтруктураЗначение.Раздел4_17_2 + СтруктураЗначение.Раздел4_17_3 + СтруктураЗначение.Раздел4_17_4 + СтруктураЗначение.Раздел4_17_5);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.53");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 80 + КолДопКолонок, 1, 80 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 80 + КолДопКолонок, 1, 80 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_17_Сумма = СтруктураЗначение.Раздел4_17 - СтруктураЗначение.Раздел4_17_1 - СтруктураЗначение.Раздел4_17_2 - СтруктураЗначение.Раздел4_17_3 - СтруктураЗначение.Раздел4_17_4 - СтруктураЗначение.Раздел4_17_5;	
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_17_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.54 строка 18 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_18 <> СтруктураЗначение.Раздел4_18_1 + СтруктураЗначение.Раздел4_18_2 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 18, должно быть равно сумме значений, указанных в строках 18.1 и 18.2.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_18) +" <> " + Строка(СтруктураЗначение.Раздел4_18_1 + СтруктураЗначение.Раздел4_18_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.54");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 81 + КолДопКолонок, 1, 81 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 81 + КолДопКолонок, 1, 81 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_18_Сумма = СтруктураЗначение.Раздел4_18 - СтруктураЗначение.Раздел4_18_1 - СтруктураЗначение.Раздел4_18_2;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_18_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.55 строка 18.1 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_18_1 <> СтруктураЗначение.Раздел4_18_1_1 + СтруктураЗначение.Раздел4_18_1_2 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 18.1, должно быть равно сумме значений, указанных в строках 18.1.1 и 18.1.2.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_18_1) +" <> " + Строка(СтруктураЗначение.Раздел4_18_1_1 + СтруктураЗначение.Раздел4_18_1_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.55");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 82 + КолДопКолонок, 1, 82 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 82 + КолДопКолонок, 1, 82 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_18_1_Сумма = СтруктураЗначение.Раздел4_18_1 - СтруктураЗначение.Раздел4_18_1_1 - СтруктураЗначение.Раздел4_18_1_2;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_18_1_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.56 строка 18.2 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_18_2 <> СтруктураЗначение.Раздел4_18_2_1 + СтруктураЗначение.Раздел4_18_2_2 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 18.2, должно быть равно сумме значений, указанных в строках 18.2.1 и 18.2.2.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_18_2) +" <> " + Строка(СтруктураЗначение.Раздел4_18_2_1 + СтруктураЗначение.Раздел4_18_2_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.56");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 83 + КолДопКолонок, 1, 83 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 83 + КолДопКолонок, 1, 83 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_18_2_Сумма = СтруктураЗначение.Раздел4_18_2 - СтруктураЗначение.Раздел4_18_2_1 - СтруктураЗначение.Раздел4_18_2_2;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_18_2_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.57 строка 19 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_19 <> СтруктураЗначение.Раздел4_19_1 + СтруктураЗначение.Раздел4_19_2 + СтруктураЗначение.Раздел4_19_3 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 19, должно быть равно сумме значений, указанных в строках 19.1, 19.2 и 19.3.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19) +" <> " + Строка(СтруктураЗначение.Раздел4_19_1 + СтруктураЗначение.Раздел4_19_2 + СтруктураЗначение.Раздел4_19_3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.57");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 84 + КолДопКолонок, 1, 84 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 84 + КолДопКолонок, 1, 84 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_19_Сумма = СтруктураЗначение.Раздел4_19 - СтруктураЗначение.Раздел4_19_1 - СтруктураЗначение.Раздел4_19_2 - СтруктураЗначение.Раздел4_19_3;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.58 строка 19.3 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_19_3 <> СтруктураЗначение.Раздел4_19_3_1 + СтруктураЗначение.Раздел4_19_3_2 + СтруктураЗначение.Раздел4_19_3_3 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 19, должно быть равно сумме значений, указанных в строках 19.1, 19.2 и 19.3.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_3) +" <> " + Строка(СтруктураЗначение.Раздел4_19_3_1 + СтруктураЗначение.Раздел4_19_3_2 + СтруктураЗначение.Раздел4_19_3_3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.58");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 85 + КолДопКолонок, 1, 85 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 85 + КолДопКолонок, 1, 85 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_19_3_Сумма = СтруктураЗначение.Раздел4_19_3 - СтруктураЗначение.Раздел4_19_3_1 - СтруктураЗначение.Раздел4_19_3_2 - СтруктураЗначение.Раздел4_19_3_3;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_3_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.59 строка 19.1 И 19.1.1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_19_1 <> 0 И СтруктураЗначение.Раздел4_19_1_1 = 0 Тогда
						ОписаниеУсловия= "Если в строке 19.1 указано значение, отличное от нуля, то и в строке 19.1.1 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_1) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_19_1_1) +" = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.59");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 86 + КолДопКолонок, 1, 87 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 86 + КолДопКолонок, 1, 87 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_19_1 = СтруктураЗначение.Раздел4_19_1;
					ОбластьСтрокаКС.Параметры.Раздел4_19_1_1 = СтруктураЗначение.Раздел4_19_1_1;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_1_19_1_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.60 строка 19.1.1 И 19.1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_19_1_1 <> 0 И СтруктураЗначение.Раздел4_19_1 = 0 Тогда
						ОписаниеУсловия= "Если в строке 19.1.1 указано значение, отличное от нуля, то и в строке 19.1 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_1_1) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_19_1) +" = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.60");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 88 + КолДопКолонок, 1, 88 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 88 + КолДопКолонок, 1, 88 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_19_1_1_19_1 = СтруктураЗначение.Раздел4_19_1 - СтруктураЗначение.Раздел4_19_1_1;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_1_19_1_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.61 строка 19.2 И 19.2.1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_19_2 <> 0 И СтруктураЗначение.Раздел4_19_2_1 = 0 Тогда
						ОписаниеУсловия= "Если в строке 19.2 указано значение, отличное от нуля, то и в строке 19.2.1 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_2) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_19_2_1) +" = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.61");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 89 + КолДопКолонок, 1, 90 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 89 + КолДопКолонок, 1, 90 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_19_2 = СтруктураЗначение.Раздел4_19_2;
					ОбластьСтрокаКС.Параметры.Раздел4_19_2_1 = СтруктураЗначение.Раздел4_19_2_1;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_2_19_2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.62 строка 19.2.1 И 19.2
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_19_2_1 <> 0 И СтруктураЗначение.Раздел4_19_2 = 0 Тогда
						ОписаниеУсловия= "Если в строке 19.2.1 указано значение, отличное от нуля, то и в строке 19.2 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_2_1) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_19_2) +" = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.62");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 91 + КолДопКолонок, 1, 91 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 91 + КолДопКолонок, 1, 91 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_19_2_1_19_2 = СтруктураЗначение.Раздел4_19_2 - СтруктураЗначение.Раздел4_19_2_1;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_2_1_19_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.63 строка 19.3.1 И 19.3.1.1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_19_3_1 <> 0 И СтруктураЗначение.Раздел4_19_3_1_1 = 0 Тогда
						ОписаниеУсловия= "Если в строке 19.3.1 указано значение, отличное от нуля, то и в строке 19.3.1.1 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_3_1) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_19_3_1_1) +" = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.63");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 92 + КолДопКолонок, 1, 93 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 92 + КолДопКолонок, 1, 93 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_19_3_1 = СтруктураЗначение.Раздел4_19_3_1;
					ОбластьСтрокаКС.Параметры.Раздел4_19_3_1_1 = СтруктураЗначение.Раздел4_19_3_1_1;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_3_1_19_3_1_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.64 строка 19.3.1.1 И 19.3.1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_19_3_1_1 <> 0 И СтруктураЗначение.Раздел4_19_3_1 = 0 Тогда
						ОписаниеУсловия= "Если в строке 19.3.1.1 указано значение, отличное от нуля, то и в строке 19.3.1 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_3_1_1) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_19_3_1) +" = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.64");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 94 + КолДопКолонок, 1, 94 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 94 + КолДопКолонок, 1, 94 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_19_3_1_1_19_3_1 = СтруктураЗначение.Раздел4_19_3_1 - СтруктураЗначение.Раздел4_19_3_1_1;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_3_1_1_19_3_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.65 строка 19.3.2 И 19.3.2.1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_19_3_2 <> 0 И СтруктураЗначение.Раздел4_19_3_2_1 = 0 Тогда
						ОписаниеУсловия= "Если в строке 19.3.2 указано значение, отличное от нуля, то и в строке 19.3.2.1 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_3_2) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_19_3_2_1) +" = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.65");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 95 + КолДопКолонок, 1, 96 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 95 + КолДопКолонок, 1, 96 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_19_3_2 = СтруктураЗначение.Раздел4_19_3_2;
					ОбластьСтрокаКС.Параметры.Раздел4_19_3_2_1 = СтруктураЗначение.Раздел4_19_3_2_1;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_3_2_19_3_2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.66 строка 19.3.2.1 И 19.3.2
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_19_3_2_1 <> 0 И СтруктураЗначение.Раздел4_19_3_2 = 0 Тогда
						ОписаниеУсловия= "Если в строке 19.3.2.1 указано значение, отличное от нуля, то и в строке 19.3.2 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_3_2_1) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_19_3_2) +" = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.66");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 97 + КолДопКолонок, 1, 97 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 97 + КолДопКолонок, 1, 97 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_19_3_2_1_19_3_2 = СтруктураЗначение.Раздел4_19_3_2 - СтруктураЗначение.Раздел4_19_3_2_1;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_3_2_1_19_3_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.67 строка 19.3.3 И 19.3.3.1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_19_3_3 <> 0 И СтруктураЗначение.Раздел4_19_3_3_1 = 0 Тогда
						ОписаниеУсловия= "Если в строке 19.3.3 указано значение, отличное от нуля, то и в строке 19.3.3.1 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_3_3) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_19_3_3_1) +" = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.67");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 98 + КолДопКолонок, 1, 99 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 98 + КолДопКолонок, 1, 99 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_19_3_3 = СтруктураЗначение.Раздел4_19_3_3;
					ОбластьСтрокаКС.Параметры.Раздел4_19_3_3_1 = СтруктураЗначение.Раздел4_19_3_3_1;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_3_3_19_3_3_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.68 строка 19.3.3.1 И 19.3.3
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_19_3_3_1 <> 0 И СтруктураЗначение.Раздел4_19_3_3 = 0 Тогда
						ОписаниеУсловия= "Если в строке 19.3.3.1 указано значение, отличное от нуля, то и в строке 19.3.3 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_3_3_1) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_19_3_3) +" = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.68");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 100 + КолДопКолонок, 1, 100 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 100 + КолДопКолонок, 1, 100 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_19_3_3_1_19_3_3 = СтруктураЗначение.Раздел4_19_3_3 - СтруктураЗначение.Раздел4_19_3_3_1;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_3_3_1_19_3_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					
					// 05.03.04.69 проверка по строке 21 и разделу 10 по сумме
					НайденныеСтрокиРаздел10 = ТЗРаздел10.НайтиСтроки(Новый Структура("КодКПК_ДатаОтчетности", СокрЛП(Выборка.КПК.Код)+"_"+Строка(Выборка.ДатаОкончанияОтчетногоПериода)));
					
					СуммаСтрок1раздел10 = 0;
					ЕстьНольВСтроках1Раздела10 = Истина;
					
					СуммаСтрок2раздел10 = 0;
					ЕстьНольВСтроках2Раздела10 = Истина;    
					
					
					Если НайденныеСтрокиРаздел10.Количество() > 0 Тогда
						Для Каждого НайденнаяСтрока Из НайденныеСтрокиРаздел10 Цикл
							Если Лев(НайденнаяСтрока.КодРаздела, 1) = "1" Тогда
								СуммаСтрок1раздел10 = СуммаСтрок1раздел10 + НайденнаяСтрока.РазмерОбязательствНаКонецОтчетногоПериода;		
								
								Если НайденнаяСтрока.РазмерОбязательствНаКонецОтчетногоПериода <> 0 Тогда
									ЕстьНольВСтроках1Раздела10 = Ложь;
								КонецЕсли;
							ИначеЕсли Лев(НайденнаяСтрока.КодРаздела, 1) = "2" Тогда
								СуммаСтрок2раздел10 = СуммаСтрок2раздел10 + НайденнаяСтрока.РазмерОбязательствНаКонецОтчетногоПериода;		
								
								Если НайденнаяСтрока.РазмерОбязательствНаКонецОтчетногоПериода <> 0 Тогда
									ЕстьНольВСтроках2Раздела10 = Ложь;
								КонецЕсли;
								
							КонецЕсли;
						КонецЦикла;   			
					КонецЕсли;
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_21 <> СуммаСтрок1раздел10 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 21 должно быть равно сумме значений, указанных в графе 5 по строке 1 (1.1 – …) Раздела X.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_21) +" <> " + Строка(СуммаСтрок1раздел10);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.69");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 101 + КолДопКолонок, 1, 101 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 101 + КолДопКолонок, 1, 101 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_21_Раздел10 = СтруктураЗначение.Раздел4_21 - СуммаСтрок1раздел10;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_21_Раздел10 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					//	// проверка по строке 21 и разделу 10 по нулям
					//	
					//	ОписаниеУсловия = "";
					//	ОписаниеОшибки = "";  		
					//	
					//	Если СтруктураЗначение.Раздел4_21 <> 0 И ЕстьНольВСтроках1Раздела10 = Истина Тогда
					//		ОписаниеУсловия= "Если в строке 21 указано значение, отличное от нуля, то и в графе 5 строк 1.1 – … Раздела Х должны быть указаны значения, отличные от нуля.";
					//		ОписаниеОшибки = "Строка 21 = " + Строка(СтруктураЗначение.Раздел4_21) + ": " + Строка("Все строки 1 (1.1 – …) равны 0");
					//		ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
					//		ИтогоОшибокКС = ИтогоОшибокКС + 1;
					//		
					//		ОбластьСтрокаКС.Область(1, 92 + КолДопКолонок, 1, 92 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					//	Иначе
					//		ОбластьСтрокаКС.Область(1, 92 + КолДопКолонок, 1, 92 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					//	КонецЕсли;
					//	
					//	ОбластьСтрокаКС.Параметры.Проверка_Раздел4_21_Раздел10_ПроверкаНаНоль = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;		
					//	
					//	
					// 05.03.04.71 строка 22 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_22 <> СтруктураЗначение.Раздел4_22_1 + СтруктураЗначение.Раздел4_22_2 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 22, должно быть равно сумме значений, указанных в строках 22.1 и 22.2.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_22) +" <> " + Строка(СтруктураЗначение.Раздел4_22_1 + СтруктураЗначение.Раздел4_22_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.71");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 103 + КолДопКолонок, 1, 103 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 103 + КолДопКолонок, 1, 103 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_22_Сумма = СтруктураЗначение.Раздел4_22 - СтруктураЗначение.Раздел4_22_1 - СтруктураЗначение.Раздел4_22_2;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_22_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.72 строка 23 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_23 <> СтруктураЗначение.Раздел4_23_1 + СтруктураЗначение.Раздел4_23_2 + СтруктураЗначение.Раздел4_23_3 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 23, должно быть равно сумме значений, указанных в строках 23.1, 23.2 и 23.3. ";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_23) +" <> " + Строка(СтруктураЗначение.Раздел4_23_1 + СтруктураЗначение.Раздел4_23_2 + СтруктураЗначение.Раздел4_23_3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.72");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 104 + КолДопКолонок, 1, 104 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 104 + КолДопКолонок, 1, 104 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_23_Сумма = СтруктураЗначение.Раздел4_23 - СтруктураЗначение.Раздел4_23_1 - СтруктураЗначение.Раздел4_23_2 - СтруктураЗначение.Раздел4_23_3;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_23_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.73 строка 23.3 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_23_3 <> СтруктураЗначение.Раздел4_23_3_1 + СтруктураЗначение.Раздел4_23_3_2 + СтруктураЗначение.Раздел4_23_3_3 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 23.3, должно быть равно сумме значений, указанных в строках 23.3.1, 23.3.2 и 23.3.3.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_23_3) +" <> " + Строка(СтруктураЗначение.Раздел4_23_3_1 + СтруктураЗначение.Раздел4_23_3_2 + СтруктураЗначение.Раздел4_23_3_3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.73");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 105 + КолДопКолонок, 1, 105 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 105 + КолДопКолонок, 1, 105 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_23_3_Сумма = СтруктураЗначение.Раздел4_23_3 - СтруктураЗначение.Раздел4_23_3_1 - СтруктураЗначение.Раздел4_23_3_2 - СтруктураЗначение.Раздел4_23_3_3;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_23_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.74 строка 23.1.1 И 23.1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		                   
					
					Если СтруктураЗначение.Раздел4_23_1_1 <> 0 И СтруктураЗначение.Раздел4_23_1 = 0 Тогда
						ОписаниеУсловия= "Если в строке 23.1.1 указано значение, отличное от нуля, то и в строке 23.1 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_23_1_1) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_23_1) +" = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.74");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 106 + КолДопКолонок, 1, 107 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 106 + КолДопКолонок, 1, 107 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_23_1_1 = СтруктураЗначение.Раздел4_23_2_1;
					ОбластьСтрокаКС.Параметры.Раздел4_23_1 = СтруктураЗначение.Раздел4_23_2;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_23_1_1_23_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.75 строка 23.2.1 И 23.2
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_23_2_1 <> 0 И СтруктураЗначение.Раздел4_23_2 = 0 Тогда
						ОписаниеУсловия= "Если в строке 23.2.1 указано значение, отличное от нуля, то и в строке 23.2 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_23_2_1) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_23_2) +" = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.75");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 108 + КолДопКолонок, 1, 109 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 108 + КолДопКолонок, 1, 109 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_23_2_1 = СтруктураЗначение.Раздел4_23_2_1;
					ОбластьСтрокаКС.Параметры.Раздел4_23_2 = СтруктураЗначение.Раздел4_23_2;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_23_2_1_23_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.76 строка 23.3.1.1 И 23.3.1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_23_3_1_1 <> 0 И СтруктураЗначение.Раздел4_23_3_1 = 0 Тогда
						ОписаниеУсловия= "Если в строке 23.3.1.1 указано значение, отличное от нуля, то и в строке 23.3.1 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_23_3_1_1) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_23_3_1) +" = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.76");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 110 + КолДопКолонок, 1, 111 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 110 + КолДопКолонок, 1, 111 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_23_3_1_1 = СтруктураЗначение.Раздел4_23_3_1_1;
					ОбластьСтрокаКС.Параметры.Раздел4_23_3_1 = СтруктураЗначение.Раздел4_23_3_1;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_23_2_1_23_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.77 строка 23.3.2.1 И 23.3.2
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_23_3_2_1 <> 0 И СтруктураЗначение.Раздел4_23_3_2 = 0 Тогда
						ОписаниеУсловия= "Если в строке 23.3.2.1 указано значение, отличное от нуля, то и в строке 23.3.2 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_23_3_2_1) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_23_3_2) +" = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.77");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 112 + КолДопКолонок, 1, 113 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 112 + КолДопКолонок, 1, 113 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_23_3_2_1 = СтруктураЗначение.Раздел4_23_3_2_1;
					ОбластьСтрокаКС.Параметры.Раздел4_23_3_2 = СтруктураЗначение.Раздел4_23_3_2;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_23_3_2_1_23_3_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.78 строка 23.3.3.1 И 23.3.3
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_23_3_3_1 <> 0 И СтруктураЗначение.Раздел4_23_3_3 = 0 Тогда
						ОписаниеУсловия= "Если в строке 23.3.3.1 указано значение, отличное от нуля, то и в строке 23.3.3 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_23_3_3_1) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_23_3_3) +" = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.78");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 114 + КолДопКолонок, 1, 115 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 114 + КолДопКолонок, 1, 115 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_23_3_3_1 = СтруктураЗначение.Раздел4_23_3_3_1;
					ОбластьСтрокаКС.Параметры.Раздел4_23_3_3 = СтруктураЗначение.Раздел4_23_3_3;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_23_3_3_1_23_3_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.79 строка 24 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_24 <> СтруктураЗначение.Раздел4_24_1 + СтруктураЗначение.Раздел4_24_2 + СтруктураЗначение.Раздел4_24_3 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 24, должно быть равно сумме значений, указанных в строках 24.1, 24.2 и 24.3.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_24) +" <> " + Строка(СтруктураЗначение.Раздел4_24_1 + СтруктураЗначение.Раздел4_24_2 + СтруктураЗначение.Раздел4_24_3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.79");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 106 + КолДопКолонок, 1, 106 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 106 + КолДопКолонок, 1, 106 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_24_Сумма = СтруктураЗначение.Раздел4_24 - СтруктураЗначение.Раздел4_24_1 - СтруктураЗначение.Раздел4_24_2 - СтруктураЗначение.Раздел4_24_3;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_24_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.80 строка 25 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_25 < СтруктураЗначение.Раздел4_25_1 + СтруктураЗначение.Раздел4_25_2 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 25, должно быть больше или равно сумме значений, указанных в строках 25.1 и 25.2.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_25) +" < " + Строка(СтруктураЗначение.Раздел4_25_1 + СтруктураЗначение.Раздел4_25_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.80");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 107 + КолДопКолонок, 1, 107 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 107 + КолДопКолонок, 1, 107 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_25_Сумма = СтруктураЗначение.Раздел4_25 - СтруктураЗначение.Раздел4_25_1 - СтруктураЗначение.Раздел4_25_2;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_25_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.81 строка 25.1 И 25.1.1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_25_1 <> 0 И СтруктураЗначение.Раздел4_25_1_1 = 0 Тогда
						ОписаниеУсловия= "Если в строке 25.1 указано значение, отличное от нуля, то и в строке 25.1.1 должно быть указано значение, отличное от нуля ";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_25_1) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_25_1_1) +" = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.81");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 108 + КолДопКолонок, 1, 109 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 108 + КолДопКолонок, 1, 109 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_25_1 = СтруктураЗначение.Раздел4_25_1;
					ОбластьСтрокаКС.Параметры.Раздел4_25_1_1 = СтруктураЗначение.Раздел4_25_1_1;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_25_1_25_1_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.82 строка 25.1.1 и 25.1 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_25_1_1 <> 0 И  СтруктураЗначение.Раздел4_25_1=0 Тогда
						ОписаниеУсловия= "Если в строке 25.1.1 указано значение, отличное от нуля, то и в строке 25.1 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_25_1_1) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_25_1) + " = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.82");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 120 + КолДопКолонок, 1, 120 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 120 + КолДопКолонок, 1, 120 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					// 05.03.04.83 строка 25.2 И 25.2.1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_25_2 <> 0 И СтруктураЗначение.Раздел4_25_2_1 = 0 Тогда
						ОписаниеУсловия= "Если в строке 25.2 указано значение, отличное от нуля, то и в строке 25.2.1 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_25_2) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_25_2_1) +" = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.83");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 121 + КолДопКолонок, 1, 122 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 121 + КолДопКолонок, 1, 122 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_25_2 = СтруктураЗначение.Раздел4_25_2;
					ОбластьСтрокаКС.Параметры.Раздел4_25_2_1 = СтруктураЗначение.Раздел4_25_2_1;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_25_2_25_2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.84 строка 25.2.1 и 25.2 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_25_1_1 <> 0 И  СтруктураЗначение.Раздел4_25_1=0 Тогда
						ОписаниеУсловия= "Если в строке 25.1.1 указано значение, отличное от нуля, то и в строке 25.1 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_25_1_1) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_25_1) + " = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.84");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 123 + КолДопКолонок, 1, 123 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 123 + КолДопКолонок, 1, 123 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					// 05.03.04.85 строка 25.1 и графа 4 раздел6 
					Графы4Раздел6 = 0;
					
					НайденныеСтроки = ТЗРаздел6Графа4.НайтиСтроки(Новый Структура("КодКПК_ДатаОтчетности", Выборка.КПК.Код+"_"+Строка(Выборка.ДатаОкончанияОтчетногоПериода)));
					
					
					Если НайденныеСтроки.Количество() > 0 Тогда
						Графы4Раздел6 =  НайденныеСтроки[0].Графа4;
					КонецЕсли;
					
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_25_1 < Графы4Раздел6 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 25.1, должно быть больше или равно сумме значений, указанных во всех строках графы 4 раздела VI.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_25_1) +" < " + Строка(Графы4Раздел6);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.85");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 124 + КолДопКолонок, 1, 124 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 124 + КолДопКолонок, 1, 124 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_25_1_Раздел6Графа4 = СтруктураЗначение.Раздел4_25_1 - Графы4Раздел6;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_25_1_Раздел6Графа4 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					
					// 05.03.04.86 Строка 27 и разделу 10 по нулям   
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_27 <> СуммаСтрок2раздел10 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 27 должно быть равно сумме значений, указанных в графе 5 по строке 2 (2.1 – …) Раздела Х..";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_27) +" <> " + Строка(СуммаСтрок2раздел10);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.86");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 115 + КолДопКолонок, 1, 115 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 115 + КолДопКолонок, 1, 115 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_27_Раздел10 = СтруктураЗначение.Раздел4_27 - СуммаСтрок2раздел10;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_27_Раздел10 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					//	// проверка по строке 27 и разделу 10 по нулям
					//	
					//	ОписаниеУсловия = "";
					//	ОписаниеОшибки = "";  		
					//	
					//	Если СтруктураЗначение.Раздел4_27 <> 0 И ЕстьНольВСтроках2Раздела10 = Истина Тогда
					//		ОписаниеУсловия= "Если в строке 27 указано значение, отличное от нуля, то и графе 5 строк 2.1 – … Раздела Х должно быть указано значение, отличное от нуля..";
					//		ОписаниеОшибки = "Строка 27 = " + Строка(СтруктураЗначение.Раздел4_21) + ": " + Строка("Все строки 2 (2.1 – …) равны 0");
					//		ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
					//		ИтогоОшибокКС = ИтогоОшибокКС + 1;
					//		
					//		ОбластьСтрокаКС.Область(1, 116 + КолДопКолонок, 1, 116 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					//	Иначе
					//		ОбластьСтрокаКС.Область(1, 116 + КолДопКолонок, 1, 116 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					//	КонецЕсли;
					//	
					//	ОбластьСтрокаКС.Параметры.Проверка_Раздел4_27_Раздел10_ПроверкаНаНоль = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;		
					//	
					//	
					//	
					// 05.03.04.88 строка 29 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_29 <> СтруктураЗначение.Раздел4_29_1 + СтруктураЗначение.Раздел4_29_2  + СтруктураЗначение.Раздел4_29_3 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 29, должно быть равно сумме значений, указанных в строках 29.1, 29.2 и 29.3.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_29) +" <> " + Строка(СтруктураЗначение.Раздел4_29_1 + СтруктураЗначение.Раздел4_29_2 + СтруктураЗначение.Раздел4_29_3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.88");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 127 + КолДопКолонок, 1, 127 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 127 + КолДопКолонок, 1, 127 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_29_Сумма = СтруктураЗначение.Раздел4_29 - СтруктураЗначение.Раздел4_29_1 - СтруктураЗначение.Раздел4_29_2 - СтруктураЗначение.Раздел4_29_3;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_29_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.89 строка 30 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_30 <> СтруктураЗначение.Раздел4_30_1 + СтруктураЗначение.Раздел4_30_2  + СтруктураЗначение.Раздел4_30_3 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 30, должно быть равно сумме значений, указанных в строках 30.1, 30.2 и 30.3.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_30) +" <> " + Строка(СтруктураЗначение.Раздел4_30_1 + СтруктураЗначение.Раздел4_30_2 + СтруктураЗначение.Раздел4_30_3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.89");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 128 + КолДопКолонок, 1, 128 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 128 + КолДопКолонок, 1, 128 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_30_Сумма = СтруктураЗначение.Раздел4_30 - СтруктураЗначение.Раздел4_30_1 - СтруктураЗначение.Раздел4_30_2 - СтруктураЗначение.Раздел4_30_3;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_30_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					
					// 05.03.04.90 строка 30 и 31 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_30 <> 0 И  СтруктураЗначение.Раздел4_31 = 0 Тогда
						ОписаниеУсловия= "Если в строке 30 указано значение, отличное от нуля, то и в строке 31 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_30) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_31) + " = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.90");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 129 + КолДопКолонок, 1, 130 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 129 + КолДопКолонок, 1, 130 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_30 = СтруктураЗначение.Раздел4_30 ;
					ОбластьСтрокаКС.Параметры.Раздел4_31 = СтруктураЗначение.Раздел4_31 ;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_30_31 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.91 строка 30.1 и 31.1 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_30_1 <> 0 И  СтруктураЗначение.Раздел4_31_1 = 0 Тогда
						ОписаниеУсловия= "Если в строке 30.1 указано значение, отличное от нуля, то и в строке 31.1 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_30_1) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_31_1) + " = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.91");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 131 + КолДопКолонок, 1, 132 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 131 + КолДопКолонок, 1, 132 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_30_1 = СтруктураЗначение.Раздел4_30_1 ;
					ОбластьСтрокаКС.Параметры.Раздел4_31_1 = СтруктураЗначение.Раздел4_31_1 ;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_30_1_31_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.92 строка 30.2 и 31.2 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_30_2 <> 0 И  СтруктураЗначение.Раздел4_31_2 = 0 Тогда
						ОписаниеУсловия= "Если в строке 30.2 указано значение, отличное от нуля, то и в строке 31.2 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_30_2) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_31_2) + " = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.92");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 133 + КолДопКолонок, 1, 134 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 133 + КолДопКолонок, 1, 134 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_30_2 = СтруктураЗначение.Раздел4_30_2 ;
					ОбластьСтрокаКС.Параметры.Раздел4_31_2 = СтруктураЗначение.Раздел4_31_2 ;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_30_2_31_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.93 строка 30.3 и 31.3 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_30_3 <> 0 И  СтруктураЗначение.Раздел4_31_3 = 0 Тогда
						ОписаниеУсловия= "Если в строке 30.3 указано значение, отличное от нуля, то и в строке 31.3 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_30_3) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_31_3) + " = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.93");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 135 + КолДопКолонок, 1, 136 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 135 + КолДопКолонок, 1, 136 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_30_3 = СтруктураЗначение.Раздел4_30_3 ;
					ОбластьСтрокаКС.Параметры.Раздел4_31_3 = СтруктураЗначение.Раздел4_31_3 ;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_30_3_31_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.94 строка 31 и 30 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_31 <> 0 И  СтруктураЗначение.Раздел4_30 = 0 Тогда
						ОписаниеУсловия= "Если в строке 31 указано значение, отличное от нуля, то и в строке 30 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_31) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_30) + " = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.94");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 137 + КолДопКолонок, 1, 138 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 137 + КолДопКолонок, 1, 138 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_31_30 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.95 строка 31.1 и 30.1 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_31_1 <> 0 И  СтруктураЗначение.Раздел4_30_1 = 0 Тогда
						ОписаниеУсловия= "Если в строке 31.1 указано значение, отличное от нуля, то и в строке 30.1 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_31_1) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_30_1) + " = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.95");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 139 + КолДопКолонок, 1, 140 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 139 + КолДопКолонок, 1, 140 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_31_1_30_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.96 строка 31.2 и 30.2 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_31_2 <> 0 И  СтруктураЗначение.Раздел4_30_2 = 0 Тогда
						ОписаниеУсловия= "Если в строке 31.2 указано значение, отличное от нуля, то и в строке 30.2 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_31_2) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_30_2) + " = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.96");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 141 + КолДопКолонок, 1, 142 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 141 + КолДопКолонок, 1, 142 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_31_2_30_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.97 строка 31.3 и 30.3 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_31_3 <> 0 И  СтруктураЗначение.Раздел4_30_3 = 0 Тогда
						ОписаниеУсловия= "Если в строке 31.3 указано значение, отличное от нуля, то и в строке 30.3 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_31_3) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_30_3) + " = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.97");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 143 + КолДопКолонок, 1, 144 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 143 + КолДопКолонок, 1, 144 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_31_3_30_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.98 строка 31 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_31 <> СтруктураЗначение.Раздел4_31_1 + СтруктураЗначение.Раздел4_31_2  + СтруктураЗначение.Раздел4_31_3 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 31, должно быть равно сумме значений, указанных в строках 31.1, 31.2 и 31.3.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_30) +" <> " + Строка(СтруктураЗначение.Раздел4_30_1 + СтруктураЗначение.Раздел4_30_2 + СтруктураЗначение.Раздел4_30_3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.98");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 145 + КолДопКолонок, 1, 145 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 145 + КолДопКолонок, 1, 145 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_31_Сумма = СтруктураЗначение.Раздел4_31 - СтруктураЗначение.Раздел4_31_1 - СтруктураЗначение.Раздел4_31_2 - СтруктураЗначение.Раздел4_31_3;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_31_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.99 строка 32 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_32 <> СтруктураЗначение.Раздел4_32_1 + СтруктураЗначение.Раздел4_32_2 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 32, должно быть равно сумме значений, указанных в строках 32.1 и 32.2.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_32) +" <> " + Строка(СтруктураЗначение.Раздел4_32_1 + СтруктураЗначение.Раздел4_32_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.99");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 146 + КолДопКолонок, 1, 146 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 146 + КолДопКолонок, 1, 146 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_32_Сумма = СтруктураЗначение.Раздел4_32 - СтруктураЗначение.Раздел4_32_1 - СтруктураЗначение.Раздел4_32_2 ;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_32_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.100 строка 32 и 33 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_32 <> 0 И  СтруктураЗначение.Раздел4_33 = 0 Тогда
						ОписаниеУсловия= "Если в строке 32 указано значение, отличное от нуля, то и в строке 33 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_32) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_33) + " = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.100");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 147 + КолДопКолонок, 1, 148 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 147 + КолДопКолонок, 1, 148 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_32 = СтруктураЗначение.Раздел4_32;
					ОбластьСтрокаКС.Параметры.Раздел4_33 = СтруктураЗначение.Раздел4_33 ;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_32_33 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;  
					
					// 05.03.04.101 строка 33 и 32 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_33 <> 0 И  СтруктураЗначение.Раздел4_32 = 0 Тогда
						ОписаниеУсловия= "Если в строке 33 указано значение, отличное от нуля, то и в строке 32 должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_33) +" <> 0 И " + Строка(СтруктураЗначение.Раздел4_32) + " = 0";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.101");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 149 + КолДопКолонок, 1, 150 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 149 + КолДопКолонок, 1, 150 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_33_32 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;    
					
					
					// 05.03.04.102 строка 35 сумма		
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_35 <> СтруктураЗначение.Раздел4_35_1 + СтруктураЗначение.Раздел4_35_2 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 35, должно быть равно сумме значений, указанных в строках 35.1 и 35.2";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_35) +" <> " + Строка(СтруктураЗначение.Раздел4_35_1 + СтруктураЗначение.Раздел4_35_2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.102");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 151 + КолДопКолонок, 1, 151 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 151 + КолДопКолонок, 1, 151 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_35_Сумма = СтруктураЗначение.Раздел4_35 - СтруктураЗначение.Раздел4_35_1 - СтруктураЗначение.Раздел4_35_2 ;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_35_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.103 строка 35.1 равна сумме граф 3-8 раздела 8 строка *.1
					
					СуммаГраф3_8 = 	СтруктураСтрок.Раздел8_1_1.Графа3 +СтруктураСтрок.Раздел8_2_1.Графа3 + СтруктураСтрок.Раздел8_3_1.Графа3 + СтруктураСтрок.Раздел8_4_1.Графа3 + СтруктураСтрок.Раздел8_5_1.Графа3 + СтруктураСтрок.Раздел8_6_1.Графа3 + СтруктураСтрок.Раздел8_7_1.Графа3  + СтруктураСтрок.Раздел8_8_1.Графа3 + СтруктураСтрок.Раздел8_9_1.Графа3;
					СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_1.Графа4 +СтруктураСтрок.Раздел8_2_1.Графа4 + СтруктураСтрок.Раздел8_3_1.Графа4 + СтруктураСтрок.Раздел8_4_1.Графа4 + СтруктураСтрок.Раздел8_5_1.Графа4 + СтруктураСтрок.Раздел8_6_1.Графа4 + СтруктураСтрок.Раздел8_7_1.Графа4  + СтруктураСтрок.Раздел8_8_1.Графа4 + СтруктураСтрок.Раздел8_9_1.Графа4;
					СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_1.Графа5 +СтруктураСтрок.Раздел8_2_1.Графа5 + СтруктураСтрок.Раздел8_3_1.Графа5 + СтруктураСтрок.Раздел8_4_1.Графа5 + СтруктураСтрок.Раздел8_5_1.Графа5 + СтруктураСтрок.Раздел8_6_1.Графа5 + СтруктураСтрок.Раздел8_7_1.Графа5  + СтруктураСтрок.Раздел8_8_1.Графа5 + СтруктураСтрок.Раздел8_9_1.Графа5;
					СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_1.Графа6 +СтруктураСтрок.Раздел8_2_1.Графа6 + СтруктураСтрок.Раздел8_3_1.Графа6 + СтруктураСтрок.Раздел8_4_1.Графа6 + СтруктураСтрок.Раздел8_5_1.Графа6 + СтруктураСтрок.Раздел8_6_1.Графа6 + СтруктураСтрок.Раздел8_7_1.Графа6  + СтруктураСтрок.Раздел8_8_1.Графа6 + СтруктураСтрок.Раздел8_9_1.Графа6;
					СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_1.Графа7 +СтруктураСтрок.Раздел8_2_1.Графа7 + СтруктураСтрок.Раздел8_3_1.Графа7 + СтруктураСтрок.Раздел8_4_1.Графа7 + СтруктураСтрок.Раздел8_5_1.Графа7 + СтруктураСтрок.Раздел8_6_1.Графа7 + СтруктураСтрок.Раздел8_7_1.Графа7  + СтруктураСтрок.Раздел8_8_1.Графа7 + СтруктураСтрок.Раздел8_9_1.Графа7;
					СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_1.Графа8 +СтруктураСтрок.Раздел8_2_1.Графа8 + СтруктураСтрок.Раздел8_3_1.Графа8 + СтруктураСтрок.Раздел8_4_1.Графа8 + СтруктураСтрок.Раздел8_5_1.Графа8 + СтруктураСтрок.Раздел8_6_1.Графа8 + СтруктураСтрок.Раздел8_7_1.Графа8  + СтруктураСтрок.Раздел8_8_1.Графа8 + СтруктураСтрок.Раздел8_9_1.Графа8;
					СуммаГраф3_8 = Окр(СуммаГраф3_8, 0);
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_35_1 <> СуммаГраф3_8 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 35.1, должно бы ть равно сумме значений, указанных в графах 3 – 8 строк 1.1, 2.1, 3.1, 4.1, 5.1, 6.1, 7.1, 8.1 и 9.1 Раздела VIII.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_35_1) +" <> " + Строка(СуммаГраф3_8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.103");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 152 + КолДопКолонок, 1, 152 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 152 + КолДопКолонок, 1, 152 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_35_1_Граф3_8 = СтруктураЗначение.Раздел4_35_1 - СуммаГраф3_8;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_35_1_Граф3_8 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.104 строка 35.2 равна сумме граф 3-8 раздела 8 строка *.2
					
					СуммаГраф3_8 = 	СтруктураСтрок.Раздел8_1_2.Графа3 +СтруктураСтрок.Раздел8_2_2.Графа3 + СтруктураСтрок.Раздел8_3_2.Графа3 + СтруктураСтрок.Раздел8_4_2.Графа3 + СтруктураСтрок.Раздел8_5_2.Графа3 + СтруктураСтрок.Раздел8_6_2.Графа3 + СтруктураСтрок.Раздел8_7_2.Графа3  + СтруктураСтрок.Раздел8_8_2.Графа3 + СтруктураСтрок.Раздел8_9_2.Графа3;
					СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_2.Графа4 +СтруктураСтрок.Раздел8_2_2.Графа4 + СтруктураСтрок.Раздел8_3_2.Графа4 + СтруктураСтрок.Раздел8_4_2.Графа4 + СтруктураСтрок.Раздел8_5_2.Графа4 + СтруктураСтрок.Раздел8_6_2.Графа4 + СтруктураСтрок.Раздел8_7_2.Графа4  + СтруктураСтрок.Раздел8_8_2.Графа4 + СтруктураСтрок.Раздел8_9_2.Графа4;
					СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_2.Графа5 +СтруктураСтрок.Раздел8_2_2.Графа5 + СтруктураСтрок.Раздел8_3_2.Графа5 + СтруктураСтрок.Раздел8_4_2.Графа5 + СтруктураСтрок.Раздел8_5_2.Графа5 + СтруктураСтрок.Раздел8_6_2.Графа5 + СтруктураСтрок.Раздел8_7_2.Графа5  + СтруктураСтрок.Раздел8_8_2.Графа5 + СтруктураСтрок.Раздел8_9_2.Графа5;
					СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_2.Графа6 +СтруктураСтрок.Раздел8_2_2.Графа6 + СтруктураСтрок.Раздел8_3_2.Графа6 + СтруктураСтрок.Раздел8_4_2.Графа6 + СтруктураСтрок.Раздел8_5_2.Графа6 + СтруктураСтрок.Раздел8_6_2.Графа6 + СтруктураСтрок.Раздел8_7_2.Графа6  + СтруктураСтрок.Раздел8_8_2.Графа6 + СтруктураСтрок.Раздел8_9_2.Графа6;
					СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_2.Графа7 +СтруктураСтрок.Раздел8_2_2.Графа7 + СтруктураСтрок.Раздел8_3_2.Графа7 + СтруктураСтрок.Раздел8_4_2.Графа7 + СтруктураСтрок.Раздел8_5_2.Графа7 + СтруктураСтрок.Раздел8_6_2.Графа7 + СтруктураСтрок.Раздел8_7_2.Графа7  + СтруктураСтрок.Раздел8_8_2.Графа7 + СтруктураСтрок.Раздел8_9_2.Графа7;
					СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_2.Графа8 +СтруктураСтрок.Раздел8_2_2.Графа8 + СтруктураСтрок.Раздел8_3_2.Графа8 + СтруктураСтрок.Раздел8_4_2.Графа8 + СтруктураСтрок.Раздел8_5_2.Графа8 + СтруктураСтрок.Раздел8_6_2.Графа8 + СтруктураСтрок.Раздел8_7_2.Графа8  + СтруктураСтрок.Раздел8_8_2.Графа8 + СтруктураСтрок.Раздел8_9_2.Графа8;
					СуммаГраф3_8 = Окр(СуммаГраф3_8, 0);
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					Если СтруктураЗначение.Раздел4_35_2 <> СуммаГраф3_8 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 35.2, должно быть равно сумме значений, указанных в графах 3 – 8 строк 1.2, 2.2, 3.2, 4.2, 5.2, 6.2, 7.2, 8.2 и 9.2 Раздела VIII.";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_35_2) +" <> " + Строка(СуммаГраф3_8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.104");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 153 + КолДопКолонок, 1, 153 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 153 + КолДопКолонок, 1, 153 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел4_35_2_Граф3_8 = СтруктураЗначение.Раздел4_35_2 - СуммаГраф3_8;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел4_35_2_Граф3_8 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// РАЗДЕЛ 5					
					СтруктураЗначений5 = Новый Структура();
					
					НайденныеСтроки = ТЗраздел5_6.НайтиСтроки(Новый Структура("КодКПК_ДатаОтчетности", СокрЛП(Выборка.КПК.Код)+"_"+Строка(Выборка.ДатаОкончанияОтчетногоПериода))); 
					
					Для Каждого НайденнаяСтрока ИЗ найденныеСтроки Цикл						
						СтруктураЗначений5.Вставить("Раздел" + НайденнаяСтрока.Код + "_" + СокрЛП("Графа3"), НайденнаяСтрока.Графа3);
						СтруктураЗначений5.Вставить("Раздел" + НайденнаяСтрока.Код + "_" + СокрЛП("Графа4"), НайденнаяСтрока.Графа4);
						СтруктураЗначений5.Вставить("Раздел" + НайденнаяСтрока.Код + "_" + СокрЛП("Графа5"), НайденнаяСтрока.Графа5);
						СтруктураЗначений5.Вставить("Раздел" + НайденнаяСтрока.Код + "_" + СокрЛП("Графа6"), НайденнаяСтрока.Графа6);					
					КонецЦикла;
					
					//	
					
					//  05.03.04.106 Значение, указанное в графе 6 строки 1.1, должно быть равно сумме значений, указанных в графах 3 и 4 строки 1.1, за вычетом значения, указанного в графе 5 строки 1.1.
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  		
					
					ПравоеЗначение =  СтруктураЗначений5.Раздел5_1_1_Графа3 + СтруктураЗначений5.Раздел5_1_1_Графа4 - СтруктураЗначений5.Раздел5_1_1_Графа5;
					Если СтруктураЗначений5.Раздел5_1_1_Графа6 <> ПравоеЗначение  Тогда
						ОписаниеУсловия= "Значение, указанное в графе 6 строки 1.1, должно быть равно сумме значений, указанных в графах 3 и 4 строки 1.1, за вычетом значения, указанного в графе 5 строки 1.1.";
						ОписаниеОшибки = Строка(СтруктураЗначений5.Раздел5_1_1_Графа6) +" <> " + Строка(ПравоеЗначение);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.106");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 155 + КолДопКолонок, 1, 155 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 155 + КолДопКолонок, 1, 155 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел5_Строка6 = СтруктураЗначений5.Раздел5_1_1_Графа6 - ПравоеЗначение;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел5_Строка6 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					//  05.03.04.107 Сумма значений, указанных в одной и той же графе, строк 1.1 и 1.2, должно быть равно значению, указанному в соответствующей графе строки 1..
					ОписаниеУсловия = "";
					ОписаниеОшибки = ""; 
					
					ЕстьОшибки = Ложь;
					
					ПравоеЗначение =  СтруктураЗначений5.Раздел5_1_1_Графа3 + СтруктураЗначений5.Раздел5_1_2_Графа3;
					Если СтруктураЗначений5.Раздел5_1_Графа3 <> ПравоеЗначение  Тогда
						ЕстьОшибки = Истина;
						ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "Графа 3 строки 1 = " + Строка(СтруктураЗначений5.Раздел5_1_Графа3) +"; сумма значений графы 3 строк 1.1 и 1.2 = " + Строка(ПравоеЗначение);						
					КонецЕсли;
					
					ПравоеЗначение =  СтруктураЗначений5.Раздел5_1_1_Графа4 + СтруктураЗначений5.Раздел5_1_2_Графа4;
					Если СтруктураЗначений5.Раздел5_1_Графа4 <> ПравоеЗначение  Тогда
						ЕстьОшибки = Истина;
						ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "Графа 4 строки 1 = " + Строка(СтруктураЗначений5.Раздел5_1_Графа4) +"; сумма значений графы 4 строк 1.1 и 1.2 = " + Строка(ПравоеЗначение);						
					КонецЕсли;
					
					ПравоеЗначение =  СтруктураЗначений5.Раздел5_1_1_Графа5 + СтруктураЗначений5.Раздел5_1_2_Графа5;
					Если СтруктураЗначений5.Раздел5_1_Графа5 <> ПравоеЗначение  Тогда
						ЕстьОшибки = Истина;
						ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "Графа 5 строки 1 = " + Строка(СтруктураЗначений5.Раздел5_1_Графа5) +"; сумма значений графы 5 строк 1.1 и 1.2 = " + Строка(ПравоеЗначение);						
					КонецЕсли;
					
					ПравоеЗначение =  СтруктураЗначений5.Раздел5_1_1_Графа6 + СтруктураЗначений5.Раздел5_1_2_Графа6;
					Если СтруктураЗначений5.Раздел5_1_Графа6 <> ПравоеЗначение  Тогда
						ЕстьОшибки = Истина;
						ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "Графа 6 строки 1 = " + Строка(СтруктураЗначений5.Раздел5_1_Графа6) +"; сумма значений графы 6 строк 1.1 и 1.2 = " + Строка(ПравоеЗначение);						
					КонецЕсли;
					
					Если ЕстьОшибки = Истина  Тогда
						ОписаниеУсловия= "Значение, указанное в графе 6 строки 1.1, должно быть равно сумме значений, указанных в графах 3 и 4 строки 1.1, за вычетом значения, указанного в графе 5 строки 1.1.";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.107");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 156 + КолДопКолонок, 1, 156 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 156 + КолДопКолонок, 1, 156 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 		
					ОбластьСтрокаКС.Параметры.Проверка_Раздел5_Строка1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.108 Значение, указанное в графе 6 строки 2, должно быть равно сумме значений, указанных в графах 3 и 4 строки 2, за вычетом значения, указанного в графе 5 строки 2.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					ПравоеЗначение =  СтруктураЗначений5.Раздел5_2_Графа3 + СтруктураЗначений5.Раздел5_2_Графа4 - СтруктураЗначений5.Раздел5_2_Графа5;
					
					Если СтруктураЗначений5.Раздел5_2_Графа6 <> ПравоеЗначение  Тогда
						ОписаниеУсловия= "Значение, указанное в графе 6 строки 2, должно быть равно сумме значений, указанных в графах 3 и 4 строки 2, за вычетом значения, указанного в графе 5 строки 2.";
						ОписаниеОшибки = Строка(СтруктураЗначений5.Раздел5_2_Графа6) +" <> " + Строка(ПравоеЗначение);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.108");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, 157 + КолДопКолонок, 1, 157 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, 157 + КолДопКолонок, 1, 157 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Раздел5_2_Графа6 = СтруктураЗначений5.Раздел5_2_Графа6 - ПравоеЗначение;
					ОбластьСтрокаКС.Параметры.Проверка_Раздел5_2_Графа6 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// Раздел 6 Данные   о   средневзвешенных    значениях    полной   стоимости потребительских займов по категориям потребительских займов
					// 05.03.04.109 В строке 1 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					
					Если НЕ СтруктураЗначений5.Свойство("Раздел6_1_Графа3") Тогда
						ОбластьСтрокаКС.Область(1, 159 + КолДопКолонок, 1, 159 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 	
					Иначе	
						
						Если СтруктураЗначений5.Раздел6_1_Графа3 = 0 И СтруктураЗначений5.Раздел6_1_Графа4 = 0 И СтруктураЗначений5.Раздел5_1_Графа5 = 0  
							ИЛИ СтруктураЗначений5.Раздел6_1_Графа3 <> 0 И СтруктураЗначений5.Раздел6_1_Графа4 <> 0 И СтруктураЗначений5.Раздел5_1_Графа5 <> 0  Тогда
							ОбластьСтрокаКС.Область(1, 159 + КолДопКолонок, 1, 159 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
						Иначе
							
							ОписаниеУсловия= "В строке 1 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля";
							ОписаниеОшибки = "Раздел 6 Строка 1 графа 3 = " + Строка(СтруктураЗначений5.Раздел6_1_Графа3) +"; Строка 1 графа 4 = " + Строка(СтруктураЗначений5.Раздел6_1_Графа4) +"; Строка 1 графа 5 = " + Строка(СтруктураЗначений5.Раздел6_1_Графа5);
							ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.109");   
							ИтогоОшибокКС = ИтогоОшибокКС + 1;
							Ошибка = 1;
							
							ОбластьСтрокаКС.Область(1, 159 + КолДопКолонок, 1, 159 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						КонецЕсли;
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_109 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_109 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.110 В строке 2.1 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 160;
					
					Если НЕ СтруктураЗначений5.Свойство("Раздел6_2_1_Графа3") Тогда
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 	
					Иначе	
						
						Если СтруктураЗначений5.Раздел6_2_1_Графа3 = 0 И СтруктураЗначений5.Раздел6_2_1_Графа4 = 0 И СтруктураЗначений5.Раздел6_2_1_Графа5 = 0  
							ИЛИ СтруктураЗначений5.Раздел6_2_1_Графа3 <> 0 И СтруктураЗначений5.Раздел6_2_1_Графа4 <> 0 И СтруктураЗначений5.Раздел6_2_1_Графа5 <> 0  Тогда
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
						Иначе
							
							ОписаниеУсловия= "В строке 2.1 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля";
							ОписаниеОшибки = "Раздел 6 Строка 2.1 графа 3 = " + Строка(СтруктураЗначений5.Раздел6_2_1_Графа3) +"; графа 4 = " + Строка(СтруктураЗначений5.Раздел6_2_1_Графа4) +"; графа 5 = " + Строка(СтруктураЗначений5.Раздел6_2_1_Графа5);
							ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.110");   
							ИтогоОшибокКС = ИтогоОшибокКС + 1;
							Ошибка = 1;
							
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						КонецЕсли;
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_110 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_110 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					//// 05.03.04.111 В строке 2.2 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 161;
					
					Если НЕ СтруктураЗначений5.Свойство("Раздел6_2_2_Графа3") Тогда
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 	
					Иначе	
						
						Если СтруктураЗначений5.Раздел6_2_2_Графа3 = 0 И СтруктураЗначений5.Раздел6_2_2_Графа4 = 0 И СтруктураЗначений5.Раздел6_2_2_Графа5 = 0  
							ИЛИ СтруктураЗначений5.Раздел6_2_2_Графа3 <> 0 И СтруктураЗначений5.Раздел6_2_2_Графа4 <> 0 И СтруктураЗначений5.Раздел6_2_2_Графа5 <> 0  Тогда
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
						Иначе
							
							ОписаниеУсловия= "В строке 2.2 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля";
							ОписаниеОшибки = "Раздел 6 Строка 2.2 графа 3 = " + Строка(СтруктураЗначений5.Раздел6_2_2_Графа3) +"; графа 4 = " + Строка(СтруктураЗначений5.Раздел6_2_2_Графа4) +"; графа 5 = " + Строка(СтруктураЗначений5.Раздел6_2_2_Графа5);
							ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.111");   
							ИтогоОшибокКС = ИтогоОшибокКС + 1;
							Ошибка = 1;
							
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						КонецЕсли;
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_111 = Ошибка;                                                                           					
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_111 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.112 В строке 3.1.1 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 162;
					
					Если НЕ СтруктураЗначений5.Свойство("Раздел6_3_1_1_Графа3") Тогда
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 	
					Иначе	
						
						Если СтруктураЗначений5.Раздел6_3_1_1_Графа3 = 0 И СтруктураЗначений5.Раздел6_3_1_1_Графа4 = 0 И СтруктураЗначений5.Раздел6_3_1_1_Графа5 = 0  
							ИЛИ СтруктураЗначений5.Раздел6_3_1_1_Графа3 <> 0 И СтруктураЗначений5.Раздел6_3_1_1_Графа4 <> 0 И СтруктураЗначений5.Раздел6_3_1_1_Графа5 <> 0  Тогда
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
						Иначе
							
							ОписаниеУсловия= "В строке 3.1.1 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля";
							ОписаниеОшибки = "Раздел 6 Строка 3.1.1 графа 3 = " + Строка(СтруктураЗначений5.Раздел6_3_1_1_Графа3) +"; графа 4 = " + Строка(СтруктураЗначений5.Раздел6_3_1_1_Графа4) +"; графа 5 = " + Строка(СтруктураЗначений5.Раздел6_3_1_1_Графа5);
							ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.112");   
							ИтогоОшибокКС = ИтогоОшибокКС + 1;
							Ошибка = 1;
							
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						КонецЕсли;
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_112 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_112 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.113 В строке 3.1.2 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 163;
					
					Если НЕ СтруктураЗначений5.Свойство("Раздел6_3_1_2_Графа3") Тогда
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 	
					Иначе	
						
						Если СтруктураЗначений5.Раздел6_3_1_2_Графа3 = 0 И СтруктураЗначений5.Раздел6_3_1_2_Графа4 = 0 И СтруктураЗначений5.Раздел6_3_1_2_Графа5 = 0  
							ИЛИ СтруктураЗначений5.Раздел6_3_1_2_Графа3 <> 0 И СтруктураЗначений5.Раздел6_3_1_2_Графа4 <> 0 И СтруктураЗначений5.Раздел6_3_1_2_Графа5 <> 0  Тогда
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
						Иначе
							
							ОписаниеУсловия= "В строке 3.1.2 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля";
							ОписаниеОшибки = "Раздел 6 Строка 3.1.2 графа 3 = " + Строка(СтруктураЗначений5.Раздел6_3_1_2_Графа3) +"; графа 4 = " + Строка(СтруктураЗначений5.Раздел6_3_1_2_Графа4) +"; графа 5 = " + Строка(СтруктураЗначений5.Раздел6_3_1_2_Графа5);
							ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.113");   
							ИтогоОшибокКС = ИтогоОшибокКС + 1;
							Ошибка = 1;
							
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						КонецЕсли;
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_113 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_113 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.114 В строке 3.2.1 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 164;
					
					Если НЕ СтруктураЗначений5.Свойство("Раздел6_3_2_1_Графа3") Тогда
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 	
					Иначе	
						
						Если СтруктураЗначений5.Раздел6_3_2_1_Графа3 = 0 И СтруктураЗначений5.Раздел6_3_2_1_Графа4 = 0 И СтруктураЗначений5.Раздел6_3_2_1_Графа5 = 0  
							ИЛИ СтруктураЗначений5.Раздел6_3_2_1_Графа3 <> 0 И СтруктураЗначений5.Раздел6_3_2_1_Графа4 <> 0 И СтруктураЗначений5.Раздел6_3_2_1_Графа5 <> 0  Тогда
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
						Иначе
							
							ОписаниеУсловия= "В строке 3.2.1 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля";
							ОписаниеОшибки = "Раздел 6 Строка 3.2.1 графа 3 = " + Строка(СтруктураЗначений5.Раздел6_3_2_1_Графа3) +"; графа 4 = " + Строка(СтруктураЗначений5.Раздел6_3_2_1_Графа4) +"; графа 5 = " + Строка(СтруктураЗначений5.Раздел6_3_2_1_Графа5);
							ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.114");   
							ИтогоОшибокКС = ИтогоОшибокКС + 1;
							Ошибка = 1;
							
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						КонецЕсли;
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_114 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_114 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.115 В строке 3.2.2 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 165;
					
					Если НЕ СтруктураЗначений5.Свойство("Раздел6_3_2_2_Графа3") Тогда
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 	
					Иначе	
						
						Если СтруктураЗначений5.Раздел6_3_2_2_Графа3 = 0 И СтруктураЗначений5.Раздел6_3_2_2_Графа4 = 0 И СтруктураЗначений5.Раздел6_3_2_2_Графа5 = 0  
							ИЛИ СтруктураЗначений5.Раздел6_3_2_2_Графа3 <> 0 И СтруктураЗначений5.Раздел6_3_2_2_Графа4 <> 0 И СтруктураЗначений5.Раздел6_3_2_2_Графа5 <> 0  Тогда
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
						Иначе
							
							ОписаниеУсловия= "В строке 3.2.2 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля";
							ОписаниеОшибки = "Раздел 6 Строка 3.2.2 графа 3 = " + Строка(СтруктураЗначений5.Раздел6_3_2_2_Графа3) +"; графа 4 = " + Строка(СтруктураЗначений5.Раздел6_3_2_2_Графа4) +"; графа 5 = " + Строка(СтруктураЗначений5.Раздел6_3_2_2_Графа5);
							ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.115");   
							ИтогоОшибокКС = ИтогоОшибокКС + 1;
							Ошибка = 1;
							
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						КонецЕсли;
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_115 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_115 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.116 В строке 3.3.1 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 166;
					
					Если НЕ СтруктураЗначений5.Свойство("Раздел6_3_3_1_Графа3") Тогда
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 	
					Иначе	
						
						Если СтруктураЗначений5.Раздел6_3_3_1_Графа3 = 0 И СтруктураЗначений5.Раздел6_3_3_1_Графа4 = 0 И СтруктураЗначений5.Раздел6_3_3_1_Графа5 = 0  
							ИЛИ СтруктураЗначений5.Раздел6_3_3_1_Графа3 <> 0 И СтруктураЗначений5.Раздел6_3_3_1_Графа4 <> 0 И СтруктураЗначений5.Раздел6_3_3_1_Графа5 <> 0  Тогда
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
						Иначе
							
							ОписаниеУсловия= "В строке 3.3.1 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля";
							ОписаниеОшибки = "Раздел 6 Строка 3.3.1 графа 3 = " + Строка(СтруктураЗначений5.Раздел6_3_3_1_Графа3) +"; графа 4 = " + Строка(СтруктураЗначений5.Раздел6_3_3_1_Графа4) +"; графа 5 = " + Строка(СтруктураЗначений5.Раздел6_3_3_1_Графа5);
							ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.116");   
							ИтогоОшибокКС = ИтогоОшибокКС + 1;
							Ошибка = 1;
							
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						КонецЕсли;
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_116 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_116 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.117 В строке 3.3.2 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 167;
					
					Если НЕ СтруктураЗначений5.Свойство("Раздел6_3_3_2_Графа3") Тогда
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 	
					Иначе	
						
						Если СтруктураЗначений5.Раздел6_3_3_2_Графа3 = 0 И СтруктураЗначений5.Раздел6_3_3_2_Графа4 = 0 И СтруктураЗначений5.Раздел6_3_3_2_Графа5 = 0  
							ИЛИ СтруктураЗначений5.Раздел6_3_3_2_Графа3 <> 0 И СтруктураЗначений5.Раздел6_3_3_2_Графа4 <> 0 И СтруктураЗначений5.Раздел6_3_3_2_Графа5 <> 0  Тогда
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
						Иначе
							
							ОписаниеУсловия= "В строке 3.3.2 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля";
							ОписаниеОшибки = "Раздел 6 Строка 3.3.2 графа 3 = " + Строка(СтруктураЗначений5.Раздел6_3_3_2_Графа3) +"; графа 4 = " + Строка(СтруктураЗначений5.Раздел6_3_3_2_Графа4) +"; графа 5 = " + Строка(СтруктураЗначений5.Раздел6_3_3_2_Графа5);
							ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.117");   
							ИтогоОшибокКС = ИтогоОшибокКС + 1;
							Ошибка = 1;
							
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						КонецЕсли;
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_117 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_117 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.118 В строке 3.3.3 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 168;
					
					Если НЕ СтруктураЗначений5.Свойство("Раздел6_3_3_3_Графа3") Тогда
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 	
					Иначе	
						
						Если СтруктураЗначений5.Раздел6_3_3_3_Графа3 = 0 И СтруктураЗначений5.Раздел6_3_3_3_Графа4 = 0 И СтруктураЗначений5.Раздел6_3_3_3_Графа5 = 0  
							ИЛИ СтруктураЗначений5.Раздел6_3_3_2_Графа3 <> 0 И СтруктураЗначений5.Раздел6_3_3_2_Графа4 <> 0 И СтруктураЗначений5.Раздел6_3_3_2_Графа5 <> 0  Тогда
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
						Иначе
							
							ОписаниеУсловия= "В строке 3.3.2 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля";
							ОписаниеОшибки = "Раздел 6 Строка 3.3.3 графа 3 = " + Строка(СтруктураЗначений5.Раздел6_3_3_3_Графа3) +"; графа 4 = " + Строка(СтруктураЗначений5.Раздел6_3_3_3_Графа4) +"; графа 5 = " + Строка(СтруктураЗначений5.Раздел6_3_3_3_Графа5);
							ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.118");   
							ИтогоОшибокКС = ИтогоОшибокКС + 1;
							Ошибка = 1;
							
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						КонецЕсли;
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_118 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_118 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.119 В строке 3.4.1 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуляя
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 169;
					
					Если НЕ СтруктураЗначений5.Свойство("Раздел6_3_4_1_Графа3") Тогда
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 	
					Иначе	
						
						Если СтруктураЗначений5.Раздел6_3_4_1_Графа3 = 0 И СтруктураЗначений5.Раздел6_3_4_1_Графа4 = 0 И СтруктураЗначений5.Раздел6_3_4_1_Графа5 = 0  
							ИЛИ СтруктураЗначений5.Раздел6_3_4_1_Графа3 <> 0 И СтруктураЗначений5.Раздел6_3_4_1_Графа4 <> 0 И СтруктураЗначений5.Раздел6_3_4_1_Графа5 <> 0  Тогда
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
						Иначе
							
							ОписаниеУсловия= "В строке 3.4.1 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля";
							ОписаниеОшибки = "Раздел 6 Строка 3.4.1 графа 3 = " + Строка(СтруктураЗначений5.Раздел6_3_4_1_Графа3) +"; графа 4 = " + Строка(СтруктураЗначений5.Раздел6_3_4_1_Графа4) +"; графа 5 = " + Строка(СтруктураЗначений5.Раздел6_3_4_1_Графа5);
							ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.119");   
							ИтогоОшибокКС = ИтогоОшибокКС + 1;
							Ошибка = 1;
							
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						КонецЕсли;
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_119 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_119 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.120 В строке 3.4.2 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 170;
					
					Если НЕ СтруктураЗначений5.Свойство("Раздел6_3_4_2_Графа3") Тогда
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 	
					Иначе	
						
						Если СтруктураЗначений5.Раздел6_3_4_2_Графа3 = 0 И СтруктураЗначений5.Раздел6_3_4_2_Графа4 = 0 И СтруктураЗначений5.Раздел6_3_4_2_Графа5 = 0  
							ИЛИ СтруктураЗначений5.Раздел6_3_4_2_Графа3 <> 0 И СтруктураЗначений5.Раздел6_3_4_2_Графа4 <> 0 И СтруктураЗначений5.Раздел6_3_4_2_Графа5 <> 0  Тогда
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
						Иначе
							
							ОписаниеУсловия= "В строке 3.4.2 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля";
							ОписаниеОшибки = "Раздел 6 Строка 3.4.2 графа 3 = " + Строка(СтруктураЗначений5.Раздел6_3_4_2_Графа3) +"; графа 4 = " + Строка(СтруктураЗначений5.Раздел6_3_4_2_Графа4) +"; графа 5 = " + Строка(СтруктураЗначений5.Раздел6_3_4_2_Графа5);
							ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.120");   
							ИтогоОшибокКС = ИтогоОшибокКС + 1;
							Ошибка = 1;
							
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						КонецЕсли;
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_120 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_120 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.121 В строке 3.4.3 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 171;
					
					Если НЕ СтруктураЗначений5.Свойство("Раздел6_3_4_3_Графа3") Тогда
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 	
					Иначе	
						
						Если СтруктураЗначений5.Раздел6_3_4_3_Графа3 = 0 И СтруктураЗначений5.Раздел6_3_4_3_Графа4 = 0 И СтруктураЗначений5.Раздел6_3_4_3_Графа5 = 0  
							ИЛИ СтруктураЗначений5.Раздел6_3_4_3_Графа3 <> 0 И СтруктураЗначений5.Раздел6_3_4_3_Графа4 <> 0 И СтруктураЗначений5.Раздел6_3_4_3_Графа5 <> 0  Тогда
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
						Иначе
							
							ОписаниеУсловия= "В строке 3.4.3 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля";
							ОписаниеОшибки = "Раздел 6 Строка 3.4.3 графа 3 = " + Строка(СтруктураЗначений5.Раздел6_3_4_3_Графа3) +"; графа 4 = " + Строка(СтруктураЗначений5.Раздел6_3_4_3_Графа4) +"; графа 5 = " + Строка(СтруктураЗначений5.Раздел6_3_4_3_Графа5);
							ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.121");   
							ИтогоОшибокКС = ИтогоОшибокКС + 1;
							Ошибка = 1;
							
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						КонецЕсли;
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_121 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_121 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.122 В строке 3.4.4 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 172;
					
					Если НЕ СтруктураЗначений5.Свойство("Раздел6_3_4_4_Графа3") Тогда
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 	
					Иначе	
						
						Если СтруктураЗначений5.Раздел6_3_4_4_Графа3 = 0 И СтруктураЗначений5.Раздел6_3_4_4_Графа4 = 0 И СтруктураЗначений5.Раздел6_3_4_4_Графа5 = 0  
							ИЛИ СтруктураЗначений5.Раздел6_3_4_4_Графа3 <> 0 И СтруктураЗначений5.Раздел6_3_4_4_Графа4 <> 0 И СтруктураЗначений5.Раздел6_3_4_4_Графа5 <> 0  Тогда
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
						Иначе
							
							ОписаниеУсловия= "В строке 3.4.4 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля";
							ОписаниеОшибки = "Раздел 6 Строка 3.4.4 графа 3 = " + Строка(СтруктураЗначений5.Раздел6_3_4_4_Графа3) +"; графа 4 = " + Строка(СтруктураЗначений5.Раздел6_3_4_4_Графа4) +"; графа 5 = " + Строка(СтруктураЗначений5.Раздел6_3_4_4_Графа5);
							ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.122");   
							ИтогоОшибокКС = ИтогоОшибокКС + 1;
							Ошибка = 1;
							
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						КонецЕсли;
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_122 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_122 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.123 В строке 3.5.1 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 173;
					
					Если НЕ СтруктураЗначений5.Свойство("Раздел6_3_5_1_Графа3") Тогда
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 	
					Иначе	
						
						Если СтруктураЗначений5.Раздел6_3_5_1_Графа3 = 0 И СтруктураЗначений5.Раздел6_3_5_1_Графа4 = 0 И СтруктураЗначений5.Раздел6_3_5_1_Графа5 = 0  
							ИЛИ СтруктураЗначений5.Раздел6_3_5_1_Графа3 <> 0 И СтруктураЗначений5.Раздел6_3_5_1_Графа4 <> 0 И СтруктураЗначений5.Раздел6_3_5_1_Графа5 <> 0  Тогда
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
						Иначе
							
							ОписаниеУсловия= "В строке 3.5.1 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля";
							ОписаниеОшибки = "Раздел 6 Строка 3.5.1 графа 3 = " + Строка(СтруктураЗначений5.Раздел6_3_54_1_Графа3) +"; графа 4 = " + Строка(СтруктураЗначений5.Раздел6_3_5_1_Графа4) +"; графа 5 = " + Строка(СтруктураЗначений5.Раздел6_3_5_1_Графа5);
							ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.123");   
							ИтогоОшибокКС = ИтогоОшибокКС + 1;
							Ошибка = 1;
							
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						КонецЕсли;
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_123 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_123 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.124 В строке 3.5.2 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 174;
					
					Если НЕ СтруктураЗначений5.Свойство("Раздел6_3_5_2_Графа3") Тогда
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 	
					Иначе	
						
						Если СтруктураЗначений5.Раздел6_3_5_2_Графа3 = 0 И СтруктураЗначений5.Раздел6_3_5_2_Графа4 = 0 И СтруктураЗначений5.Раздел6_3_5_2_Графа5 = 0  
							ИЛИ СтруктураЗначений5.Раздел6_3_5_2_Графа3 <> 0 И СтруктураЗначений5.Раздел6_3_5_2_Графа4 <> 0 И СтруктураЗначений5.Раздел6_3_5_2_Графа5 <> 0  Тогда
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
						Иначе
							
							ОписаниеУсловия= "В строке 3.5.2 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля";
							ОписаниеОшибки = "Раздел 6 Строка 3.5.2 графа 3 = " + Строка(СтруктураЗначений5.Раздел6_3_5_2_Графа3) +"; графа 4 = " + Строка(СтруктураЗначений5.Раздел6_3_5_2_Графа4) +"; графа 5 = " + Строка(СтруктураЗначений5.Раздел6_3_5_2_Графа5);
							ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.124");   
							ИтогоОшибокКС = ИтогоОшибокКС + 1;
							Ошибка = 1;
							
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						КонецЕсли;
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_124 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_124 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.125 В строке 3.5.3 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 175;
					
					Если НЕ СтруктураЗначений5.Свойство("Раздел6_3_5_3_Графа3") Тогда
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 	
					Иначе	
						
						Если СтруктураЗначений5.Раздел6_3_5_3_Графа3 = 0 И СтруктураЗначений5.Раздел6_3_5_3_Графа4 = 0 И СтруктураЗначений5.Раздел6_3_5_3_Графа5 = 0  
							ИЛИ СтруктураЗначений5.Раздел6_3_5_3_Графа3 <> 0 И СтруктураЗначений5.Раздел6_3_5_3_Графа4 <> 0 И СтруктураЗначений5.Раздел6_3_5_3_Графа5 <> 0  Тогда
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
						Иначе
							
							ОписаниеУсловия= "В строке 3.5.3 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля";
							ОписаниеОшибки = "Раздел 6 Строка 3.5.3 графа 3 = " + Строка(СтруктураЗначений5.Раздел6_3_5_3_Графа3) +"; графа 4 = " + Строка(СтруктураЗначений5.Раздел6_3_5_3_Графа4) +"; графа 5 = " + Строка(СтруктураЗначений5.Раздел6_3_5_3_Графа5);
							ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.125");   
							ИтогоОшибокКС = ИтогоОшибокКС + 1;
							Ошибка = 1;
							
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						КонецЕсли;
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_125 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_125 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.126 В строке 3.5.4 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 176;
					
					Если НЕ СтруктураЗначений5.Свойство("Раздел6_3_5_4_Графа3") Тогда
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 	
					Иначе	
						
						Если СтруктураЗначений5.Раздел6_3_5_4_Графа3 = 0 И СтруктураЗначений5.Раздел6_3_5_4_Графа4 = 0 И СтруктураЗначений5.Раздел6_3_5_4_Графа5 = 0  
							ИЛИ СтруктураЗначений5.Раздел6_3_5_4_Графа3 <> 0 И СтруктураЗначений5.Раздел6_3_5_4_Графа4 <> 0 И СтруктураЗначений5.Раздел6_3_5_4_Графа5 <> 0  Тогда
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
						Иначе
							
							ОписаниеУсловия= "В строке 3.5.4 значения, указанные в графах 3, 4 и 5 должны быть одновременно либо равны нулю, либо отличны от нуля";
							ОписаниеОшибки = "Раздел 6 Строка 3.5.4 графа 3 = " + Строка(СтруктураЗначений5.Раздел6_3_5_4_Графа3) +"; графа 4 = " + Строка(СтруктураЗначений5.Раздел6_3_5_4_Графа4) +"; графа 5 = " + Строка(СтруктураЗначений5.Раздел6_3_5_4_Графа5);
							ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.126");   
							ИтогоОшибокКС = ИтогоОшибокКС + 1;
							Ошибка = 1;
							
							ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
						КонецЕсли;
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_126 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_126 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// Раздел 7
					
					// 05.03.04.136 Если в графах 7 или 8 строки 1.1 указано значение, отличное от нуля, то и в соответствующей графе строки 1.1 Раздела VIII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 178;
					
					Если (СтруктураСтрок.Раздел7_1_1.Графа7 <> 0 И СтруктураСтрок.Раздел8_1_1.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел7_1_1.Графа8  И СтруктураСтрок.Раздел8_1_1.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 1.1 указано значение, отличное от нуля, то и в соответствующей графе строки 1.1 Раздела VIII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 7 Строка 1.1 графа 7 = " + Строка(СтруктураСтрок.Раздел7_1_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_1_1.Графа8) +"; Раздел 8 строка 1.1 графа 7 = " + Строка(СтруктураСтрок.Раздел8_1_1.Графа7) +"; строка 1.1 графа 8 = " + Строка(СтруктураСтрок.Раздел8_1_1.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.136");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_136 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_136 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.137 Если в графах 7 или 8 строки 1.2 указано значение, отличное от нуля, то и в соответствующей графе строки 1.2 Раздела VIII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 179;
					
					Если (СтруктураСтрок.Раздел7_1_2.Графа7 <> 0 И СтруктураСтрок.Раздел8_1_2.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел7_1_2.Графа8  И СтруктураСтрок.Раздел8_1_2.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 1.2 указано значение, отличное от нуля, то и в соответствующей графе строки 1.2 Раздела VIII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 7 Строка 1.2 графа 7 = " + Строка(СтруктураСтрок.Раздел7_1_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_1_2.Графа8) +"; Раздел 8 строка 1.2 графа 7 = " + Строка(СтруктураСтрок.Раздел8_1_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_1_2.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.137");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_137 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_137 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.138 Если в какой-либо графе строки 2.1 указано значение, отличное от нуля, то и в соответствующей графе строки 2.1 Раздела VIII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 180;
					
					Если (СтруктураСтрок.Раздел7_2_1.Графа7 <> 0 И СтруктураСтрок.Раздел8_2_1.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел7_2_1.Графа8  И СтруктураСтрок.Раздел8_2_1.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 2.1 указано значение, отличное от нуля, то и в соответствующей графе строки 2.1 Раздела VIII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 7 Строка 2.1 графа 7 = " + Строка(СтруктураСтрок.Раздел7_2_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_2_1.Графа8) +"; Раздел 8 строка 2.1 графа 7 = " + Строка(СтруктураСтрок.Раздел8_2_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_2_1.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.138");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_138 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_138 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.139 Если в какой-либо графе строки 2.2 указано значение, отличное от нуля, то и в соответствующей графе строки 2.2 Раздела VIII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 181;
					
					Если (СтруктураСтрок.Раздел7_2_2.Графа7 <> 0 И СтруктураСтрок.Раздел8_2_2.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел7_2_2.Графа8  И СтруктураСтрок.Раздел8_2_2.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 2.2 указано значение, отличное от нуля, то и в соответствующей графе строки 2.2 Раздела VIII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 7 Строка 2.2 графа 7 = " + Строка(СтруктураСтрок.Раздел7_2_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_2_2.Графа8) +"; Раздел 8 строка 2.2 графа 7 = " + Строка(СтруктураСтрок.Раздел8_2_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_2_2.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.139");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_139 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_139 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.140 Если в какой-либо графе строки 3.1 указано значение, отличное от нуля, то и в соответствующей графе строки 3.1 Раздела VIII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 182;
					
					Если (СтруктураСтрок.Раздел7_3_1.Графа7 <> 0 И СтруктураСтрок.Раздел8_3_1.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел7_3_1.Графа8  И СтруктураСтрок.Раздел8_3_1.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 3.1 указано значение, отличное от нуля, то и в соответствующей графе строки 3.1 Раздела VIII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 7 Строка 3.1 графа 7 = " + Строка(СтруктураСтрок.Раздел7_3_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_3_1.Графа8) +"; Раздел 8 строка 3.1 графа 7 = " + Строка(СтруктураСтрок.Раздел8_3_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_3_1.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.140");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_140 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_140 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.141 Если в какой-либо графе строки 3.2 указано значение, отличное от нуля, то и в соответствующей графе строки 3.2 Раздела VIII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 183;
					
					Если (СтруктураСтрок.Раздел7_3_2.Графа7 <> 0 И СтруктураСтрок.Раздел8_3_2.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел7_3_2.Графа8  И СтруктураСтрок.Раздел8_3_2.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 3.2 указано значение, отличное от нуля, то и в соответствующей графе строки 3.2 Раздела VIII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 7 Строка 3.2 графа 7 = " + Строка(СтруктураСтрок.Раздел7_3_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_3_2.Графа8) +"; Раздел 8 строка 3.2 графа 7 = " + Строка(СтруктураСтрок.Раздел8_3_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_3_2.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.141");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_141 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_141 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.142 Если в какой-либо графе строки 4.1 указано значение, отличное от нуля, то и в соответствующей графе строки 4.1 Раздела VIII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 184;
					
					Если (СтруктураСтрок.Раздел7_4_1.Графа7 <> 0 И СтруктураСтрок.Раздел8_4_1.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел7_4_1.Графа8  И СтруктураСтрок.Раздел8_4_1.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 4.1 указано значение, отличное от нуля, то и в соответствующей графе строки 4.1 Раздела VIII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 7 Строка 4.1 графа 7 = " + Строка(СтруктураСтрок.Раздел7_4_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_4_1.Графа8) +"; Раздел 8 строка 4.1 графа 7 = " + Строка(СтруктураСтрок.Раздел8_4_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_4_1.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.142");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_142 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_142 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.143 Если в какой-либо графе строки 4.2 указано значение, отличное от нуля, то и в соответствующей графе строки 4.2 Раздела VIII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 185;
					
					Если (СтруктураСтрок.Раздел7_4_2.Графа7 <> 0 И СтруктураСтрок.Раздел8_4_2.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел7_4_2.Графа8  И СтруктураСтрок.Раздел8_4_2.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 4.2 указано значение, отличное от нуля, то и в соответствующей графе строки 4.2 Раздела VIII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 7 Строка 4.2 графа 7 = " + Строка(СтруктураСтрок.Раздел7_4_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_4_2.Графа8) +"; Раздел 8 строка 4.2 графа 7 = " + Строка(СтруктураСтрок.Раздел8_4_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_4_2.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.143");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_143 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_143 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.144 Если в какой-либо графе строки 5.1 указано значение, отличное от нуля, то и в соответствующей графе строки 5.1 Раздела VIII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 186;
					
					Если (СтруктураСтрок.Раздел7_5_1.Графа7 <> 0 И СтруктураСтрок.Раздел8_5_1.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел7_5_1.Графа8  И СтруктураСтрок.Раздел8_5_1.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 5.1 указано значение, отличное от нуля, то и в соответствующей графе строки 5.1 Раздела VIII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 7 Строка 5.1 графа 7 = " + Строка(СтруктураСтрок.Раздел7_5_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_5_1.Графа8) +"; Раздел 8 строка 5.1 графа 7 = " + Строка(СтруктураСтрок.Раздел8_5_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_5_1.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.144");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_144 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_144 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.145 Если в какой-либо графе строки 5.2 указано значение, отличное от нуля, то и в соответствующей графе строки 5.2 Раздела VIII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 187;
					
					Если (СтруктураСтрок.Раздел7_5_2.Графа7 <> 0 И СтруктураСтрок.Раздел8_5_2.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел7_5_2.Графа8  И СтруктураСтрок.Раздел8_5_2.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 5.2 указано значение, отличное от нуля, то и в соответствующей графе строки 5.2 Раздела VIII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 7 Строка 5.2 графа 7 = " + Строка(СтруктураСтрок.Раздел7_5_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_5_2.Графа8) +"; Раздел 8 строка 5.2 графа 7 = " + Строка(СтруктураСтрок.Раздел8_5_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_5_2.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.145");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_145 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_145 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.146 Если в какой-либо графе строки 6.1 указано значение, отличное от нуля, то и в соответствующей графе строки 6.1 Раздела VIII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 188;
					
					Если (СтруктураСтрок.Раздел7_6_1.Графа7 <> 0 И СтруктураСтрок.Раздел8_6_1.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел7_6_1.Графа8  И СтруктураСтрок.Раздел8_6_1.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 6.1 указано значение, отличное от нуля, то и в соответствующей графе строки 6.1 Раздела VIII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 7 Строка 6.1 графа 7 = " + Строка(СтруктураСтрок.Раздел7_6_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_6_1.Графа8) +"; Раздел 8 строка 6.1 графа 7 = " + Строка(СтруктураСтрок.Раздел8_6_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_6_1.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.146");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_146 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_146 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.147 Если в какой-либо графе строки 6.2 указано значение, отличное от нуля, то и в соответствующей графе строки 6.2 Раздела VIII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 189;
					
					Если (СтруктураСтрок.Раздел7_6_2.Графа7 <> 0 И СтруктураСтрок.Раздел8_6_2.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел7_6_2.Графа8  И СтруктураСтрок.Раздел8_6_2.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 6.2 указано значение, отличное от нуля, то и в соответствующей графе строки 6.2 Раздела VIII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 7 Строка 6.2 графа 7 = " + Строка(СтруктураСтрок.Раздел7_6_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_6_2.Графа8) +"; Раздел 8 строка 6.2 графа 7 = " + Строка(СтруктураСтрок.Раздел8_6_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_6_2.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.147");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_147 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_147 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.148 Если в какой-либо графе строки 7.1 указано значение, отличное от нуля, то и в соответствующей графе строки 7.1 Раздела VIII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 190;
					
					Если (СтруктураСтрок.Раздел7_7_1.Графа7 <> 0 И СтруктураСтрок.Раздел8_7_1.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел7_7_1.Графа8  И СтруктураСтрок.Раздел8_7_1.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 7.1 указано значение, отличное от нуля, то и в соответствующей графе строки 7.1 Раздела VIII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 7 Строка 7.1 графа 7 = " + Строка(СтруктураСтрок.Раздел7_7_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_7_1.Графа8) +"; Раздел 8 строка 7.1 графа 7 = " + Строка(СтруктураСтрок.Раздел8_7_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_7_1.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.148");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_148 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_148 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.149 Если в какой-либо графе строки 7.2 указано значение, отличное от нуля, то и в соответствующей графе строки 7.2 Раздела VIII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 191;
					
					Если (СтруктураСтрок.Раздел7_7_2.Графа7 <> 0 И СтруктураСтрок.Раздел8_7_2.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел7_7_2.Графа8  И СтруктураСтрок.Раздел8_7_2.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 7.2 указано значение, отличное от нуля, то и в соответствующей графе строки 7.2 Раздела VIII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 7 Строка 7.2 графа 7 = " + Строка(СтруктураСтрок.Раздел7_7_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_7_2.Графа8) +"; Раздел 8 строка 7.2 графа 7 = " + Строка(СтруктураСтрок.Раздел8_7_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_7_2.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.149");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_149 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_149 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.150 Если в какой-либо графе строки 8.1 указано значение, отличное от нуля, то и в соответствующей графе строки 8.1 Раздела VIII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 192;
					
					Если (СтруктураСтрок.Раздел7_8_1.Графа7 <> 0 И СтруктураСтрок.Раздел8_8_1.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел7_8_1.Графа8  И СтруктураСтрок.Раздел8_8_1.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 8.1 указано значение, отличное от нуля, то и в соответствующей графе строки 8.1 Раздела VIII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 7 Строка 8.1 графа 7 = " + Строка(СтруктураСтрок.Раздел7_8_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_8_1.Графа8) +"; Раздел 8 строка 8.1 графа 7 = " + Строка(СтруктураСтрок.Раздел8_8_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_8_1.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.150");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_150 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_150 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.151 Если в какой-либо графе строки 8.2 указано значение, отличное от нуля, то и в соответствующей графе строки 8.2 Раздела VIII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 193;
					
					Если (СтруктураСтрок.Раздел7_8_2.Графа7 <> 0 И СтруктураСтрок.Раздел8_8_2.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел7_8_2.Графа8  И СтруктураСтрок.Раздел8_8_2.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 8.2 указано значение, отличное от нуля, то и в соответствующей графе строки 8.2 Раздела VIII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 7 Строка 8.2 графа 7 = " + Строка(СтруктураСтрок.Раздел7_8_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_8_2.Графа8) +"; Раздел 8 строка 8.2 графа 7 = " + Строка(СтруктураСтрок.Раздел8_8_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_8_2.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.151");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_151 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_151 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.152 Если в какой-либо графе строки 9.1 указано значение, отличное от нуля, то и в соответствующей графе строки 9.1 Раздела VIII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 194;
					
					Если (СтруктураСтрок.Раздел7_9_1.Графа7 <> 0 И СтруктураСтрок.Раздел8_9_1.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел7_9_1.Графа8  И СтруктураСтрок.Раздел8_9_1.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 9.1 указано значение, отличное от нуля, то и в соответствующей графе строки 9.1 Раздела VIII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 7 Строка 9.1 графа 7 = " + Строка(СтруктураСтрок.Раздел7_9_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_9_1.Графа8) +"; Раздел 8 строка 9.1 графа 7 = " + Строка(СтруктураСтрок.Раздел8_9_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_9_1.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.152");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_152 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_152 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.153 Если в какой-либо графе строки 9.2 указано значение, отличное от нуля, то и в соответствующей графе строки 9.2 Раздела VIII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 195;
					
					Если (СтруктураСтрок.Раздел7_9_2.Графа7 <> 0 И СтруктураСтрок.Раздел8_9_2.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел7_9_2.Графа8  И СтруктураСтрок.Раздел8_9_2.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 9.2 указано значение, отличное от нуля, то и в соответствующей графе строки 9.2 Раздела VIII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 7 Строка 9.2 графа 7 = " + Строка(СтруктураСтрок.Раздел7_9_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_9_2.Графа8) +"; Раздел 8 строка 9.2 графа 7 = " + Строка(СтруктураСтрок.Раздел8_9_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_9_2.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.153");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_153 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_153 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.154 Сумма значений по строкам 1.1, 2.1, 3.1, 4.1, 5.1, 6.1, 7.1, 8.1 и 9.1 в графах 3, 4, 7, 8 Раздела VII, должна быть больше или равна сумме значений по строкам 1.1.1 и (или) 1.2.1 Раздела II
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 196;
					
					ЗначениеГрафа3 = СтруктураСтрок.Раздел7_1_1.Графа3 + СтруктураСтрок.Раздел7_2_1.Графа3 + СтруктураСтрок.Раздел7_3_1.Графа3 + СтруктураСтрок.Раздел7_4_1.Графа3 + СтруктураСтрок.Раздел7_5_1.Графа3 + СтруктураСтрок.Раздел7_6_1.Графа3 + СтруктураСтрок.Раздел7_7_1.Графа3 + СтруктураСтрок.Раздел7_8_1.Графа3 + СтруктураСтрок.Раздел7_9_1.Графа3;
					ЗначениеГрафа4 = СтруктураСтрок.Раздел7_1_1.Графа4 + СтруктураСтрок.Раздел7_2_1.Графа4 + СтруктураСтрок.Раздел7_3_1.Графа4 + СтруктураСтрок.Раздел7_4_1.Графа4 + СтруктураСтрок.Раздел7_5_1.Графа4 + СтруктураСтрок.Раздел7_6_1.Графа4 + СтруктураСтрок.Раздел7_7_1.Графа4 + СтруктураСтрок.Раздел7_8_1.Графа4 + СтруктураСтрок.Раздел7_9_1.Графа4;
					ЗначениеГрафа7 = СтруктураСтрок.Раздел7_1_1.Графа7 + СтруктураСтрок.Раздел7_2_1.Графа7 + СтруктураСтрок.Раздел7_3_1.Графа7 + СтруктураСтрок.Раздел7_4_1.Графа7 + СтруктураСтрок.Раздел7_5_1.Графа7 + СтруктураСтрок.Раздел7_6_1.Графа7 + СтруктураСтрок.Раздел7_7_1.Графа7 + СтруктураСтрок.Раздел7_8_1.Графа7 + СтруктураСтрок.Раздел7_9_1.Графа7;
					ЗначениеГрафа8 = СтруктураСтрок.Раздел7_1_1.Графа8 + СтруктураСтрок.Раздел7_2_1.Графа8 + СтруктураСтрок.Раздел7_3_1.Графа8 + СтруктураСтрок.Раздел7_4_1.Графа8 + СтруктураСтрок.Раздел7_5_1.Графа8 + СтруктураСтрок.Раздел7_6_1.Графа8 + СтруктураСтрок.Раздел7_7_1.Графа8 + СтруктураСтрок.Раздел7_8_1.Графа8 + СтруктураСтрок.Раздел7_9_1.Графа8;
					ЗначениеГраф = ЗначениеГрафа3 + ЗначениеГрафа4 + ЗначениеГрафа7 + ЗначениеГрафа8;
					
					Если ЗначениеГраф < СтруктураЗначение.Раздел2_1_1_1 + СтруктураЗначение.Раздел2_1_2_1 Тогда						
						
						ОписаниеУсловия= "Сумма значений по строкам 1.1, 2.1, 3.1, 4.1, 5.1, 6.1, 7.1, 8.1 и 9.1 в графах 3, 4, 7, 8 Раздела VII, должна быть больше или равна сумме значений по строкам 1.1.1 и (или) 1.2.1 Раздела II";
						ОписаниеОшибки = "";
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.154");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					//ОбластьСтрокаКС.Параметры.Код_05_03_04_153 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_154 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					
					// Раздел 8
					
					// 05.03.04.167 Если в графах 7 или 8 строки 1.1 указано значение, отличное от нуля, то и в соответствующей графе строки 1.1 Раздела VII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 198;
					
					Если (СтруктураСтрок.Раздел8_1_1.Графа7 <> 0 И СтруктураСтрок.Раздел7_1_1.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел8_1_1.Графа8  И СтруктураСтрок.Раздел7_1_1.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 1.1 указано значение, отличное от нуля, то и в соответствующей графе строки 1.1 Раздела VII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 8 Строка 1.1 графа 7 = " + Строка(СтруктураСтрок.Раздел8_1_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_1_1.Графа8) +"; Раздел 7 строка 1.1 графа 7 = " + Строка(СтруктураСтрок.Раздел7_1_1.Графа7) +"; строка 1.1 графа 8 = " + Строка(СтруктураСтрок.Раздел7_1_1.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.167");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_167 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_167 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.168 Если в графах 7 или 8 строки 1.2 указано значение, отличное от нуля, то и в соответствующей графе строки 1.2 Раздела VII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 199;
					
					Если (СтруктураСтрок.Раздел8_1_2.Графа7 <> 0 И СтруктураСтрок.Раздел7_1_2.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел8_1_2.Графа8  И СтруктураСтрок.Раздел7_1_2.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 1.2 указано значение, отличное от нуля, то и в соответствующей графе строки 1.2 Раздела VII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 8 Строка 1.2 графа 7 = " + Строка(СтруктураСтрок.Раздел8_1_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_1_2.Графа8) +"; Раздел 7 строка 1.2 графа 7 = " + Строка(СтруктураСтрок.Раздел7_1_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_1_2.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.168");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_168 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_168 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.169 Если в какой-либо графе строки 2.1 указано значение, отличное от нуля, то и в соответствующей графе строки 2.1 Раздела VII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 200;
					
					Если (СтруктураСтрок.Раздел8_2_1.Графа7 <> 0 И СтруктураСтрок.Раздел7_2_1.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел8_2_1.Графа8  И СтруктураСтрок.Раздел7_2_1.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 2.1 указано значение, отличное от нуля, то и в соответствующей графе строки 2.1 Раздела VII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 8 Строка 2.1 графа 7 = " + Строка(СтруктураСтрок.Раздел8_2_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_2_1.Графа8) +"; Раздел 7 строка 2.1 графа 7 = " + Строка(СтруктураСтрок.Раздел7_2_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_2_1.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.169");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_169 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_169 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.170 Если в какой-либо графе строки 2.2 указано значение, отличное от нуля, то и в соответствующей графе строки 2.2 Раздела VII должно быть указано значение, отличное от нуля.
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 201;
					
					Если (СтруктураСтрок.Раздел8_2_2.Графа7 <> 0 И СтруктураСтрок.Раздел7_2_2.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел8_2_2.Графа8  И СтруктураСтрок.Раздел7_2_2.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 2.2 указано значение, отличное от нуля, то и в соответствующей графе строки 2.2 Раздела VII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 8 Строка 2.2 графа 7 = " + Строка(СтруктураСтрок.Раздел8_2_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_2_2.Графа8) +"; Раздел 7 строка 2.2 графа 7 = " + Строка(СтруктураСтрок.Раздел7_2_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_2_2.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.170");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_170 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_170 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.171 Если в какой-либо графе строки 3.1 указано значение, отличное от нуля, то и в соответствующей графе строки 3.1 Раздела VII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 202;
					
					Если (СтруктураСтрок.Раздел8_3_1.Графа7 <> 0 И СтруктураСтрок.Раздел7_3_1.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел8_3_1.Графа8  И СтруктураСтрок.Раздел7_3_1.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 3.1 указано значение, отличное от нуля, то и в соответствующей графе строки 3.1 Раздела VII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 8 Строка 3.1 графа 7 = " + Строка(СтруктураСтрок.Раздел8_3_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_3_1.Графа8) +"; Раздел 7 строка 3.1 графа 7 = " + Строка(СтруктураСтрок.Раздел7_3_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_3_1.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.171");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_171 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_171 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.172 Если в какой-либо графе строки 3.2 указано значение, отличное от нуля, то и в соответствующей графе строки 3.2 Раздела VII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 203;
					
					Если (СтруктураСтрок.Раздел8_3_2.Графа7 <> 0 И СтруктураСтрок.Раздел7_3_2.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел8_3_2.Графа8  И СтруктураСтрок.Раздел7_3_2.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 3.2 указано значение, отличное от нуля, то и в соответствующей графе строки 3.2 Раздела VII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 8 Строка 3.2 графа 7 = " + Строка(СтруктураСтрок.Раздел8_3_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_3_2.Графа8) +"; Раздел 7 строка 3.2 графа 7 = " + Строка(СтруктураСтрок.Раздел7_3_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_3_2.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.172");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_172 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_172 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.173 Если в какой-либо графе строки 4.1 указано значение, отличное от нуля, то и в соответствующей графе строки 4.1 Раздела VII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 204;
					
					Если (СтруктураСтрок.Раздел8_4_1.Графа7 <> 0 И СтруктураСтрок.Раздел7_4_1.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел8_4_1.Графа8  И СтруктураСтрок.Раздел7_4_1.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 4.1 указано значение, отличное от нуля, то и в соответствующей графе строки 4.1 Раздела VII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 8 Строка 4.1 графа 7 = " + Строка(СтруктураСтрок.Раздел8_4_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_4_1.Графа8) +"; Раздел 7 строка 4.1 графа 7 = " + Строка(СтруктураСтрок.Раздел7_4_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_4_1.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.173");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_173 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_173 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.174 Если в какой-либо графе строки 4.2 указано значение, отличное от нуля, то и в соответствующей графе строки 4.2 Раздела VII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 205;
					
					Если (СтруктураСтрок.Раздел8_4_2.Графа7 <> 0 И СтруктураСтрок.Раздел7_4_2.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел8_4_2.Графа8  И СтруктураСтрок.Раздел7_4_2.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 4.2 указано значение, отличное от нуля, то и в соответствующей графе строки 4.2 Раздела VII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 8 Строка 4.2 графа 7 = " + Строка(СтруктураСтрок.Раздел8_4_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_4_2.Графа8) +"; Раздел 7 строка 4.2 графа 7 = " + Строка(СтруктураСтрок.Раздел7_4_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_4_2.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.174");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_174 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_174 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.175 Если в какой-либо графе строки 5.1 указано значение, отличное от нуля, то и в соответствующей графе строки 5.1 Раздела VII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 206;
					
					Если (СтруктураСтрок.Раздел8_5_1.Графа7 <> 0 И СтруктураСтрок.Раздел7_5_1.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел8_5_1.Графа8  И СтруктураСтрок.Раздел7_5_1.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 5.1 указано значение, отличное от нуля, то и в соответствующей графе строки 5.1 Раздела VII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 8 Строка 5.1 графа 7 = " + Строка(СтруктураСтрок.Раздел8_5_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_5_1.Графа8) +"; Раздел 7 строка 5.1 графа 7 = " + Строка(СтруктураСтрок.Раздел7_5_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_5_1.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.175");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_175 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_175 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.176 Если в какой-либо графе строки 5.2 указано значение, отличное от нуля, то и в соответствующей графе строки 5.2 Раздела VII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 207;
					
					Если (СтруктураСтрок.Раздел8_5_2.Графа7 <> 0 И СтруктураСтрок.Раздел7_5_2.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел8_5_2.Графа8  И СтруктураСтрок.Раздел7_5_2.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 5.2 указано значение, отличное от нуля, то и в соответствующей графе строки 5.2 Раздела VII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 8 Строка 5.2 графа 7 = " + Строка(СтруктураСтрок.Раздел8_5_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_5_2.Графа8) +"; Раздел 7 строка 5.2 графа 7 = " + Строка(СтруктураСтрок.Раздел7_5_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_5_2.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.176");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_176 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_176 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.177 Если в какой-либо графе строки 6.1 указано значение, отличное от нуля, то и в соответствующей графе строки 6.1 Раздела VII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 208;
					
					Если (СтруктураСтрок.Раздел8_6_1.Графа7 <> 0 И СтруктураСтрок.Раздел7_6_1.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел8_6_1.Графа8  И СтруктураСтрок.Раздел7_6_1.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 6.1 указано значение, отличное от нуля, то и в соответствующей графе строки 6.1 Раздела VII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 8 Строка 6.1 графа 7 = " + Строка(СтруктураСтрок.Раздел8_6_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_6_1.Графа8) +"; Раздел 7 строка 6.1 графа 7 = " + Строка(СтруктураСтрок.Раздел7_6_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_6_1.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.177");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_177 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_177 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.178 Если в какой-либо графе строки 6.2 указано значение, отличное от нуля, то и в соответствующей графе строки 6.2 Раздела VII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 209;
					
					Если (СтруктураСтрок.Раздел8_6_2.Графа7 <> 0 И СтруктураСтрок.Раздел7_6_2.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел8_6_2.Графа8  И СтруктураСтрок.Раздел7_6_2.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 6.2 указано значение, отличное от нуля, то и в соответствующей графе строки 6.2 Раздела VII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 8 Строка 6.2 графа 7 = " + Строка(СтруктураСтрок.Раздел8_6_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_6_2.Графа8) +"; Раздел 7 строка 6.2 графа 7 = " + Строка(СтруктураСтрок.Раздел7_6_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_6_2.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.178");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_178 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_178 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.179 Если в какой-либо графе строки 7.1 указано значение, отличное от нуля, то и в соответствующей графе строки 7.1 Раздела VII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 210;
					
					Если (СтруктураСтрок.Раздел8_7_1.Графа7 <> 0 И СтруктураСтрок.Раздел7_7_1.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел8_7_1.Графа8  И СтруктураСтрок.Раздел7_7_1.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 7.1 указано значение, отличное от нуля, то и в соответствующей графе строки 7.1 Раздела VII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 8 Строка 7.1 графа 7 = " + Строка(СтруктураСтрок.Раздел8_7_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_7_1.Графа8) +"; Раздел 7 строка 7.1 графа 7 = " + Строка(СтруктураСтрок.Раздел7_7_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_7_1.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.179");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_179 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_179 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.180 Если в какой-либо графе строки 7.2 указано значение, отличное от нуля, то и в соответствующей графе строки 7.2 Раздела VII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 211;
					
					Если (СтруктураСтрок.Раздел8_7_2.Графа7 <> 0 И СтруктураСтрок.Раздел7_7_2.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел8_7_2.Графа8  И СтруктураСтрок.Раздел7_7_2.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 7.2 указано значение, отличное от нуля, то и в соответствующей графе строки 7.2 Раздела VII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 8 Строка 7.2 графа 7 = " + Строка(СтруктураСтрок.Раздел8_7_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_7_2.Графа8) +"; Раздел 7 строка 7.2 графа 7 = " + Строка(СтруктураСтрок.Раздел7_7_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_7_2.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.180");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_180 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_180 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.181 Если в какой-либо графе строки 8.1 указано значение, отличное от нуля, то и в соответствующей графе строки 8.1 Раздела VII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 212;
					
					Если (СтруктураСтрок.Раздел8_8_1.Графа7 <> 0 И СтруктураСтрок.Раздел7_8_1.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел8_8_1.Графа8  И СтруктураСтрок.Раздел7_8_1.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 8.1 указано значение, отличное от нуля, то и в соответствующей графе строки 8.1 Раздела VII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 8 Строка 8.1 графа 7 = " + Строка(СтруктураСтрок.Раздел8_8_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_8_1.Графа8) +"; Раздел 7 строка 8.1 графа 7 = " + Строка(СтруктураСтрок.Раздел7_8_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_8_1.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.181");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_181 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_181 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.182 Если в какой-либо графе строки 8.2 указано значение, отличное от нуля, то и в соответствующей графе строки 8.2 Раздела VII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 213;
					
					Если (СтруктураСтрок.Раздел8_8_2.Графа7 <> 0 И СтруктураСтрок.Раздел7_8_2.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел8_8_2.Графа8  И СтруктураСтрок.Раздел7_8_2.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 8.2 указано значение, отличное от нуля, то и в соответствующей графе строки 8.2 Раздела VII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 8 Строка 8.2 графа 7 = " + Строка(СтруктураСтрок.Раздел8_8_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_8_2.Графа8) +"; Раздел 7 строка 8.2 графа 7 = " + Строка(СтруктураСтрок.Раздел7_8_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_8_2.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.182");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_182 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_182 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.183 Если в какой-либо графе строки 9.1 указано значение, отличное от нуля, то и в соответствующей графе строки 9.1 Раздела VII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 214;
					
					Если (СтруктураСтрок.Раздел8_9_1.Графа7 <> 0 И СтруктураСтрок.Раздел7_9_1.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел8_9_1.Графа8  И СтруктураСтрок.Раздел7_9_1.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 9.1 указано значение, отличное от нуля, то и в соответствующей графе строки 9.1 Раздела VII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 8 Строка 9.1 графа 7 = " + Строка(СтруктураСтрок.Раздел8_9_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_9_1.Графа8) +"; Раздел 7 строка 9.1 графа 7 = " + Строка(СтруктураСтрок.Раздел7_9_1.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_9_1.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.183");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_183 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_183 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.184 Если в какой-либо графе строки 9.2 указано значение, отличное от нуля, то и в соответствующей графе строки 9.2 Раздела VII должно быть указано значение, отличное от нуля.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					Ошибка = 0;
					НомерКолонки = 215;
					
					Если (СтруктураСтрок.Раздел8_9_2.Графа7 <> 0 И СтруктураСтрок.Раздел7_9_2.Графа7 = 0)
						ИЛИ (СтруктураСтрок.Раздел8_9_2.Графа8  И СтруктураСтрок.Раздел7_9_2.Графа8 = 0) Тогда						
						
						ОписаниеУсловия= "Если в графах 7 или 8 строки 9.2 указано значение, отличное от нуля, то и в соответствующей графе строки 9.2 Раздела VII должно быть указано значение, отличное от нуля.";
						ОписаниеОшибки = "Раздел 8 Строка 9.2 графа 7 = " + Строка(СтруктураСтрок.Раздел8_9_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел8_9_2.Графа8) +"; Раздел 7 строка 9.2 графа 7 = " + Строка(СтруктураСтрок.Раздел7_9_2.Графа7) +"; графа 8 = " + Строка(СтруктураСтрок.Раздел7_9_2.Графа8);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.184");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_184 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_184 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// Проверка значений Раздела IX. "Данные о размещении средств резервных фондов"
					
					// 05.03.04.185 Значение, указанное в графе 3 строки 2, должно быть равно сумме значений, указанных в графе 3 строк 2.1 – 2.n.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					Ошибка = 0;
					НомерКолонки = 217;
					
					СуммаПодстрок2 = 0;
					Если СтруктураСтрок9.Свойство("Строка2_1") Тогда
						СуммаПодстрок2 = СуммаПодстрок2 + СтруктураСтрок9.Строка2_1.СуммаРазмещаемыхСредств;
					КонецЕсли;
					
					Если СтруктураСтрок9.Свойство("Строка2_2") Тогда
						СуммаПодстрок2 = СуммаПодстрок2 + СтруктураСтрок9.Строка2_2.СуммаРазмещаемыхСредств;
					КонецЕсли;
					
					Если СтруктураСтрок9.Свойство("Строка2_3") Тогда
						СуммаПодстрок2 = СуммаПодстрок2 + СтруктураСтрок9.Строка2_3.СуммаРазмещаемыхСредств;
					КонецЕсли; 					
					
					Если СтруктураСтрок9.Строка2.СуммаРазмещаемыхСредств <> СуммаПодстрок2 Тогда
						ОписаниеУсловия= "Значение, указанное в графе 3 строки 2, должно быть равно сумме значений, указанных в графе 3 строк 2.1 – 2.n.";
						ОписаниеОшибки = "Строка 2 графа 3 = " + Строка(СтруктураСтрок9.Строка2.СуммаРазмещаемыхСредств) +"; Сумма строк 2.1 - 2.n графа 3 = " + Строка(СуммаПодстрок2);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.185");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_185 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_185 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.186 Значение, указанное в графе 3 строки 3, должно быть равно сумме значений, указанных в графе 3 строк 3.1 – 3.n.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					СуммаПодстрок3 = 0;
					НомерКолонки = 218;
					
					Если СтруктураСтрок9.Свойство("Строка3_1") Тогда
						СуммаПодстрок3 = СуммаПодстрок3 + СтруктураСтрок9.Строка3_1.СуммаРазмещаемыхСредств;
					КонецЕсли;
					
					Если СтруктураСтрок9.Свойство("Строка3_2") Тогда
						СуммаПодстрок3 = СуммаПодстрок3 + СтруктураСтрок9.Строка3_2.СуммаРазмещаемыхСредств;
					КонецЕсли;
					
					Если СтруктураСтрок9.Свойство("Строка3_3") Тогда
						СуммаПодстрок3 = СуммаПодстрок3 + СтруктураСтрок9.Строка3_3.СуммаРазмещаемыхСредств;
					КонецЕсли; 					
					
					Если СтруктураСтрок9.Строка3.СуммаРазмещаемыхСредств <> СуммаПодстрок3 Тогда
						ОписаниеУсловия= "Значение, указанное в графе 3 строки 3, должно быть равно сумме значений, указанных в графе 3 строк 3.1 – 3.n.";
						ОписаниеОшибки = "Строка 3 графа 3 = " + Строка(СтруктураСтрок9.Строка3.СуммаРазмещаемыхСредств) +"; Сумма строк 3.1 - 3.n графа 3 = " + Строка(СуммаПодстрок3);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.186");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_186 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_186 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// 05.03.04.187 Значение, указанное в графе 3 строки 4, должно быть больше или равно значению, указанному в графе 3 строки 4.1.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					
					НомерКолонки = 219; 				
					
					Если СтруктураСтрок9.Строка4.СуммаРазмещаемыхСредств < СтруктураСтрок9.Строка4_1.СуммаРазмещаемыхСредств Тогда
						ОписаниеУсловия= "Значение, указанное в графе 3 строки 4, должно быть больше или равно значению, указанному в графе 3 строки 4.1";
						ОписаниеОшибки = "Строка 4 графа 3 = " + Строка(СтруктураСтрок9.Строка4.СуммаРазмещаемыхСредств) +"; Строка 4.1 графа 3 = " + Строка(СтруктураСтрок9.Строка4_1.СуммаРазмещаемыхСредств);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.187");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_187 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_187 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// Раздел X Информация о  договорах, одобренных общим  собранием  кредитного потребительского  кооператива до их заключения, не включаемых в расчет финансовых нормативов
					
					
					// 05.03.04.188 В графе 5 раздела X значение одной из строк 1.1 - 1.n, где n - порядковый номер строки, в которой указан договор, одобренный общим собранием кредитного потребительского кооператива до его заключения, не включаемый в расчет финансовых нормативов, отлично от нуля, при этом в строке 21 раздела IV указано нулевое значение
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					Ошибка = 0;
					НомерКолонки = 221;
					
					СуммаПодстрок1 = 0;
					Если СтруктураСтрок10.Свойство("Строка1_1") Тогда
						СуммаПодстрок1 = СуммаПодстрок1 + СтруктураСтрок10.Строка1_1.РазмерОбязательствНаКонецОтчетногоПериода;
					КонецЕсли;
					
					Если СтруктураСтрок10.Свойство("Строка1_2") Тогда
						СуммаПодстрок1 = СуммаПодстрок1 + СтруктураСтрок10.Строка1_2.РазмерОбязательствНаКонецОтчетногоПериода;
					КонецЕсли;
					
					Если СтруктураСтрок10.Свойство("Строка1_3") Тогда
						СуммаПодстрок1 = СуммаПодстрок1 + СтруктураСтрок10.Строка1_3.РазмерОбязательствНаКонецОтчетногоПериода;
					КонецЕсли;
					
					
					Если  СуммаПодстрок1 <> 0 И СтруктураЗначение.Раздел4_21 = 0 Тогда
						ОписаниеУсловия= "В графе 5 раздела X значение одной из строк 1.1 - 1.n, где n - порядковый номер строки, в которой указан договор, одобренный общим собранием кредитного потребительского кооператива до его заключения, не включаемый в расчет финансовых нормативов, отлично от нуля, при этом в строке 21 раздела IV указано нулевое значение";
						ОписаниеОшибки = "Сумма строк 1.1 - 1.n графа 5 = " + Строка(СуммаПодстрок1) +"; Строка 21 Раздел 4 = " + Строка(СтруктураЗначение.Раздел4_21);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.188");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_188 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_188 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// 05.03.04.189 В графе 5 раздела X значение хотя бы одной из строк 2.1 - 2.n, где n - порядковый номер строки, в которой указан договор, одобренный общим собранием кредитного потребительского кооператива до его заключения, не включаемый в расчет финансовых нормативов, отлично от нуля, при этом в строке 27 раздела IV указано нулевое значение.
					
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";
					Ошибка = 0;
					НомерКолонки = 222;
					
					СуммаПодстрок2 = 0;
					Если СтруктураСтрок10.Свойство("Строка2_1") Тогда
						СуммаПодстрок2 = СуммаПодстрок2 + СтруктураСтрок10.Строка2_1.РазмерОбязательствНаКонецОтчетногоПериода;
					КонецЕсли;
					
					Если СтруктураСтрок10.Свойство("Строка2_2") Тогда
						СуммаПодстрок2 = СуммаПодстрок2 + СтруктураСтрок10.Строка2_2.РазмерОбязательствНаКонецОтчетногоПериода;
					КонецЕсли;
					
					Если СтруктураСтрок10.Свойство("Строка2_3") Тогда
						СуммаПодстрок2 = СуммаПодстрок2 + СтруктураСтрок10.Строка2_3.РазмерОбязательствНаКонецОтчетногоПериода;
					КонецЕсли;
					
					
					Если  СуммаПодстрок2 <> 0 И СтруктураЗначение.Раздел4_27 = 0 Тогда
						ОписаниеУсловия= "В графе 5 раздела X значение хотя бы одной из строк 2.1 - 2.n, где n - порядковый номер строки, в которой указан договор, одобренный общим собранием кредитного потребительского кооператива до его заключения, не включаемый в расчет финансовых нормативов, отлично от нуля, при этом в строке 27 раздела IV указано нулевое значение.";
						ОписаниеОшибки = "Сумма строк 2.1 - 2.n графа 5 = " + Строка(СуммаПодстрок2) +"; Строка 27 Раздел 4 = " + Строка(СтруктураЗначение.Раздел4_27);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.189");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_189 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_189 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					
					// Новые контроли (предложения ДМР - декабрь 2018 года)
					// 05.03.04.200
					
					НомерКолонки = 223;
					
					
					ОписаниеОшибки = "";
					
					ДокументОтчетности = Выборка.ДокументОтчетности;
					КПКИНН = ДокументОтчетности.КПКИНН;
					СРОИНН = ДокументОтчетности.СРОИНН;
					КПК2УровняИНН = ДокументОтчетности.КПК2УровняИНН;   
					РейтинговоеАгенство_ИНН = ДокументОтчетности.РейтинговоеАгенство_ИНН;
					
					КПКОРГН = ДокументОтчетности.КПКОРГН;
					СРООГРН = ДокументОтчетности.СРООГРН;
					КПК2УровняОГРН = ДокументОтчетности.КПК2УровняОГРН;
					РейтинговоеАгенство_ОГРН = ДокументОтчетности.РейтинговоеАгенство_ОГРН;
					
					ОписаниеУсловия = "";
					//ОписаниеУсловия = "Значение, указанное в строке 3 раздела I, не должно быть равно значению, указанному в строке 23 подраздела 3 раздела I, или ";
					//ОписаниеУсловия = ОписаниеУсловия + "значение, указанное в строке 3 раздела I, не должно быть равно значению, указанному в строке 28 раздела I, или "; 	
					//ОписаниеУсловия = ОписаниеУсловия + "значение, указанное в строке 3 раздела I, не должно быть равно значению, указанному в строке 41 раздела I, или ";
					//ОписаниеУсловия = ОписаниеУсловия + "значение, указанное в строке 4 раздела I, не должно быть равно значению, указанному в строке 24 раздела I, или "; 
					//ОписаниеУсловия = ОписаниеУсловия + "значение, указанное в строке 4 раздела I, не должно быть равно значению, указанному в строке 29 раздела I, или ";
					//ОписаниеУсловия = ОписаниеУсловия + "значение, указанное в строке 4 раздела I, не должно быть равно значению, указанному в строке 42 раздела I, или ";
					//ОписаниеУсловия = ОписаниеУсловия + "значение, указанное в строке 23 подраздела 3 раздела I, не должно быть равно значению, указанному в строке 28 раздела I, или ";
					//ОписаниеУсловия = ОписаниеУсловия + "значение, указанное в строке 23 подраздела 3 раздела I, не должно быть равно значению, указанному в строке 41 раздела I, или ";
					//ОписаниеУсловия = ОписаниеУсловия + "значение, указанное в строке 24 раздела I, не должно быть равно значению, указанному в строке 29 раздела I, или ";
					//ОписаниеУсловия = ОписаниеУсловия + "значение, указанное в строке 24 раздела I, не должно быть равно значению, указанному в строке 42 раздела I, или ";
					//ОписаниеУсловия = ОписаниеУсловия + "значение, указанное в строке 28 раздела I, не должно быть равно значению, указанному в строке 41 раздела I, или ";
					//ОписаниеУсловия = ОписаниеУсловия + "значение, указанное в строке 29 раздела I, не должно быть равно значению, указанному в строке 42 раздела I";
					
					Если КПКИНН = СРОИНН И КПКИНН <> "-" Тогда
						ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "ИНН КПК " + Строка(КПКИНН) +"; СРО ИНН " + Строка(СРОИНН);
					КонецЕсли; 					
					
					Если КПКИНН = КПК2УровняИНН И КПКИНН <> "-" Тогда
						ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "ИНН КПК " + Строка(КПКИНН) +"; КПК 2 уровня ИНН " + Строка(КПК2УровняИНН);
					КонецЕсли;
					
					Если КПКИНН = РейтинговоеАгенство_ИНН И КПКИНН <> "-" Тогда
						ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "ИНН КПК " + Строка(КПКИНН) +"; Рейтинговое агенство ИНН " + Строка(РейтинговоеАгенство_ИНН);
					КонецЕсли;
					
					Если КПКОРГН = СРООГРН И КПКОРГН <> "-" Тогда
						ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "КПК ОГРН" + Строка(КПКОРГН) +"; СРО ОГРН " + Строка(СРООГРН);
					КонецЕсли;
					
					Если КПКОРГН = КПК2УровняОГРН И КПКОРГН <> "-" Тогда
						ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "КПК ОГРН" + Строка(КПКОРГН) +"; КПК 2 уровня ОГРН " + Строка(КПК2УровняОГРН);
					КонецЕсли;
					
					Если КПКОРГН =  РейтинговоеАгенство_ОГРН И КПКОРГН <> "-" Тогда
						ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "КПК ОГРН" + Строка(КПКОРГН) +"; Рейтинговое агенство ОГРН " + Строка(РейтинговоеАгенство_ОГРН);
					КонецЕсли;
					
					Если СРОИНН = КПК2УровняИНН И СРОИНН <> "-" Тогда
						ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "СРО ИНН" + Строка(СРОИНН) +"; КПК 2 уровня ИНН " + Строка(КПК2УровняИНН);
					КонецЕсли; 
					
					Если СРОИНН = РейтинговоеАгенство_ИНН И СРОИНН <> "-" Тогда
						ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "СРО ИНН" + Строка(СРОИНН) +"; Рейтинговое агенство ИНН " + Строка(РейтинговоеАгенство_ИНН);
					КонецЕсли;
					
					Если СРООГРН = КПК2УровняОГРН И СРООГРН <> "-" Тогда
						ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "СРО ОГРН" + Строка(СРООГРН) +"; КПК 2 уровня ОГРН " + Строка(КПК2УровняОГРН);
					КонецЕсли;
					
					Если СРООГРН = РейтинговоеАгенство_ОГРН И СРООГРН <> "-" Тогда
						ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "СРО ОГРН" + Строка(СРООГРН) +"; Рейтинговое агенство ОГРН " + Строка(РейтинговоеАгенство_ОГРН);
					КонецЕсли;
					
					Если КПК2УровняИНН = РейтинговоеАгенство_ИНН  И КПК2УровняИНН <> "-" Тогда
						ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "КПК 2 уровня ИНН" + Строка(КПК2УровняИНН) +"; Рейтинговое агенство ИНН " + Строка(РейтинговоеАгенство_ИНН);
					КонецЕсли;
					
					Если КПК2УровняОГРН = РейтинговоеАгенство_ОГРН И КПК2УровняОГРН <> "-" Тогда
						ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "КПК 2 уровня ОГРН" + Строка(КПК2УровняОГРН) +"; Рейтинговое агенство ОГРН " + Строка(РейтинговоеАгенство_ОГРН);
					КонецЕсли;
					
					
					
					Если  ОписаниеОшибки <> "" Тогда
						//ОписаниеУсловия= "В графе 5 раздела X значение хотя бы одной из строк 2.1 - 2.n, где n - порядковый номер строки, в которой указан договор, одобренный общим собранием кредитного потребительского кооператива до его заключения, не включаемый в расчет финансовых нормативов, отлично от нуля, при этом в строке 27 раздела IV указано нулевое значение.";
						//ОписаниеОшибки = "Сумма строк 2.1 - 2.n графа 5 = " + Строка(СуммаПодстрок2) +"; Строка 27 Раздел 4 = " + Строка(СтруктураЗначение.Раздел4_27);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.200");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						Ошибка = 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли; 				
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_200 = Ошибка;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_200 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
					
					// Новые контроли (предложения ДОО - январь 2019 года)
					
					// 05.03.04.201 Значение, указанное в строке 1.8.1, должно быть больше или равно сумме значений, указанных в строках 1.8.1.1, 1.8.1.2, 1.8.1.3 и 1.8.1.4;
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  	
					НомерКолонки = 224;
					
					Значение = СтруктураЗначение.Раздел2_1_8_1_1 + СтруктураЗначение.Раздел2_1_8_1_2 + СтруктураЗначение.Раздел2_1_8_1_3 + СтруктураЗначение.Раздел2_1_8_1_4;
					
					Если СтруктураЗначение.Раздел2_1_8_1 < Значение Тогда
						ОписаниеУсловия= "Значение, указанное в строке 1.8.1, должно быть больше или равно сумме значений, указанных в строках 1.8.1.1, 1.8.1.2, 1.8.1.3 и 1.8.1.4";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_1_8_1) +" < " + Строка(Значение);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.201");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_201 = СтруктураЗначение.Раздел2_1_8_1 - Значение;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_201 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					
					// 05.03.04.202 Значение, указанное в строке 1.8.2, должно быть больше или равно сумме значений, указанных в строках 1.8.2.1, 1.8.2.2, 1.8.2.3 и 1.8.2.4
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  	
					НомерКолонки = 225;
					
					Значение = СтруктураЗначение.Раздел2_1_8_2_1 + СтруктураЗначение.Раздел2_1_8_2_2 + СтруктураЗначение.Раздел2_1_8_2_3 + СтруктураЗначение.Раздел2_1_8_2_4;
					
					Если СтруктураЗначение.Раздел2_1_8_2 < Значение Тогда
						ОписаниеУсловия= "Значение, указанное в строке 1.8.2, должно быть больше или равно сумме значений, указанных в строках 1.8.2.1, 1.8.2.2, 1.8.2.3 и 1.8.2.4";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_1_8_2) +" < " + Строка(Значение);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.202");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_202 = СтруктураЗначение.Раздел2_1_8_2 - Значение;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_202 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.203 Значение, указанное в строке 2.1.3, должно быть равно сумме значений, указанных в строках 2.1.3.1 и 2.1.3.2;
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  	
					НомерКолонки = 226;
					
					Значение = СтруктураЗначение.Раздел2_2_1_3_1 + СтруктураЗначение.Раздел2_2_1_3_2;
					
					Если СтруктураЗначение.Раздел2_2_1_3 <> Значение Тогда
						ОписаниеУсловия= "Значение, указанное в строке 2.1.3, должно быть равно сумме значений, указанных в строках 2.1.3.1 и 2.1.3.2;";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_2_1_3) +" <> " + Строка(Значение);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.203");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_203 = СтруктураЗначение.Раздел2_2_1_3 - Значение;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_203 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.204 Значение, указанное в строке 3, должно быть равно сумме значений, указанных в строках 3.1, 3.2, 3.3 и 3.4;
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  	
					НомерКолонки = 227;
					
					Значение = СтруктураЗначение.Раздел2_3_1 + СтруктураЗначение.Раздел2_3_2 + СтруктураЗначение.Раздел2_3_3 + СтруктураЗначение.Раздел2_3_4;
					
					Если СтруктураЗначение.Раздел2_3 <> Значение Тогда
						ОписаниеУсловия= "Значение, указанное в строке 3, должно быть равно сумме значений, указанных в строках 3.1, 3.2, 3.3 и 3.4;";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3) +" <> " + Строка(Значение);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.204");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_204 = СтруктураЗначение.Раздел2_2_1_3 - Значение;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_204 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.205 Значение, указанное в строке 3.1.4, должно быть больше или равно значению, указанному в строке 3.1.4.1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  	
					НомерКолонки = 228;
					
					
					Если СтруктураЗначение.Раздел2_3_1_4 < СтруктураЗначение.Раздел2_3_1_4_1 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 3.1.4, должно быть больше или равно значению, указанному в строке 3.1.4.1";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_1_4) +" < " + Строка(СтруктураЗначение.Раздел2_3_1_4_1);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.205");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_205 = СтруктураЗначение.Раздел2_3_1_4 - СтруктураЗначение.Раздел2_3_1_4_1;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_205 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					
					// 05.03.04.206 Значение, указанное в строке 3.1.7, должно быть равно сумме значений, указанных в строках 3.1.7.1, 3.1.7.2 и 3.1.7.3
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  	
					НомерКолонки = 229;
					
					Значение = СтруктураЗначение.Раздел2_3_1_7_1 + СтруктураЗначение.Раздел2_3_1_7_2 + СтруктураЗначение.Раздел2_3_1_7_3;
					
					Если СтруктураЗначение.Раздел2_3_1_7 <> Значение Тогда
						ОписаниеУсловия= "Значение, указанное в строке 3.1.7, должно быть равно сумме значений, указанных в строках 3.1.7.1, 3.1.7.2 и 3.1.7.3";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_1_7) +" <> " + Строка(Значение);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.206");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_206 = СтруктураЗначение.Раздел2_3_1_7 - Значение;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_206 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.207 Значение, указанное в строке 3.1.8, должно быть равно сумме значений, указанных в строках 3.1.8.1, 3.1.8.2 и 3.1.8.3;
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  	
					НомерКолонки = 230;
					
					Значение = СтруктураЗначение.Раздел2_3_1_8_1 + СтруктураЗначение.Раздел2_3_1_8_2 + СтруктураЗначение.Раздел2_3_1_8_3;
					
					Если СтруктураЗначение.Раздел2_3_1_8 <> Значение Тогда
						ОписаниеУсловия= "Значение, указанное в строке 3.1.8, должно быть равно сумме значений, указанных в строках 3.1.8.1, 3.1.8.2 и 3.1.8.3;";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_1_8) +" <> " + Строка(Значение);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.207");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_207 = СтруктураЗначение.Раздел2_3_1_8 - Значение;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_207 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.208 Значение, указанное в строке 3.2.4, должно быть больше или равно значению, указанному в строке 3.2.4.1
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  	
					НомерКолонки = 231;
					
					
					Если СтруктураЗначение.Раздел2_3_2_4 < СтруктураЗначение.Раздел2_3_2_4_1 Тогда
						ОписаниеУсловия= "Значение, указанное в строке 3.2.4, должно быть больше или равно значению, указанному в строке 3.2.4.1";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_2_4) +" < " + Строка(СтруктураЗначение.Раздел2_3_2_4_1);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.208");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_208 = СтруктураЗначение.Раздел2_3_2_4 - СтруктураЗначение.Раздел2_3_2_4_1;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_208 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					
					// 05.03.04.209 Значение, указанное в строке 3.2.7, должно быть равно сумме значений, указанных в строках 3.2.7.1, 3.2.7.2 и 3.2.7.3
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  	
					НомерКолонки = 232;
					
					Значение = СтруктураЗначение.Раздел2_3_2_7_1 + СтруктураЗначение.Раздел2_3_2_7_2 + СтруктураЗначение.Раздел2_3_2_7_3;
					
					Если СтруктураЗначение.Раздел2_3_2_7 <> Значение Тогда
						ОписаниеУсловия= "Значение, указанное в строке 3.2.7, должно быть равно сумме значений, указанных в строках 3.2.7.1, 3.2.7.2 и 3.2.7.3";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_2_7) +" <> " + Строка(Значение);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.209");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_209 = СтруктураЗначение.Раздел2_3_2_7 - Значение;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_209 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.210 Значение, указанное в строке 3.2.8, должно быть равно сумме значений, указанных в строках 3.2.8.1, 3.2.8.2 и 3.2.8.3
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  	
					НомерКолонки = 233;
					
					Значение = СтруктураЗначение.Раздел2_3_2_8_1 + СтруктураЗначение.Раздел2_3_2_8_2 + СтруктураЗначение.Раздел2_3_2_8_3;
					
					Если СтруктураЗначение.Раздел2_3_2_8 <> Значение Тогда
						ОписаниеУсловия= "Значение, указанное в строке 3.2.8, должно быть равно сумме значений, указанных в строках 3.2.8.1, 3.2.8.2 и 3.2.8.3";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел2_3_2_8) +" <> " + Строка(Значение);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.210");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_210 = СтруктураЗначение.Раздел2_3_2_8 - Значение;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_210 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					// 05.03.04.211 Значение, указанное в строке 40, должно быть равно сумме значений, указанных в строках 40.1 - 40.3
					ОписаниеУсловия = "";
					ОписаниеОшибки = "";  	
					НомерКолонки = 234;
					
					Значение = СтруктураЗначение.Раздел4_40_1 + СтруктураЗначение.Раздел4_40_2 + СтруктураЗначение.Раздел4_40_3;
					
					Если СтруктураЗначение.Раздел4_40 <> Значение Тогда
						ОписаниеУсловия= "Значение, указанное в строке 40, должно быть равно сумме значений, указанных в строках 40.1 - 40.3";
						ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_40) +" <> " + Строка(Значение);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "05.03.04.211");   
						ИтогоОшибокКС = ИтогоОшибокКС + 1;
						
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
					Иначе
						ОбластьСтрокаКС.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
					КонецЕсли;
					
					ОбластьСтрокаКС.Параметры.Код_05_03_04_211 = СтруктураЗначение.Раздел4_40 - Значение;
					ОбластьСтрокаКС.Параметры.Проверка_Код_05_03_04_211 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
					
					//+ВА
					
					Если НЕ НеВыводим_ОКУД0420820 Тогда
						
						// Для 1 квартала выключаем
						// Форма ОКУД0420820 "Отчет о деятельности кредитного потребительского кооператива"
						
						// получаем данные документа прошлого периода
						
						ДокументПредПериода = СРО_ЗагрузкаОтчетности.НайтиДокументОтчетностиПредыдущегоПериода(Выборка.ДокументОтчетности);						
						
						СтруктураПараметров  = Новый Структура();
						СтруктураПараметров.Вставить("ДокументОтчетности", ДокументПредПериода);
						СтруктураПараметров.Вставить("ВидОтчета", ВидОтчета);  
						
						Если ДокументПредПериода = Неопределено Тогда
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_1_1 = 0;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_1 = 0;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_2 = 0;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_3 = 0;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_5 = 0;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_6 = 0;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_7 = 0;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_8 = 0;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_9 = 0;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_10 = 0;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_11 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_12 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_13 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_14 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_15 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_17 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_18 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_19 = 0;	
							
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_1 = 0;  						
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_2 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_3 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_4 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_5 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_6 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_7 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_8 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_9 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_10 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_11 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_12 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_13 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_14 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_15 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_16 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_17 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_18 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_19 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_20 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_21 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_22 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_23 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_24 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_25 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_26 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_27 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_28 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_29 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_30 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_31 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_32 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_33 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_34 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_35 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_36 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_37 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_38 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_39 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_40 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_41 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_42 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_43 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_44 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_45 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_46 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_47 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_48 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_49 = 0;	
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_50 = 0;   							
							
						Иначе	
							
							ВремСтруктураПараметров = Новый СТруктура;
							ДатаНачалаОтчетногоПериода = НачалоКвартала(СтруктураПараметров.ДокументОтчетности.ДатаОкончанияОтчетногоПериода);  							
							ДатаОкончанияОтчетногоПериода = СтруктураПараметров.ДокументОтчетности.ДатаОкончанияОтчетногоПериода;    							
							
							ВремСтруктураПараметров.Вставить("ДатаНачалаОтчетногоПериода", ДатаНачалаОтчетногоПериода);
							ВремСтруктураПараметров.Вставить("ДатаОкончанияОтчетногоПериода", ДатаОкончанияОтчетногоПериода);
							ВремСтруктураПараметров.Вставить("СписокКПК", СписокКПК);
							ВремСтруктураПараметров.Вставить("ВидОтчета", СтруктураПараметров.ВидОтчета);
							
							
							
							
							
							СРО_ЗагрузкаОтчетности.ПолучитьТаблицыРазделовДокументаОтчетности(ВремСтруктураПараметров);
							//
							//ЗапросПоПСК = СтруктураПараметров.ЗапросПоПСК;
							//МВТ = СтруктураПараметров.МВТ;
							//
							//НачалоПериода = СтруктураПараметров.НачалоПериода;
							//ОкончаниеПериода = СтруктураПараметров.ОкончаниеПериода;
							//
							//ЗапросПоПСК = СтруктураПараметров.ЗапросПоПСК;
							
							СтруктураЗначениеПредДокумент = Новый Структура;
							
							СтруктураЗначений5ПредДокумент = Новый Структура(); 						
							ТЗраздел5_6ПредДокумент = СтруктураПараметров.ТЗраздел5_6;
							
							НайденныеСтроки = ТЗраздел5_6ПредДокумент.НайтиСтроки(Новый Структура("КодКПК_ДатаОтчетности", СокрЛП(Выборка.КПК.Код)+"_"+Строка(СтруктураПараметров.ДокументОтчетности.ДатаОкончанияОтчетногоПериода))); 
							
							Для Каждого НайденнаяСтрока ИЗ найденныеСтроки Цикл						
								СтруктураЗначений5ПредДокумент.Вставить("Раздел" + НайденнаяСтрока.Код + "_" + СокрЛП("Графа3"), НайденнаяСтрока.Графа3);
								СтруктураЗначений5ПредДокумент.Вставить("Раздел" + НайденнаяСтрока.Код + "_" + СокрЛП("Графа4"), НайденнаяСтрока.Графа4);
								СтруктураЗначений5ПредДокумент.Вставить("Раздел" + НайденнаяСтрока.Код + "_" + СокрЛП("Графа5"), НайденнаяСтрока.Графа5);
								СтруктураЗначений5ПредДокумент.Вставить("Раздел" + НайденнаяСтрока.Код + "_" + СокрЛП("Графа6"), НайденнаяСтрока.Графа6);					
							КонецЦикла;
							
							
							
							РезультатЗапроса = СтруктураПараметров.РезультатЗапроса;
							
							ПредДокумент_ВыборкаКПК =  РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							
							Пока ПредДокумент_ВыборкаКПК.Следующий() Цикл
								
								
								ПредДокумент_ВыборкаДатаОкончанияОтчетногоПериода=  ПредДокумент_ВыборкаКПК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								
								Пока ПредДокумент_ВыборкаДатаОкончанияОтчетногоПериода.Следующий() Цикл  				
									ПредДокумент_Выборка =  ПредДокумент_ВыборкаДатаОкончанияОтчетногоПериода.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									
									Пока ПредДокумент_Выборка.Следующий() Цикл
										
										ЕстьДокумент = ЗначениеЗаполнено(ПредДокумент_Выборка.ДокументОтчетности); 
										
										Если ЕстьДокумент Тогда  				
											ПредДокумент_ВыборкаРаздел =  ПредДокумент_Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
											
											// Собираем СтруктураЗначений
											Пока ПредДокумент_ВыборкаРаздел.Следующий() Цикл 
												Если Не ЗначениеЗаполнено(ПредДокумент_ВыборкаРаздел.Раздел) Тогда
													Прервать;
												КонецЕсли;
												СтруктураЗначениеПредДокумент.Вставить("Раздел" + ПредДокумент_ВыборкаРаздел.Раздел.Код, ПредДокумент_ВыборкаРаздел.ЗначениеПоказателя); 								
											КонецЦикла; 
										КонецЕсли;
									КонецЦикла;
								КонецЦикла;
							КонецЦикла;	     
							
							// Отчет "Межпериодный контроль отчетности по КПК (ОКУД0420820)"
							// 1.1            
							
							// Проверка значений Раздела III. "Данные о взносах, доходах и расходах"
							// 3.1 Значение, указанное в строке 4 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 4 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 237;
							
							Если СтруктураЗначение.Раздел3_4 < СтруктураЗначениеПредДокумент.Раздел3_4 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 4 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 4 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_4) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел3_4);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "3.1");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_1 = СтруктураЗначение.Раздел3_4 - СтруктураЗначениеПредДокумент.Раздел3_4;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_3_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 3.2 Значение, указанное в строке 4.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 4.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 238;
							
							Если СтруктураЗначение.Раздел3_4_1 < СтруктураЗначениеПредДокумент.Раздел3_4_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 4.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 4.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_4_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел3_4_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "3.2");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_2 = СтруктураЗначение.Раздел3_4_1 - СтруктураЗначениеПредДокумент.Раздел3_4_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_3_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 3.3 Значение, указанное в строке 4.1.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 4.1.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 239;
							
							Если СтруктураЗначение.Раздел3_4_1_1 < СтруктураЗначениеПредДокумент.Раздел3_4_1_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 4.1.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 4.1.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_4_1_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел3_4_1_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "3.3");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_3 = СтруктураЗначение.Раздел3_4_1_1 - СтруктураЗначениеПредДокумент.Раздел3_4_1_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_3_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 3.5 Значение, указанное в строке 4.3 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 4.3 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 240;
							
							Если СтруктураЗначение.Раздел3_4_3 < СтруктураЗначениеПредДокумент.Раздел3_4_3 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 4.3 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 4.3 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_4_3) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел3_4_3);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "3.5");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_5 = СтруктураЗначение.Раздел3_4_3 - СтруктураЗначениеПредДокумент.Раздел3_4_3;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_3_5 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 3.6 Значение, указанное в строке 4.4 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 4.4 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 241;
							
							Если СтруктураЗначение.Раздел3_4_4 < СтруктураЗначениеПредДокумент.Раздел3_4_4 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 4.4 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 4.4 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_4_4) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел3_4_4);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "3.6");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_6 = СтруктураЗначение.Раздел3_4_4 - СтруктураЗначениеПредДокумент.Раздел3_4_4;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_3_6 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 3.7 Значение, указанное в строке 4.5 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 4.5 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 242;
							
							Если СтруктураЗначение.Раздел3_4_5 < СтруктураЗначениеПредДокумент.Раздел3_4_5 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 4.5 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 4.5 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_4_5) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел3_4_5);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "3.7");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_7 = СтруктураЗначение.Раздел3_4_5 - СтруктураЗначениеПредДокумент.Раздел3_4_5;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_3_7 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 3.8 Значение по модулю, указанное в строке 5 отчета, представленного за текущий отчетный период, должно быть больше или равно значению по модулю, указанному в строке 5 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 243;
							
							Если СтруктураЗначение.Раздел3_5 < СтруктураЗначениеПредДокумент.Раздел3_5 Тогда
								ОписаниеУсловия= "Значение по модулю, указанное в строке 5 отчета, представленного за текущий отчетный период, должно быть больше или равно значению по модулю, указанному в строке 5 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_5) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел3_5);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "3.8");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_8 = СтруктураЗначение.Раздел3_5 - СтруктураЗначениеПредДокумент.Раздел3_5;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_3_8 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							
							// 3.9 Значение по модулю, указанное в строке 5.1 отчета, представленного за текущий отчетный период, меньше значения по модулю, указанного в строке 5.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 244;
							
							Если СтруктураЗначение.Раздел3_5_1 < СтруктураЗначениеПредДокумент.Раздел3_5_1 Тогда
								ОписаниеУсловия= "Значение по модулю, указанное в строке 5.1 отчета, представленного за текущий отчетный период, меньше значения по модулю, указанного в строке 5.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_5_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел3_5_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "3.9");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_9 = СтруктураЗначение.Раздел3_5_1 - СтруктураЗначениеПредДокумент.Раздел3_5_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_3_9 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							
							// 3.10 Значение по модулю, указанное в строке 5.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению по модулю, указанному в строке 5.2 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 245;
							
							Если СтруктураЗначение.Раздел3_5_2 < СтруктураЗначениеПредДокумент.Раздел3_5_2 Тогда
								ОписаниеУсловия= "Значение по модулю, указанное в строке 5.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению по модулю, указанному в строке 5.2 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_5_2) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел3_5_2);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "3.10");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_10 = СтруктураЗначение.Раздел3_5_2 - СтруктураЗначениеПредДокумент.Раздел3_5_2;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_3_10 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 3.11 Значение по модулю, указанное в строке 5.3 отчета, представленного за текущий отчетный период, должно быть больше или равно значению по модулю, указанному в строке 5.3 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 246;
							
							Если СтруктураЗначение.Раздел3_5_3 < СтруктураЗначениеПредДокумент.Раздел3_5_3 Тогда
								ОписаниеУсловия= "Значение по модулю, указанное в строке 5.3 отчета, представленного за текущий отчетный период, должно быть больше или равно значению по модулю, указанному в строке 5.3 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_5_3) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел3_5_3);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "3.11");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_11 = СтруктураЗначение.Раздел3_5_3 - СтруктураЗначениеПредДокумент.Раздел3_5_3;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_3_11 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 3.12 Значение по модулю, указанное в строке 5.3.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению по модулю, указанному в строке 5.3.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 247;
							
							Если СтруктураЗначение.Раздел3_5_3_1 < СтруктураЗначениеПредДокумент.Раздел3_5_3_1 Тогда
								ОписаниеУсловия= "Значение по модулю, указанное в строке 5.3.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению по модулю, указанному в строке 5.3.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_5_3_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел3_5_3_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "3.12");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_12 = СтруктураЗначение.Раздел3_5_3_1 - СтруктураЗначениеПредДокумент.Раздел3_5_3_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_3_12 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 3.13 Значение по модулю, указанное в строке 5.4 отчета, представленного за текущий отчетный период, должно быть больше или равно значению по модулю, указанному в строке 5.4 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 248;
							
							Если СтруктураЗначение.Раздел3_5_4 < СтруктураЗначениеПредДокумент.Раздел3_5_4 Тогда
								ОписаниеУсловия= "Значение по модулю, указанное в строке 5.4 отчета, представленного за текущий отчетный период, должно быть больше или равно значению по модулю, указанному в строке 5.4 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_5_4) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел3_5_4);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "3.13");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_13 = СтруктураЗначение.Раздел3_5_4 - СтруктураЗначениеПредДокумент.Раздел3_5_4;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_3_13 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							
							// 3.14 Значение по модулю, указанное в строке 5.5 отчета, представленного за текущий отчетный период, должно быть больше или равно значению по модулю, указанному в строке 5.5 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 249;
							
							Если СтруктураЗначение.Раздел3_5_5 < СтруктураЗначениеПредДокумент.Раздел3_5_5 Тогда
								ОписаниеУсловия= "Значение по модулю, указанное в строке 5.5 отчета, представленного за текущий отчетный период, должно быть больше или равно значению по модулю, указанному в строке 5.5 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_5_5) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел3_5_5);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "3.14");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_14 = СтруктураЗначение.Раздел3_5_5 - СтруктураЗначениеПредДокумент.Раздел3_5_5;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_3_14 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 3.15 Значение по модулю, указанное в строке 5.6 отчета, представленного за текущий отчетный период, должно быть больше или равно значению по модулю, указанному в строке 5.6 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 250;
							
							Если СтруктураЗначение.Раздел3_5_6 < СтруктураЗначениеПредДокумент.Раздел3_5_6 Тогда
								ОписаниеУсловия= "Значение по модулю, указанное в строке 5.6 отчета, представленного за текущий отчетный период, должно быть больше или равно значению по модулю, указанному в строке 5.6 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_5_6) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел3_5_6);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "3.15");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_15 = СтруктураЗначение.Раздел3_5_6 - СтруктураЗначениеПредДокумент.Раздел3_5_6;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_3_15 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 3.17 Значение, указанное в строке 10 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 10 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 251;
							
							Если СтруктураЗначение.Раздел3_10 < СтруктураЗначениеПредДокумент.Раздел3_10 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 10 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 10 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_10) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел3_10);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "3.17");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_17 = СтруктураЗначение.Раздел3_10 - СтруктураЗначениеПредДокумент.Раздел3_10;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_3_17 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 3.18 Значение, указанное в строке 10.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 10.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 252;
							
							Если СтруктураЗначение.Раздел3_10_1 < СтруктураЗначениеПредДокумент.Раздел3_10_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 10.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 10.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_10_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел3_10_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "3.18");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_18 = СтруктураЗначение.Раздел3_10_1 - СтруктураЗначениеПредДокумент.Раздел3_10_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_3_18 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 3.19 Значение, указанное в строке 10.2 отчета, представленного за текущий отчетный период, меньше значения, указанному в строке 10.2 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 253;
							
							Если СтруктураЗначение.Раздел3_10_2 < СтруктураЗначениеПредДокумент.Раздел3_10_2 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 10.2 отчета, представленного за текущий отчетный период, меньше значения, указанному в строке 10.2 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_10_2) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел3_10_2);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "3.19");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_19 = СтруктураЗначение.Раздел3_10_2 - СтруктураЗначениеПредДокумент.Раздел3_10_2;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_3_19 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// Проверка значений Раздела IV. "Сведения о деятельности"
							
							// 4.1 Значение, указанное в строке 12 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 12 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 254;
							
							Если СтруктураЗначение.Раздел4_12 < СтруктураЗначениеПредДокумент.Раздел4_12 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 12 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 12 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_12) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_12);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.1");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_1 = СтруктураЗначение.Раздел4_12 - СтруктураЗначениеПредДокумент.Раздел4_12;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							
							// 4.2 Значение, указанное в строке 12.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 12.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 255;
							
							Если СтруктураЗначение.Раздел4_12_1 < СтруктураЗначениеПредДокумент.Раздел4_12_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 12.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 12.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_12_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_12_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.2");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_2 = СтруктураЗначение.Раздел4_12_1 - СтруктураЗначениеПредДокумент.Раздел4_12_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.3 Значение, указанное в строке 12.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 12.2 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 256;
							
							Если СтруктураЗначение.Раздел4_12_2 < СтруктураЗначениеПредДокумент.Раздел4_12_2 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 12.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 12.2 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_12_2) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_12_2);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.3");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_3 = СтруктураЗначение.Раздел4_12_2 - СтруктураЗначениеПредДокумент.Раздел4_12_2;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							
							
							// 4.4 Значение, указанное в строке 13 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 13 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 257;
							
							Если СтруктураЗначение.Раздел4_13 < СтруктураЗначениеПредДокумент.Раздел4_13 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 13 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 13 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_13) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_13);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.4");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_4 = СтруктураЗначение.Раздел4_13 - СтруктураЗначениеПредДокумент.Раздел4_13;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_4 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.5 Значение, указанное в строке 13.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 13.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 258;
							
							Если СтруктураЗначение.Раздел4_13_1 < СтруктураЗначениеПредДокумент.Раздел4_13_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 13.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 13.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_13_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_13_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.5");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_5 = СтруктураЗначение.Раздел4_13_1 - СтруктураЗначениеПредДокумент.Раздел4_13_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_5 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							
							// 4.6 Значение, указанное в строке 13.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 13.2 "юридических лиц, ед." отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 259;
							
							Если СтруктураЗначение.Раздел4_13_2 < СтруктураЗначениеПредДокумент.Раздел4_13_2 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 13.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 13.2 ""юридических лиц, ед."" отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_13_2) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_13_2);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.6");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_6 = СтруктураЗначение.Раздел4_13_2 - СтруктураЗначениеПредДокумент.Раздел4_13_2;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_6 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							
							// 4.7 Значение, указанное в строке 18 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 18 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 260;
							
							Если СтруктураЗначение.Раздел4_18 < СтруктураЗначениеПредДокумент.Раздел4_18 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 18 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 18 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_18) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_18);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.7");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_7 = СтруктураЗначение.Раздел4_18 - СтруктураЗначениеПредДокумент.Раздел4_18;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_7 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.8 Значение, указанное в строке 18.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 18.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 261;
							
							Если СтруктураЗначение.Раздел4_18_1 < СтруктураЗначениеПредДокумент.Раздел4_18_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 18.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 18.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_18_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_18_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.8");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_8 = СтруктураЗначение.Раздел4_18_1 - СтруктураЗначениеПредДокумент.Раздел4_18_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_8 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.9 Значение, указанное в строке 18.1.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 18.1.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 262;
							
							Если СтруктураЗначение.Раздел4_18_1_1 < СтруктураЗначениеПредДокумент.Раздел4_18_1_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 18.1.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 18.1.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_18_1_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_18_1_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.9");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_9 = СтруктураЗначение.Раздел4_18_1_1 - СтруктураЗначениеПредДокумент.Раздел4_18_1_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_9 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.10 Значение, указанное в строке 18.1.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 18.1.2 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 263;
							
							Если СтруктураЗначение.Раздел4_18_1_2 < СтруктураЗначениеПредДокумент.Раздел4_18_1_2 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 18.1.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 18.1.2 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_18_1_2) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_18_1_2);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.10");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_10 = СтруктураЗначение.Раздел4_18_1_2 - СтруктураЗначениеПредДокумент.Раздел4_18_1_2;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_10 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.11 Значение, указанное в строке 18.2 отчета, представленного за текущий отчетный период, меньше значения, указанного в строке 18.2 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 264;
							
							Если СтруктураЗначение.Раздел4_18_2 < СтруктураЗначениеПредДокумент.Раздел4_18_2 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 18.2 отчета, представленного за текущий отчетный период, меньше значения, указанного в строке 18.2 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_18_2) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_18_2);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.11");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_11 = СтруктураЗначение.Раздел4_18_2 - СтруктураЗначениеПредДокумент.Раздел4_18_2;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_11 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.12 Значение, указанное в строке 18.2.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 18.2.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 265;
							
							Если СтруктураЗначение.Раздел4_18_2_1 < СтруктураЗначениеПредДокумент.Раздел4_18_2_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 18.2.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 18.2.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_18_2_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_18_2_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.12");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_12 = СтруктураЗначение.Раздел4_18_2_1 - СтруктураЗначениеПредДокумент.Раздел4_18_2_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_12 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.13 Значение, указанное в строке 18.2.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 18.2.2 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 266;
							
							Если СтруктураЗначение.Раздел4_18_2_2 < СтруктураЗначениеПредДокумент.Раздел4_18_2_2 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 18.2.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 18.2.2 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_18_2_2) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_18_2_2);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.13");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_13 = СтруктураЗначение.Раздел4_18_2_2 - СтруктураЗначениеПредДокумент.Раздел4_18_2_2;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_13 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.14 Значение, указанное в строке 19 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 267;
							
							Если СтруктураЗначение.Раздел4_19 < СтруктураЗначениеПредДокумент.Раздел4_19 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 19 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_19);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.14");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_14 = СтруктураЗначение.Раздел4_19 - СтруктураЗначениеПредДокумент.Раздел4_19;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_14 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.15 Значение, указанное в строке 19.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 268;
							
							Если СтруктураЗначение.Раздел4_19_1 < СтруктураЗначениеПредДокумент.Раздел4_19_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 19.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_19_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.15");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_15 = СтруктураЗначение.Раздел4_19_1 - СтруктураЗначениеПредДокумент.Раздел4_19_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_15 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.16 Значение, указанное в строке 19.1.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.1.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 269;
							
							Если СтруктураЗначение.Раздел4_19_1_1 < СтруктураЗначениеПредДокумент.Раздел4_19_1_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 19.1.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.1.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_1_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_19_1_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.16");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_16 = СтруктураЗначение.Раздел4_19_1_1 - СтруктураЗначениеПредДокумент.Раздел4_19_1_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_16 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							
							// 4.17 Значение, указанное в строке 19.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.2 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 270;
							
							Если СтруктураЗначение.Раздел4_19_2 < СтруктураЗначениеПредДокумент.Раздел4_19_2 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 19.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.2 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_2) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_19_2);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.17");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_17 = СтруктураЗначение.Раздел4_19_2 - СтруктураЗначениеПредДокумент.Раздел4_19_2;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_17 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.18 Значение, указанное в строке 19.2.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.2.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 271;
							
							Если СтруктураЗначение.Раздел4_19_2_1 < СтруктураЗначениеПредДокумент.Раздел4_19_2_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 19.2.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.2.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_2_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_19_2_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.18");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_18 = СтруктураЗначение.Раздел4_19_2_1 - СтруктураЗначениеПредДокумент.Раздел4_19_2_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_18 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							
							// 4.19 Значение, указанное в строке 19.3 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.3 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 272;
							
							Если СтруктураЗначение.Раздел4_19_3 < СтруктураЗначениеПредДокумент.Раздел4_19_3 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 19.3 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.3 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_3) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_19_3);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.19");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_19 = СтруктураЗначение.Раздел4_19_3 - СтруктураЗначениеПредДокумент.Раздел4_19_3;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_19 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.20 Значение, указанное в строке 19.3.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.3.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 273;
							
							Если СтруктураЗначение.Раздел4_19_3_1 < СтруктураЗначениеПредДокумент.Раздел4_19_3_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 19.3.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.3.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_3_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_19_3_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.20");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_20 = СтруктураЗначение.Раздел4_19_3_1 - СтруктураЗначениеПредДокумент.Раздел4_19_3_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_20 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.21 Значение, указанное в строке 19.3.1.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.3.1.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 274;
							
							Если СтруктураЗначение.Раздел4_19_3_1_1 < СтруктураЗначениеПредДокумент.Раздел4_19_3_1_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 19.3.1.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.3.1.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_3_1_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_19_3_1_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.21");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_21 = СтруктураЗначение.Раздел4_19_3_1_1 - СтруктураЗначениеПредДокумент.Раздел4_19_3_1_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_21 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.22 Значение, указанное в строке 19.3.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.3.2 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 275;
							
							Если СтруктураЗначение.Раздел4_19_3_2 < СтруктураЗначениеПредДокумент.Раздел4_19_3_2 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 19.3.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.3.2 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_3_2) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_19_3_2);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.22");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_22 = СтруктураЗначение.Раздел4_19_3_2 - СтруктураЗначениеПредДокумент.Раздел4_19_3_2;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_22 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.23 Значение, указанное в строке 19.3.2.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.3.2.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 276;
							
							Если СтруктураЗначение.Раздел4_19_3_2_1 < СтруктураЗначениеПредДокумент.Раздел4_19_3_2_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 19.3.2.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.3.2.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_3_2_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_19_3_2_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.23");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_23 = СтруктураЗначение.Раздел4_19_3_2_1 - СтруктураЗначениеПредДокумент.Раздел4_19_3_2_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_23 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.24 Значение, указанное в строке 19.3.3 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.3.3 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 277;
							
							Если СтруктураЗначение.Раздел4_19_3_3 < СтруктураЗначениеПредДокумент.Раздел4_19_3_3 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 19.3.3 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.3.3 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_3_3) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_19_3_3);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.24");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_24 = СтруктураЗначение.Раздел4_19_3_3 - СтруктураЗначениеПредДокумент.Раздел4_19_3_3;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_24 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.25 Значение, указанное в строке 19.3.3.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.3.3.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 278;
							
							Если СтруктураЗначение.Раздел4_19_3_3_1 < СтруктураЗначениеПредДокумент.Раздел4_19_3_3_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 19.3.3.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 19.3.3.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_19_3_3_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_19_3_3_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.25");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_25 = СтруктураЗначение.Раздел4_19_3_3_1 - СтруктураЗначениеПредДокумент.Раздел4_19_3_3_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_25 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.26 Значение, указанное в строке 22 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 22 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 279;
							
							Если СтруктураЗначение.Раздел4_22 < СтруктураЗначениеПредДокумент.Раздел4_22 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 22 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 22 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_22) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_22);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.26");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_26 = СтруктураЗначение.Раздел4_22 - СтруктураЗначениеПредДокумент.Раздел4_22;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_26 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.27 Значение, указанное в строке 22.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 22.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 280;
							
							Если СтруктураЗначение.Раздел4_22_1 < СтруктураЗначениеПредДокумент.Раздел4_22_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 22.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 22.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_22_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_22_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.27");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_27 = СтруктураЗначение.Раздел4_22_1 - СтруктураЗначениеПредДокумент.Раздел4_22_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_27 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.28 Значение, указанное в строке 22.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 22.2 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 281;
							
							Если СтруктураЗначение.Раздел4_22_2 < СтруктураЗначениеПредДокумент.Раздел4_22_2 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 22.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 22.2 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_22_2) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_22_2);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.28");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_28 = СтруктураЗначение.Раздел4_22_2 - СтруктураЗначениеПредДокумент.Раздел4_22_2;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_28 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.29 Значение, указанное в строке 23 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 282;
							
							Если СтруктураЗначение.Раздел4_23 < СтруктураЗначениеПредДокумент.Раздел4_23 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 23 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_23) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_23);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.29");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_29 = СтруктураЗначение.Раздел4_23 - СтруктураЗначениеПредДокумент.Раздел4_23;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_29 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.30 Значение, указанное в строке 23.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 283;
							
							Если СтруктураЗначение.Раздел4_23_1 < СтруктураЗначениеПредДокумент.Раздел4_23_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 23.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_23_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_23_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.30");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_30 = СтруктураЗначение.Раздел4_23_1 - СтруктураЗначениеПредДокумент.Раздел4_23_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_30 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.31 Значение, указанное в строке 23.1.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.1.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 284;
							
							Если СтруктураЗначение.Раздел4_23_1_1 < СтруктураЗначениеПредДокумент.Раздел4_23_1_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 23.1.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.1.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_23_1_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_23_1_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.31");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_31 = СтруктураЗначение.Раздел4_23_1_1 - СтруктураЗначениеПредДокумент.Раздел4_23_1_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_31 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.32 Значение, указанное в строке 23.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.2 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 285;
							
							Если СтруктураЗначение.Раздел4_23_2 < СтруктураЗначениеПредДокумент.Раздел4_23_2 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 23.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.2 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_23_2) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_23_2);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.32");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_32 = СтруктураЗначение.Раздел4_23_2 - СтруктураЗначениеПредДокумент.Раздел4_23_2;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_32 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.33 Значение, указанное в строке 23.2.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.2.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 286;
							
							Если СтруктураЗначение.Раздел4_23_2_1 < СтруктураЗначениеПредДокумент.Раздел4_23_2_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 23.2.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.2.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_23_2_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_23_2_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.33");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_33 = СтруктураЗначение.Раздел4_23_2_1 - СтруктураЗначениеПредДокумент.Раздел4_23_2_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_33 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.34 Значение, указанное в строке 23.3 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.3 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 287;
							
							Если СтруктураЗначение.Раздел4_23_3 < СтруктураЗначениеПредДокумент.Раздел4_23_3 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 23.3 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.3 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_23_3) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_23_3);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.34");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_34 = СтруктураЗначение.Раздел4_23_3 - СтруктураЗначениеПредДокумент.Раздел4_23_3;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_34 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.35 Значение, указанное в строке 23.3.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.3.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 288;
							
							Если СтруктураЗначение.Раздел4_23_3_1 < СтруктураЗначениеПредДокумент.Раздел4_23_3_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 23.3.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.3.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_23_3_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_23_3_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.35");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_35 = СтруктураЗначение.Раздел4_23_3_1 - СтруктураЗначениеПредДокумент.Раздел4_23_3_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_35 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.36 Значение, указанное в строке 23.3.1.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.3.1.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 289;
							
							Если СтруктураЗначение.Раздел4_23_3_1_1 < СтруктураЗначениеПредДокумент.Раздел4_23_3_1_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 23.3.1.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.3.1.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_23_3_1_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_23_3_1_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.36");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_36 = СтруктураЗначение.Раздел4_23_3_1_1 - СтруктураЗначениеПредДокумент.Раздел4_23_3_1_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_36 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.37 Значение, указанное в строке 23.3.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.3.2 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 290;
							
							Если СтруктураЗначение.Раздел4_23_3_2 < СтруктураЗначениеПредДокумент.Раздел4_23_3_2 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 23.3.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.3.2 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_23_3_2) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_23_3_2);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.37");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_37 = СтруктураЗначение.Раздел4_23_3_2 - СтруктураЗначениеПредДокумент.Раздел4_23_3_2;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_37 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							
							
							// 4.38 Значение, указанное в строке 23.3.2.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.3.2.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 291;
							
							Если СтруктураЗначение.Раздел4_23_3_2_1 < СтруктураЗначениеПредДокумент.Раздел4_23_3_2_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 23.3.2.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.3.2.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_23_3_2_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_23_3_2_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.38");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_38 = СтруктураЗначение.Раздел4_23_3_2_1 - СтруктураЗначениеПредДокумент.Раздел4_23_3_2_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_38 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							
							// 4.39 Значение, указанное в строке 23.3.3 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.3.3 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 292;
							
							Если СтруктураЗначение.Раздел4_23_3_3 < СтруктураЗначениеПредДокумент.Раздел4_23_3_3 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 23.3.3 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.3.3 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_23_3_3) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_23_3_3);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.39");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_39 = СтруктураЗначение.Раздел4_23_3_3 - СтруктураЗначениеПредДокумент.Раздел4_23_3_3;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_39 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.40 Значение, указанное в строке 23.3.3.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.3.3.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 293;
							
							Если СтруктураЗначение.Раздел4_23_3_3_1 < СтруктураЗначениеПредДокумент.Раздел4_23_3_3_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 23.3.3.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 23.3.3.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_23_3_3_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_23_3_3_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.40");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_40 = СтруктураЗначение.Раздел4_23_3_3_1 - СтруктураЗначениеПредДокумент.Раздел4_23_3_3_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_40 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.41 Значение, указанное в строке 25 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 25 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 294;
							
							Если СтруктураЗначение.Раздел4_25 < СтруктураЗначениеПредДокумент.Раздел4_25 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 25 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 25 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_25) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_25);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.41");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_41 = СтруктураЗначение.Раздел4_25 - СтруктураЗначениеПредДокумент.Раздел4_25;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_41 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							
							// 4.42 Значение, указанное в строке 25.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 25.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 295;
							
							Если СтруктураЗначение.Раздел4_25_1 < СтруктураЗначениеПредДокумент.Раздел4_25_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 25.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 25.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_25_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_25_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.42");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_42 = СтруктураЗначение.Раздел4_25_1 - СтруктураЗначениеПредДокумент.Раздел4_25_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_42 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.43 Значение, указанное в строке 25.1.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 25.1.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 296;
							
							Если СтруктураЗначение.Раздел4_25_1_1 < СтруктураЗначениеПредДокумент.Раздел4_25_1_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 25.1.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 25.1.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_25_1_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_25_1_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.43");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_43 = СтруктураЗначение.Раздел4_25_1_1 - СтруктураЗначениеПредДокумент.Раздел4_25_1_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_43 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.44 Значение, указанное в строке 25.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 25.2 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 297;
							
							Если СтруктураЗначение.Раздел4_25_2 < СтруктураЗначениеПредДокумент.Раздел4_25_2 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 25.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 25.2 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_25_2) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_25_2);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.44");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_44 = СтруктураЗначение.Раздел4_25_2 - СтруктураЗначениеПредДокумент.Раздел4_25_2;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_44 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.45 Значение, указанное в строке 25.2.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 25.2.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 298;
							
							Если СтруктураЗначение.Раздел4_25_2_1 < СтруктураЗначениеПредДокумент.Раздел4_25_2_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 25.2.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 25.2.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_25_2_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_25_2_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.45");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_45 = СтруктураЗначение.Раздел4_25_2_1 - СтруктураЗначениеПредДокумент.Раздел4_25_2_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_45 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.46 Значение, указанное в строке 28 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 28 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 299;
							
							Если СтруктураЗначение.Раздел4_28 < СтруктураЗначениеПредДокумент.Раздел4_28 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 28 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 28 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_28) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_28);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.46");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_46 = СтруктураЗначение.Раздел4_28 - СтруктураЗначениеПредДокумент.Раздел4_28;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_46 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.47 Значение, указанное в строке 29 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 29 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 300;
							
							Если СтруктураЗначение.Раздел4_29 < СтруктураЗначениеПредДокумент.Раздел4_29 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 29 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 29 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_29) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_29);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.47");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_47 = СтруктураЗначение.Раздел4_29 - СтруктураЗначениеПредДокумент.Раздел4_29;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_47 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							
							// 4.48 Значение, указанное в строке 29.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 29.1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 300;
							
							Если СтруктураЗначение.Раздел4_29_1 < СтруктураЗначениеПредДокумент.Раздел4_29_1 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 29.1 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 29.1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_29_1) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_29_1);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.48");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_48 = СтруктураЗначение.Раздел4_29_1 - СтруктураЗначениеПредДокумент.Раздел4_29_1;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_48 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.49 Значение, указанное в строке 29.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 29.2 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 301;
							
							Если СтруктураЗначение.Раздел4_29_2 < СтруктураЗначениеПредДокумент.Раздел4_29_2 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 29.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 29.2 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_29_2) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_29_2);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.49");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_49 = СтруктураЗначение.Раздел4_29_2 - СтруктураЗначениеПредДокумент.Раздел4_29_2;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_49 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// 4.50 Значение, указанное в строке 29.3 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 29.3 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 303;
							
							Если СтруктураЗначение.Раздел4_29_3 < СтруктураЗначениеПредДокумент.Раздел4_29_3 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 29.3 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 29.3 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел4_29_3) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел4_29_3);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "4.50");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_4_50 = СтруктураЗначение.Раздел4_29_3 - СтруктураЗначениеПредДокумент.Раздел4_29_3;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_4_50 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							// Новые контроли (предложение ДМР - декабрь 2018 года)
							// 3.20 Значение, указанное в строке 4.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 4.2 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 305;
							
							Если СтруктураЗначение.Раздел3_4_2 < СтруктураЗначениеПредДокумент.Раздел3_4_2 Тогда
								ОписаниеУсловия= "Значение, указанное в строке 4.2 отчета, представленного за текущий отчетный период, должно быть больше или равно значению, указанному в строке 4.2 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначение.Раздел3_4_2) +" < " + Строка(СтруктураЗначениеПредДокумент.Раздел3_4_2);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "3.20");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_3_20 = СтруктураЗначение.Раздел3_4_2 - СтруктураЗначениеПредДокумент.Раздел3_4_2;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_3_20 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							
							// Новые конотроли (предложение ДОО - январь 2019 года)
							// 5.3 Значение, указанное в графе 3 строки 1 Отчета, представленного за текущий отчетный период, должно быть равно значению, указанному в графе 6 строки 1 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 307;
							
							//СтруктураЗначений5ПредДокумент
							
							Если СтруктураЗначений5.Раздел5_1_Графа3 <> СтруктураЗначений5ПредДокумент.Раздел5_1_Графа6 Тогда
								ОписаниеУсловия= "Значение, указанное в графе 3 строки 1 Отчета, представленного за текущий отчетный период, должно быть равно значению, указанному в графе 6 строки 1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначений5.Раздел5_1_Графа3) +" <> " + Строка(СтруктураЗначений5ПредДокумент.Раздел5_1_Графа6);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "5.3");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_5_3 = СтруктураЗначений5.Раздел5_1_Графа3 - СтруктураЗначений5ПредДокумент.Раздел5_1_Графа6;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_5_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							
							// 5.4 Значение, указанное в графе 3 строки 1.2 Отчета, представленного за текущий отчетный период, должно быть равно значению, указанному в графе 6 строки 1.2 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 308;
							
							Если СтруктураЗначений5.Раздел5_1_2_Графа3 <> СтруктураЗначений5ПредДокумент.Раздел5_1_2_Графа6 Тогда
								ОписаниеУсловия= "Значение, указанное в графе 3 строки 1 Отчета, представленного за текущий отчетный период, должно быть равно значению, указанному в графе 6 строки 1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначений5.Раздел5_1_2_Графа3) +" <> " + Строка(СтруктураЗначений5ПредДокумент.Раздел5_1_2_Графа6);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "5.4");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_5_4 = СтруктураЗначений5.Раздел5_1_2_Графа3 - СтруктураЗначений5ПредДокумент.Раздел5_1_2_Графа6;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_5_4 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
							
							
							// 5.5 Значение, указанное в графе 3 строки 3 Отчета, представленного за текущий отчетный период, должно быть равно значению, указанному в графе 6 строки 3 отчета, представленного за предыдущий отчетный период
							ОписаниеУсловия = "";
							ОписаниеОшибки = "";  	
							НомерКолонки = 305;
							
							Если СтруктураЗначений5.Раздел5_3_Графа3 <> СтруктураЗначений5ПредДокумент.Раздел5_3_Графа6 Тогда
								ОписаниеУсловия= "Значение, указанное в графе 3 строки 1 Отчета, представленного за текущий отчетный период, должно быть равно значению, указанному в графе 6 строки 1 отчета, представленного за предыдущий отчетный период";
								ОписаниеОшибки = Строка(СтруктураЗначений5.Раздел5_3_Графа3) +" <> " + Строка(СтруктураЗначений5ПредДокумент.Раздел5_3_Графа6);
								ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "5.5");   
								ИтогоОшибокКС = ИтогоОшибокКС + 1;
								
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
							Иначе
								ОбластьСтрокаКС_Форма_ОКУД0420820.Область(1, НомерКолонки + КолДопКолонок, 1, НомерКолонки + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
							КонецЕсли;
							
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Код_5_5 = СтруктураЗначений5.Раздел5_3_Графа3 - СтруктураЗначений5ПредДокумент.Раздел5_3_Графа6;
							ОбластьСтрокаКС_Форма_ОКУД0420820.Параметры.Проверка_Код_5_5 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;						
						КонецЕсли;
						
					КонецЕсли;	
					
					
					ОбластьСтрокаКС.Параметры.ИтогоОшибокКС = ?(ИтогоОшибокКС = 0, "0", ИтогоОшибокКС);
					
					Если ИтогоОшибокКС > 0 Тогда
						ОбластьСтрокаКС.Область(1, 4 + КолДопКолонок, 1, 4 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;
					КонецЕсли;            
					
					
					
					
					РезультатКС.Вывести(ОбластьСтрокаКС); 	
					
					Если Не НеВыводим_ОКУД0420820 Тогда
						РезультатКС.Присоединить(ОбластьСтрокаКС_Форма_ОКУД0420820); 							
					КонецЕсли;
					
				КонецЕсли;
				
				// 4. Нормативы
				Если 1 = 1 Тогда  // просто блок чтобы можно было свернуть
					
					НазваниеТаблицы = "Нормативы";
					
					НомерСтрокиНормативы = НомерСтрокиНормативы +1;
					
					//ОбластьСтрокаНормативы.Параметры.Заполнить(Выборка);
					
					ОбластьСтрокаНормативы.Параметры.НомерВРеестреСРО = Выборка.КПК.НомерВРеестреСРО;
					
					ОбластьСтрокаНормативы.Параметры.НомерСтрокиНормативы = НомерСтрокиНормативы;
					ОбластьСтрокаНормативы.Параметры.КраткоеНазваниеКПК = Выборка.КПК.НаименованиеКраткое;
					
					Если ВидОтчета = 1 Тогда
						ОбластьСтрокаНормативы.Параметры.ПериодОтчетности = СРО_ЗагрузкаОтчетности.ПолучитьПредставлениеДатыОтчета(Выборка.ДатаОкончанияОтчетногоПериода);
					КонецЕсли;
					
					
					
					
					ОбластьСтрокаНормативы.Область(1, 1, 2, 12 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;		
					
					// если нет документа отчетности, то пропускаем проверки
					
					Если НЕ ЕстьДокумент Тогда
						РезультатНормативы.Вывести(ОбластьСтрокаНормативы); 	 		
						Продолжить;
					КонецЕсли;
					
					// записываем расшгифровки   		
					Если Выборка.ДокументОтчетности = null Тогда   			
						ОбластьСтрокаНормативы.Параметры.ДокументОтчетности  = "Нет документа";
						ОбластьСтрокаНормативы.Область(1, 3, 1, 3).ЦветТекста = WebЦвета.Черный;				
					Иначе	
						ОбластьСтрокаНормативы.Параметры.ДокументОтчетности  = Выборка.ДокументОтчетности;
						ОбластьСтрокаНормативы.Область(1, 3, 1, 3).ЦветТекста =  WebЦвета.Синий;
					КонецЕсли;
					
					
					
					СрокДеятельностиКПК = (НачалоДня(ДатаОкончанияОтчетногоПериода) - НачалоДня(Выборка.ДокументОтчетности.КПКДатаСоздания)) / 86400;
					
					// 04.99.49   		
					НС_04_99_49_ = 0;
					
					Если СтруктураЗначение.Раздел4_11 <= 100 И  СрокДеятельностиКПК < 180 Тогда
						НС_04_99_49 = 2;
					ИначеЕсли СтруктураЗначение.Раздел4_11 <= 200 Тогда
						НС_04_99_49 = 4;
					Иначе
						НС_04_99_49 = 5;
					КонецЕсли;
					
					Значение = СтруктураЗначение.Раздел2_3_1_1 + СтруктураЗначение.Раздел2_3_1_3 + СтруктураЗначение.Раздел2_3_1_5 + СтруктураЗначение.Раздел2_3_2_1 + СтруктураЗначение.Раздел2_3_2_3 + СтруктураЗначение.Раздел2_3_2_5;
					Факт04_99_49 = ?(Значение = 0, 0, окр(СтруктураЗначение.Раздел2_2_2 / Значение*100, 1));
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_49 = НС_04_99_49;   		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_49 = Факт04_99_49;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_49 < НС_04_99_49 Тогда 
						ОписаниеУсловия = "ФН1 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 4 + КолДопКолонок, 2, 4 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "строка 2.2 раздела II / (строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II) × 100% = " + Строка(Факт04_99_49) + " меньше " + Строка(НС_04_99_49);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.49");	
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_49 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 4 + КолДопКолонок, 2, 4 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;	
					КонецЕсли;
					
					// 04.99.50   		
					НС_04_99_50 = 0;
					
					Если СтруктураЗначение.Раздел4_20 <= 100 И  СрокДеятельностиКПК < 180 Тогда
						НС_04_99_50 = 50;
					ИначеЕсли СтруктураЗначение.Раздел4_20 <= 200 Тогда
						НС_04_99_50 = 25;
					ИначеЕсли СтруктураЗначение.Раздел4_20 <= 3000 Тогда
						НС_04_99_50 = 20;
					ИначеЕсли СтруктураЗначение.Раздел4_20 > 3000 Тогда
						НС_04_99_50 = 15;
					КонецЕсли;
					
					//Значение = СтруктураЗначение.Раздел2_3_1_1 + СтруктураЗначение.Раздел2_3_1_3 + СтруктураЗначение.Раздел2_3_1_5 + СтруктураЗначение.Раздел2_3_2_1 + СтруктураЗначение.Раздел2_3_2_3 + СтруктураЗначение.Раздел2_3_2_5;
					Факт04_99_50 = ?(Значение = 0, 0, окр(СтруктураЗначение.Раздел4_20 / Значение*100, 1));
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_50 = НС_04_99_50;   		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_50 = Факт04_99_50;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_50 > НС_04_99_50 Тогда 
						ОписаниеУсловия = "ФН2 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 5 + КолДопКолонок, 2, 5 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "строка 20 раздела IV / (строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II) × 100% = " + Строка(Факт04_99_50) + " больше " + Строка(НС_04_99_50);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.50");	
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_50 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 5 + КолДопКолонок, 2, 5 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
					КонецЕсли;
					
					
					НС_04_99_51 = 0;
					
					Если СтруктураЗначение.Раздел4_11 <= 100 И  СрокДеятельностиКПК < 180 Тогда
						НС_04_99_51 = 50;
					ИначеЕсли СтруктураЗначение.Раздел4_11 <= 200 Тогда
						НС_04_99_51 = 20;
					ИначеЕсли СтруктураЗначение.Раздел4_11 <= 3000 Тогда
						НС_04_99_51 = 10;
					ИначеЕсли СтруктураЗначение.Раздел4_11 > 3000 Тогда
						НС_04_99_51 = 7;
					КонецЕсли;
					
					
					Значение = СтруктураЗначение.Раздел2_1_1 + СтруктураЗначение.Раздел2_1_2 + СтруктураЗначение.Раздел4_35_1;
					Факт04_99_51 = ?(Значение = 0, 0, окр(СтруктураЗначение.Раздел4_26 / Значение*100, 1));
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_51 = НС_04_99_51;   		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_51 = Факт04_99_51;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_51 > НС_04_99_51 Тогда 
						ОписаниеУсловия = "ФН3 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 6 + КолДопКолонок, 2, 65 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "строка 26 раздела IV / (строки 1.1 + 1.2 раздела II + строка 35.1 раздела IV) × 100% = " + Строка(Факт04_99_51) + " больше " + Строка(НС_04_99_51);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.51");	
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_51 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 6 + КолДопКолонок, 2, 6 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
					КонецЕсли;
					
					
					НС_04_99_52 = 6;
					
					
					Значение = СтруктураЗначение.Раздел2_3_1_1 + СтруктураЗначение.Раздел2_3_1_3 + СтруктураЗначение.Раздел2_3_1_5 + СтруктураЗначение.Раздел2_3_2_1 + СтруктураЗначение.Раздел2_3_2_3 + СтруктураЗначение.Раздел2_3_2_5;
					Факт04_99_52 = ?(Значение = 0, 0, окр(СтруктураЗначение.Раздел2_2_1 / Значение*100, 1));
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_52 = НС_04_99_52;   		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_52 = Факт04_99_52;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_52 < НС_04_99_52 Тогда 
						ОписаниеУсловия = "ФН4 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 7 + КолДопКолонок, 2, 7 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "строка 2.1 раздела II / (строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II) × 100% = " + Строка(Факт04_99_52) + " меньше " + Строка(НС_04_99_52);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.52");	
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_52 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 7 + КолДопКолонок, 2, 7 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;	
					КонецЕсли;
					
					НС_04_99_53 = 50;
					
					Значение = СтруктураЗначение.Раздел2_3_1_1 + СтруктураЗначение.Раздел2_3_1_3 + СтруктураЗначение.Раздел2_3_1_5 + СтруктураЗначение.Раздел2_3_2_1 + СтруктураЗначение.Раздел2_3_2_3 + СтруктураЗначение.Раздел2_3_2_5;
					Факт04_99_53 = ?(Значение = 0, 0, окр((СтруктураЗначение.Раздел2_3_1_7 + СтруктураЗначение.Раздел2_3_2_7)/ Значение*100, 1));
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_53 = НС_04_99_53;   		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_53 = Факт04_99_53;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_53 > НС_04_99_53 Тогда 
						ОписаниеУсловия = "ФН5 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 8 + КолДопКолонок, 2, 8 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "(строки 3.1.7 + 3.2.7 раздела II) / (строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II) × 100% = " + Строка(Факт04_99_53) + " Больше " + Строка(НС_04_99_53);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.53");	
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_53 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 8 + КолДопКолонок, 2, 8 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;	
					КонецЕсли;
					
					
					НС_04_99_54 = 0;
					
					//Если СтруктураЗначение.Раздел4_20 <= 100 И  СрокДеятельностиКПК < 180 Тогда
					//	НС_04_99_50 = 50;
					//ИначеЕсли СтруктураЗначение.Раздел4_20 <= 200 Тогда
					//	НС_04_99_50 = 25;
					//ИначеЕсли СтруктураЗначение.Раздел4_20 <= 3000 Тогда
					//	НС_04_99_50 = 20;
					//ИначеЕсли СтруктураЗначение.Раздел4_20 > 3000 Тогда
					//	НС_04_99_50 = 15;
					//КонецЕсли;
					
					
					Значение = СтруктураЗначение.Раздел2_3_1_1 + СтруктураЗначение.Раздел2_3_1_3 + СтруктураЗначение.Раздел2_3_1_5 + СтруктураЗначение.Раздел2_3_1_7 + СтруктураЗначение.Раздел2_3_2_1 + СтруктураЗначение.Раздел2_3_2_3 + СтруктураЗначение.Раздел2_3_2_5 + СтруктураЗначение.Раздел2_3_2_7;
					Факт04_99_54 = ?(Значение = 0, 0, окр((СтруктураЗначение.Раздел2_1_1_4 + СтруктураЗначение.Раздел2_1_2_4)/ Значение*100, 1));
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_54 = 0;   		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_54 = Факт04_99_54;
					
					//// проверяем		
					//// совпадение расчетного и показателя из файла
					//Если Факт04_99_54 > НС_04_99_53 Тогда 
					//	ОписаниеУсловия = "ФН5 не свпадает с расчетным";	
					//	ОбластьСтрокаНормативы.Область(1, 8 + КолДопКолонок, 2, 8 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
					//	ОписаниеОшибки = "(строки 3.1.7 + 3.2.7 раздела II) / (строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II) × 100% = " + Строка(Факт04_99_53) + " Больше " + Строка(НС_04_99_53);
					//	ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);	
					//	
					//	ОбластьСтрокаНормативы.параметры.Расшифровка04_99_53 = ОписаниеОшибки;
					//Иначе
					//	ОбластьСтрокаНормативы.Область(1, 8 + КолДопКолонок, 2, 8 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;	
					//КонецЕсли;
					
					
					
					НС_04_99_55 = 70;
					
					
					Значение = СтруктураЗначение.Раздел2_3_1_1 + СтруктураЗначение.Раздел2_3_1_3 + СтруктураЗначение.Раздел2_3_1_5 + СтруктураЗначение.Раздел2_3_1_7 + СтруктураЗначение.Раздел2_3_2_1 + СтруктураЗначение.Раздел2_3_2_3 + СтруктураЗначение.Раздел2_3_2_5 + СтруктураЗначение.Раздел2_3_2_7;
					Факт04_99_55 = ?(Значение = 0, 0, окр((СтруктураЗначение.Раздел2_1_12_1_1 + СтруктураЗначение.Раздел2_1_12-СтруктураЗначение.Раздел2_1_12_1 + СтруктураЗначение.Раздел2_1_3_2 + СтруктураЗначение.Раздел2_1_4_2 + СтруктураЗначение.Раздел2_1_1 + СтруктураЗначение.Раздел2_1_2)/ Значение*100, 1));
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_55 = НС_04_99_55;   		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_55 = Факт04_99_55;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_55 < НС_04_99_55 Тогда 
						ОписаниеУсловия = "ФН7 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 10 + КолДопКолонок, 2, 10 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "(строки 1.12.1.1 + (1.12 - 1.12.1) + 1.3.2 + 1.4.2 +1.1 + 1.2 раздела II) / (3.1.1+3.1.3 + 3.1.5 + 3.1.7 + 3.2.1 + 3.2.3 + 3.2.5 + 3.2.7 раздела II) ×100% = " + Строка(Факт04_99_55) + " меньше " + Строка(НС_04_99_55);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.55");	
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_55 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 10 + КолДопКолонок, 2, 10 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;	
					КонецЕсли;
					
					
					
					Если СрокДеятельностиКПК < 180 Тогда
						НС_04_99_56 = 50;
						//ИначеЕсли НачалоДня(Выборка.ДокументОтчетности.КПКДатаСоздания) <= Дата(2016, 6, 30) Тогда
						//	НС_04_99_56 = 30;
						//ИначеЕсли НачалоДня(Выборка.ДокументОтчетности.КПКДатаСоздания) <= Дата(2016, 12, 31) Тогда
						//	НС_04_99_56 = 40;
						//ИначеЕсли НачалоДня(Выборка.ДокументОтчетности.КПКДатаСоздания) <= Дата(2017, 12, 31) Тогда
						//	НС_04_99_56 = 60;
					Иначе	
						НС_04_99_56 = 75;   
					КонецЕсли;
					
					Значение = СтруктураЗначение.Раздел2_3_1 + СтруктураЗначение.Раздел2_3_3_1;
					Факт04_99_56 = ?(Значение = 0, 0, окр((СтруктураЗначение.Раздел2_1_1 + СтруктураЗначение.Раздел2_1_3) / Значение*100, 1));
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_56 = НС_04_99_56;   		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_56 = Факт04_99_56;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_56 < НС_04_99_56 Тогда 
						ОписаниеУсловия = "ФН8 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 11 + КолДопКолонок, 2, 11 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "(строки 1.1 + 1.3+ 1.8.1 раздела II) / (строки 3.1 + 3.3.1 раздела II) × 100% = " + Строка(Факт04_99_51) + " меньше " + Строка(НС_04_99_51);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.56");	
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_56 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 11 + КолДопКолонок, 2, 11 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
					КонецЕсли;
					
					
					
					Если СтруктураЗначение.Раздел4_11 <= 100 И  СрокДеятельностиКПК < 180 Тогда
						НС_04_99_57 = 2;
					ИначеЕсли СтруктураЗначение.Раздел4_11 <= 200 Тогда
						НС_04_99_57 = 4;
					Иначе
						НС_04_99_57 = 5;
					КонецЕсли;       
					
					Факт04_99_57 = СтруктураЗначение.Раздел11_1;
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_57 = НС_04_99_57;   		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_57 = Факт04_99_57;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_57 < НС_04_99_57 Тогда 
						ОписаниеУсловия = "ФН1 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 12 + КолДопКолонок, 2, 12 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "Строка 1 раздела XI  = " + Строка(Факт04_99_57) + " меньше " + Строка(НС_04_99_57);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.57");	
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_57 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 12 + КолДопКолонок, 2, 12 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
					КонецЕсли;
					
					
					
					Если СтруктураЗначение.Раздел4_11 <= 100 И  СрокДеятельностиКПК < 180 Тогда
						НС_04_99_58 = 50;
					ИначеЕсли СтруктураЗначение.Раздел4_11 <= 200 Тогда
						НС_04_99_58 = 25;
					ИначеЕсли СтруктураЗначение.Раздел4_11 <= 3000 Тогда
						НС_04_99_58 = 20;   			
					Иначе        			
						НС_04_99_58 = 15;
					КонецЕсли;  		
					
					Факт04_99_58 = СтруктураЗначение.Раздел11_2;
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_58 = НС_04_99_58;   		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_58 = Факт04_99_58;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_58 > НС_04_99_58 Тогда 
						ОписаниеУсловия = "ФН2 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 13 + КолДопКолонок, 2, 13 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "Строка 2 раздела XI  = " + Строка(Факт04_99_58) + " больше " + Строка(НС_04_99_58);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.58");	
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_58 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 13 + КолДопКолонок, 2, 13 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
					КонецЕсли;
					
					
					
					Если СтруктураЗначение.Раздел4_11 <= 100 И  СрокДеятельностиКПК < 180 Тогда
						НС_04_99_59 = 50;
					ИначеЕсли СтруктураЗначение.Раздел4_11 <= 200 Тогда
						НС_04_99_59 = 20;
					ИначеЕсли СтруктураЗначение.Раздел4_11 <= 3000 Тогда
						НС_04_99_59 = 10;   			
					Иначе        			
						НС_04_99_59 = 7;
					КонецЕсли;  		
					
					Факт04_99_59 = СтруктураЗначение.Раздел11_3;
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_59 = НС_04_99_59;   		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_59 = Факт04_99_59;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_59 > НС_04_99_59 Тогда 
						ОписаниеУсловия = "ФН3 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 14 + КолДопКолонок, 2, 14 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "Строка 3 раздела XI  = " + Строка(Факт04_99_59) + " больше " + Строка(НС_04_99_59);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.59");	
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_59 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 14 + КолДопКолонок, 2, 14 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
					КонецЕсли;
					
					НС_04_99_60 = 6;  	 		
					
					Факт04_99_60 = СтруктураЗначение.Раздел11_4;
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_60 = НС_04_99_60;   		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_60 = Факт04_99_60;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_60 < НС_04_99_60 Тогда 
						ОписаниеУсловия = "ФН3 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 15 + КолДопКолонок, 2, 15 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "Строка 4 раздела XI  = " + Строка(Факт04_99_60) + " меньше " + Строка(НС_04_99_60);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.60");	
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_60 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 15 + КолДопКолонок, 2, 15 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
					КонецЕсли;
					
					
					НС_04_99_61 = 50;      	 		
					
					Факт04_99_61 = СтруктураЗначение.Раздел11_5;
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_61 = НС_04_99_61;   		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_61 = Факт04_99_61;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_61 < НС_04_99_61 Тогда 
						ОписаниеУсловия = "ФН3 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 16 + КолДопКолонок, 2, 16 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "Строка 5 раздела XI  = " + Строка(Факт04_99_61) + " больше " + Строка(НС_04_99_61);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.61");	
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_61 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 16 + КолДопКолонок, 2, 16 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
					КонецЕсли;
					
					
					НС_04_99_62 = 0;  
					
					//		если значение строки 2.1 раздела II отчета о деятельности КПК второго уровня больше 10 000 и меньше или равно 50 000 - 10%;
					
					//если значение строки 2.1 раздела II отчета о деятельности КПК второго уровня больше 50 000 - 15%;
					
					//в случае наличия у КПК второго уровня присвоенного кредитного рейтинга не ниже нижней границы уровня, установленного Советом директоров Банка России - 25%
					
					Факт04_99_62 = СтруктураЗначение.Раздел11_6;
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_62 = НС_04_99_62;   		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_62 = Факт04_99_62;
					
					//// проверяем		
					//// совпадение расчетного и показателя из файла
					//Если Факт04_99_61 > НС_04_99_61 Тогда 
					//	ОписаниеУсловия = "ФН3 не свпадает с расчетным";	
					//	ОбластьСтрокаНормативы.Область(1, 16 + КолДопКолонок, 2, 16 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
					//	ОписаниеОшибки = "Строка 5 раздела XI  = " + Строка(Факт04_99_61) + " больше " + Строка(НС_04_99_61);
					//	ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);	
					//	ОбластьСтрокаНормативы.параметры.Расшифровка04_99_61 = ОписаниеОшибки;
					//Иначе
					//	ОбластьСтрокаНормативы.Область(1, 16 + КолДопКолонок, 2, 16 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
					//КонецЕсли;
					
					
					
					
					НС_04_99_63 = 70;
					
					Факт04_99_63 = СтруктураЗначение.Раздел11_7;
					
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_63 = НС_04_99_63;   		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_63 = Факт04_99_63;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_63 < НС_04_99_63 Тогда 
						ОписаниеУсловия = "ФН7 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 18 + КолДопКолонок, 2, 18 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "Строка 7 раздела XI  = " + Строка(Факт04_99_63) + " меньше " + Строка(НС_04_99_63);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.63");	
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_63 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 18 + КолДопКолонок, 2, 18 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;	
					КонецЕсли;
					
					
					Если ПериодОтчета.ДатаНачала >= Дата(2018, 1, 1) Тогда
						НС_04_99_64 = 75; 
					ИначеЕсли ПериодОтчета.ДатаНачала >= Дата(2017, 1, 1) Тогда
						НС_04_99_64 = 60;
						
					ИначеЕсли ПериодОтчета.ДатаНачала >= Дата(2016, 7, 1) Тогда
						НС_04_99_64 = 40;
					ИначеЕсли СрокДеятельностиКПК > 180  Тогда
						НС_04_99_64 = 30;
					Иначе
						НС_04_99_64 = 50;
					КонецЕсли;					
					
					Факт04_99_64 = СтруктураЗначение.Раздел11_8;
					
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_64 = НС_04_99_64;   		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_64 = Факт04_99_64;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_64 < НС_04_99_64 Тогда 
						ОписаниеУсловия = "ФН7 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 19 + КолДопКолонок, 2, 19 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "Строка 8 раздела XI  = " + Строка(Факт04_99_64) + " меньше " + Строка(НС_04_99_64);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.64");	
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_64 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 19 + КолДопКолонок, 2, 19 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;	
					КонецЕсли;
					
					
					
					
					
					Значение = СтруктураЗначение.Раздел2_3_1_1 + СтруктураЗначение.Раздел2_3_1_3 + СтруктураЗначение.Раздел2_3_1_5 + СтруктураЗначение.Раздел2_3_2_1 + СтруктураЗначение.Раздел2_3_2_3 + СтруктураЗначение.Раздел2_3_2_5;
					
					ОписаниеОшибки = "";
					
					Если СтруктураЗначение.Раздел2_2_2 >= 0 И  Значение = 0 И  СтруктураЗначение.Раздел11_1 <> 0 Тогда			
						ОписаниеУсловия = "строка 2.2 раздела II = 0 И строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II = 0 И строка 1 раздела XI = 0 ИЛИ строка 2.2 раздела II > 0 И строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II = 0 И строка 1 раздела XI = 0 (условие при котором триннер не срабатывает)";
						ОбластьСтрокаНормативы.Параметры.Факт04_99_65 = 1;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.65");	
						ОбластьСтрокаНормативы.Область(1, 20 + КолДопКолонок, 2, 20 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_65 = "строка 2.2 раздела II = " + Строка(СтруктураЗначение.Раздел2_2_2)+"; строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II = " + Строка(Значение)+"; строка 1 раздела XI = " + Строка(СтруктураЗначение.Раздел11_1);
					Иначе
						ОбластьСтрокаНормативы.Параметры.Факт04_99_65 = 0;
						ОписаниеУсловия = "";
						ОбластьСтрокаНормативы.Область(1, 20 + КолДопКолонок, 2, 20 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
						
					КонецЕсли;   	
					
					
					
					
					//Значение = СтруктураЗначение.Раздел2_3_1_1 + СтруктураЗначение.Раздел2_3_1_3 + СтруктураЗначение.Раздел2_3_1_5 + СтруктураЗначение.Раздел2_3_2_1 + СтруктураЗначение.Раздел2_3_2_3 + СтруктураЗначение.Раздел2_3_2_5;
					
					ОписаниеОшибки = "";   		
					
					Если СтруктураЗначение.Раздел4_20 >= 0 И Значение = 0 И СтруктураЗначение.Раздел11_1  <> 0
						ИЛИ СтруктураЗначение.Раздел4_20 - СтруктураЗначение.Раздел4_21 >= 0  И Значение = 0 И СтруктураЗначение.Раздел11_1  <> 0 Тогда
						
						ОписаниеУсловия = "строка 2.2 раздела II = 0 И строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II = 0 И строка 1 раздела XI = 0 ИЛИ строка 2.2 раздела II > 0 И строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II = 0 И строка 1 раздела XI = 0 (условие при котором триннер не срабатывает)";
						ОбластьСтрокаНормативы.Параметры.Факт04_99_66 = 1;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.66");	
						ОбластьСтрокаНормативы.Область(1, 21 + КолДопКолонок, 2, 21 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_66 = "строка 20 раздела IV = " + Строка(СтруктураЗначение.Раздел4_20)+"; строка 21 раздела IV = " + Строка(СтруктураЗначение.Раздел4_21)+"; строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II = " + Строка(Значение)+"; строка 2 раздела XI = " + Строка(СтруктураЗначение.Раздел11_2);
					Иначе
						ОбластьСтрокаНормативы.Параметры.Факт04_99_66 = 0;
						ОписаниеУсловия = "";
						ОбластьСтрокаНормативы.Область(1, 21 + КолДопКолонок, 2, 21 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;   	
						
						
					КонецЕсли;   			
					
					ОписаниеОшибки = "";   
					
					Если СтруктураЗначение.Раздел4_26 >= 0 И СтруктураЗначение.Раздел2_1_1 + СтруктураЗначение.Раздел2_1_2 + СтруктураЗначение.Раздел4_35_1 = 0 И СтруктураЗначение.Раздел11_3  <> 0
						ИЛИ СтруктураЗначение.Раздел4_26 - СтруктураЗначение.Раздел4_27 >= 0 И СтруктураЗначение.Раздел2_1_1 + СтруктураЗначение.Раздел2_1_2 + СтруктураЗначение.Раздел4_35_1 = 0 И СтруктураЗначение.Раздел11_3  <> 0  Тогда
						
						ОписаниеУсловия = "строка 26 раздела IV = 0 И строки 1.1 + 1.2 раздела II + строка 35.1 раздела IV = 0 И строка 3 раздела XI = 0 ИЛИ строка 26 раздела IV > 0 И строки 1.1 + 1.2 раздела II + строка 35.1 раздела IV = 0 И строка 3 раздела XI = 0 ИЛИ строка 26 раздела IV - строка 27 раздела IV = 0 И строки 1.1 + 1.2 раздела II + строка 35.1 раздела IV = 0 И строка 3 раздела XI = 0 ИЛИ строка 26 раздела IV - строка 27 раздела IV > 0 И строки 1.1 + 1.2 раздела II + строка 35.1 раздела IV = 0 И строка 3 раздела XI = 0 (условие при котором триннер не срабатывает)";
						ОбластьСтрокаНормативы.Параметры.Факт04_99_67 = 1;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.67");	
						ОбластьСтрокаНормативы.Область(1, 22 + КолДопКолонок, 2, 22 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_67 = "строка 26 раздела IV = " + Строка(СтруктураЗначение.Раздел4_26)+"строка 27 раздела IV = " + Строка(СтруктураЗначение.Раздел4_27)+"; строки 1.1 + 1.2 раздела II + строка 35.1 раздела IV = " + Строка(СтруктураЗначение.Раздел2_1_1 + СтруктураЗначение.Раздел2_1_2 + СтруктураЗначение.Раздел4_35_1)+"; строка 3 раздела XI = " + Строка(СтруктураЗначение.Раздел11_3);
					Иначе
						ОбластьСтрокаНормативы.Параметры.Факт04_99_67 = 0;
						ОписаниеУсловия = "";
						ОбластьСтрокаНормативы.Область(1, 22 + КолДопКолонок, 2, 22 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;   
					КонецЕсли;   
					
					ОписаниеОшибки = "";  	
					
					Если СтруктураЗначение.Раздел2_2_1 >= 0 И Значение = 0 И СтруктураЗначение.Раздел11_4  <> 0  Тогда
						
						ОписаниеУсловия = "строка 2.1 раздела II = 0 И строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II = 0 И строка 4 раздела XI = 0 ИЛИ строка 2.1 раздела II > 0 И строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II = 0 И строка 4 раздела XI = 0 (условие при котором триннер не срабатывает)";
						ОбластьСтрокаНормативы.Параметры.Факт04_99_68 = 1;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.68");	
						ОбластьСтрокаНормативы.Область(1, 23 + КолДопКолонок, 2, 23 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_68 = "строка 2.1 раздела II = " + Строка(СтруктураЗначение.Раздел2_2_1)+"; строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II = " + Строка(Значение)+"; строка 4 раздела XI = " + Строка(СтруктураЗначение.Раздел11_4);
					Иначе
						ОбластьСтрокаНормативы.Параметры.Факт04_99_68 = 0;
						ОписаниеУсловия = "";
						ОбластьСтрокаНормативы.Область(1, 23 + КолДопКолонок, 2, 23 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;   
					КонецЕсли;
					
					
					ОписаниеОшибки = "";  	
					
					Если СтруктураЗначение.Раздел2_3_1_7 + СтруктураЗначение.Раздел2_3_2_7 >= 0 И Значение = 0 И СтруктураЗначение.Раздел11_5  <> 0  Тогда
						
						ОписаниеУсловия = "строки 3.1.7 + 3.2.7 раздела II = 0 И строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II = 0 И строка 5 раздела XI = 0 ИЛИ строки 3.1.7 + 3.2.7 раздела II > 0 И строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II = 0 И строка 5 раздела XI = 0 (условие при котором триннер не срабатывает)";
						ОбластьСтрокаНормативы.Параметры.Факт04_99_69 = 1;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.69");	
						ОбластьСтрокаНормативы.Область(1, 24 + КолДопКолонок, 2, 24 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_69 = "строки 3.1.7 + 3.2.7 раздела II = " + Строка(СтруктураЗначение.Раздел2_3_1_7 + СтруктураЗначение.Раздел2_3_2_7)+"; строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II = " + Строка(Значение)+"; строка 5 раздела XI = " + Строка(СтруктураЗначение.Раздел11_5);
					Иначе
						ОбластьСтрокаНормативы.Параметры.Факт04_99_69 = 0;
						ОписаниеУсловия = "";
						ОбластьСтрокаНормативы.Область(1, 24 + КолДопКолонок, 2, 24 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;   
					КонецЕсли;
					
					
					ОписаниеОшибки = "";  	
					
					Если СтруктураЗначение.Раздел2_1_1_4 + СтруктураЗначение.Раздел2_1_2_4 >= 0 И Значение = 0 И СтруктураЗначение.Раздел11_6  <> 0  Тогда
						ОписаниеУсловия = "строки 1.1.4 + 1.2.4 раздела II = 0 И строки 2.1 + 3.1.1 + 3.1.3 + 3.1.5 + 3.1.7 + 3.2.1 + 3.2.3 + 3.2.5 + 3.2.7 раздела II = 0 И строка 6 раздела XI = 0 ИЛИ строки 1.1.4 + 1.2.4 раздела II > 0 И строки 2.1 + 3.1.1 + 3.1.3 + 3.1.5 + 3.1.7 + 3.2.1 + 3.2.3 + 3.2.5 + 3.2.7 раздела II = 0 И строка 6 раздела XI = 0 (условие при котором триннер не срабатывает)";
						ОбластьСтрокаНормативы.Параметры.Факт04_99_70 = 1;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.70");	
						ОбластьСтрокаНормативы.Область(1, 25 + КолДопКолонок, 2, 25 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_70 = "строки 1.1.4 + 1.2.4 раздела II = " + Строка(СтруктураЗначение.Раздел2_1_1_4 + СтруктураЗначение.Раздел2_1_2_4)+"; строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II = " + Строка(Значение)+"; строка 6 раздела XI = " + Строка(СтруктураЗначение.Раздел11_6);
					Иначе
						ОбластьСтрокаНормативы.Параметры.Факт04_99_70 = 0;
						ОписаниеУсловия = "";
						ОбластьСтрокаНормативы.Область(1, 25 + КолДопКолонок, 2, 25 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;   
					КонецЕсли;
					
					
					ОписаниеОшибки = "";  
					
					ЗначениеСумма = СтруктураЗначение.Раздел2_1_12_1_1 + СтруктураЗначение.Раздел2_1_12 - СтруктураЗначение.Раздел2_1_12_1+ СтруктураЗначение.Раздел2_1_3_2+ СтруктураЗначение.Раздел2_1_4_2+ СтруктураЗначение.Раздел2_1_1+ СтруктураЗначение.Раздел2_1_2;
					ЗначениеПлюс7 = СтруктураЗначение.Раздел2_3_1_1 + СтруктураЗначение.Раздел2_3_1_3 + СтруктураЗначение.Раздел2_3_1_5 + СтруктураЗначение.Раздел2_3_1_7 + СтруктураЗначение.Раздел2_3_2_1 + СтруктураЗначение.Раздел2_3_2_3 + СтруктураЗначение.Раздел2_3_2_5 + СтруктураЗначение.Раздел2_3_2_7;
					
					Если  ЗначениеСумма>= 0 И ЗначениеПлюс7 = 0 И СтруктураЗначение.Раздел11_7  <> 0  Тогда
						ОписаниеУсловия = "строки 1.12.1.1 + (1.12 - 1.12.1) + 1.3.2 + 1.4.2 +1.1 + 1.2 раздела II = 0 И строки 3.1.1 + 3.1.3 + 3.1.5 + 3.1.7 + 3.2.1 + 3.2.3 + 3.2.5 + 3.2.7 раздела II = 0 И строка 7 раздела XI = 0 ИЛИ строки 1.12.1.1 + (1.12 - 1.12.1) + 1.3.2 + 1.4.2 +1.1 + 1.2 раздела II > 0 И строки 3.1.1 + 3.1.3 + 3.1.5 + 3.1.7 + 3.2.1 + 3.2.3 + 3.2.5 + 3.2.7 раздела II = 0 И строка 7 раздела XI = 0 (условие при котором триннер не срабатывает)";
						ОбластьСтрокаНормативы.Параметры.Факт04_99_71 = 1;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.71");	
						ОбластьСтрокаНормативы.Область(1, 26 + КолДопКолонок, 2, 26 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_71 = "строки 1.12.1.1 + (1.12 - 1.12.1) + 1.3.2 + 1.4.2 +1.1 + 1.2 раздела II = " + Строка(ЗначениеСумма)+"; строки 3.1.1 + 3.1.3 + 3.1.5 + 3.1.7 + 3.2.1 + 3.2.3 + 3.2.5 + 3.2.7 раздела II = " + Строка(ЗначениеПлюс7)+"; строка 7 раздела XI = " + Строка(СтруктураЗначение.Раздел11_7);
					Иначе
						ОбластьСтрокаНормативы.Параметры.Факт04_99_71 = 0;
						ОписаниеУсловия = "";
						ОбластьСтрокаНормативы.Область(1, 26 + КолДопКолонок, 2, 26 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;   
					КонецЕсли;
					
					
					ОписаниеОшибки = "";  
					
					
					
					ЗначениеСумма = СтруктураЗначение.Раздел2_1_1 + СтруктураЗначение.Раздел2_1_3 + СтруктураЗначение.Раздел2_1_8_1;
					Значение3 = СтруктураЗначение.Раздел2_3_1 + СтруктураЗначение.Раздел2_3_3_1;
					
					Если  ЗначениеСумма>= 0 И Значение3 = 0 И СтруктураЗначение.Раздел11_8  <> 0  Тогда
						ОписаниеУсловия = "строки 1.1 + 1.3 + 1.8.1 раздела II = 0 И строки 3.1 + 3.3.1 раздела II = 0 И строка 8 раздела XI = 0 ИЛИ строки 1.1 + 1.3 + 1.8.1 раздела II > 0 И строки 3.1 + 3.3.1 раздела II = 0 И строка 8 раздела XI = 0 (условие при котором триннер не срабатывает)";
						ОбластьСтрокаНормативы.Параметры.Факт04_99_72 = 1;
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.72");	
						ОбластьСтрокаНормативы.Область(1, 27 + КолДопКолонок, 2, 27 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_72 = "строки 1.1 + 1.3 + 1.8.1 раздела II = " + Строка(ЗначениеСумма)+";  строки 3.1 + 3.3.1 раздела II = " + Строка(Значение3)+"; строка 8 раздела XI = " + Строка(СтруктураЗначение.Раздел11_8);
					Иначе
						ОбластьСтрокаНормативы.Параметры.Факт04_99_72 = 0;
						ОписаниеУсловия = "";
						ОбластьСтрокаНормативы.Область(1, 27 + КолДопКолонок, 2, 27 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;   
					КонецЕсли;
					
					
					
					//04.99.73  строка 2.2 раздела II / (строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II) × 100% = строке 1 раздела XI
					
					
					Значение = СтруктураЗначение.Раздел2_3_1_1 + СтруктураЗначение.Раздел2_3_1_3 + СтруктураЗначение.Раздел2_3_1_5 + СтруктураЗначение.Раздел2_3_2_1 + СтруктураЗначение.Раздел2_3_2_3 + СтруктураЗначение.Раздел2_3_2_5 ;
					Факт04_99_73 = ?(Значение = 0, 0, окр(СтруктураЗначение.Раздел2_2_2 / Значение*100, 1));
					
					НС_04_99_73 = СтруктураЗначение.Раздел11_1; 
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_73 = НС_04_99_73;   		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_73 = Факт04_99_73;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_73 <> НС_04_99_73 Тогда 
						ОписаниеУсловия = "ФН1 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 28 + КолДопКолонок, 2, 28 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "строка 2.2 раздела II / (строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II) × 100% = " + Строка(Факт04_99_73) + " не равно " + Строка(НС_04_99_73);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.73");	
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_73 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 28 + КолДопКолонок, 2, 28 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;	
					КонецЕсли;
					
					
					//04.99.74 строка 20 раздела IV / (строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II)) × 100% = строке 2 раздела XI
					
					Значение = СтруктураЗначение.Раздел2_3_1_1 + СтруктураЗначение.Раздел2_3_1_3 + СтруктураЗначение.Раздел2_3_1_5 + СтруктураЗначение.Раздел2_3_2_1 + СтруктураЗначение.Раздел2_3_2_3 + СтруктураЗначение.Раздел2_3_2_5 ;
					Факт04_99_74 = ?(Значение = 0, 0, окр(СтруктураЗначение.Раздел4_20 / Значение*100, 1));
					
					НС_04_99_74 = СтруктураЗначение.Раздел11_2; 
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_74 = НС_04_99_74;   		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_74 = Факт04_99_74;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_74 <> НС_04_99_74 Тогда 
						ОписаниеУсловия = "ФН2 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 29 + КолДопКолонок, 2, 29 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "строка 20 раздела IV / (строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II) × 100% = " + Строка(Факт04_99_74) + " не равно " + Строка(НС_04_99_74);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.74");	
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_74 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 29 + КолДопКолонок, 2, 29 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;	
					КонецЕсли;
					
					//04.99.75 строка 26 раздела IV / (строки 1.1 + 1.2 раздела II + строка 35.1 раздела IV) × 100% = строке 3 раздела XI
					
					Значение = СтруктураЗначение.Раздел2_1_1 + СтруктураЗначение.Раздел2_1_2 + СтруктураЗначение.Раздел4_35_1;
					Факт04_99_75 = ?(Значение = 0, 0, окр(СтруктураЗначение.Раздел4_26 / Значение*100, 1));
					НС_04_99_75 = СтруктураЗначение.Раздел11_3; 
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_75 = НС_04_99_75;   		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_75 = Факт04_99_75;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_75 <> НС_04_99_75 Тогда 
						ОписаниеУсловия = "ФН3 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 30 + КолДопКолонок, 2, 30 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "строка 26 раздела IV / (строки 1.1 + 1.2 раздела II + строка 35.1 раздела IV) × 100% = " + Строка(Факт04_99_75) + " не равно " + Строка(НС_04_99_75);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.75");	
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_75 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 30 + КолДопКолонок, 2, 30 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;	
					КонецЕсли;
					
					//04.99.76 строка 2.1 раздела II / (строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II) × 100% = строке 4 раздела XI
					
					Значение = СтруктураЗначение.Раздел2_3_1_1 + СтруктураЗначение.Раздел2_3_1_3 + СтруктураЗначение.Раздел2_3_1_5 + СтруктураЗначение.Раздел2_3_2_1 + СтруктураЗначение.Раздел2_3_2_3 + СтруктураЗначение.Раздел2_3_2_5 ;
					Факт04_99_76 = ?(Значение = 0, 0, окр(СтруктураЗначение.Раздел2_2_1 / Значение*100, 1));
					
					НС_04_99_76 = СтруктураЗначение.Раздел11_4;  		
					ОбластьСтрокаНормативы.Параметры.НС_04_99_76 = НС_04_99_76;    		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_76 = Факт04_99_76;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_76 <> НС_04_99_76 Тогда 
						ОписаниеУсловия = "ФН4 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 31 + КолДопКолонок, 2, 31 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "строка 2.1 раздела II / (строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II) × 100% = " + Строка(Факт04_99_76) + " не равно " + Строка(НС_04_99_76);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.76");	
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_76 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 31 + КолДопКолонок, 2, 31 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;	
					КонецЕсли;
					
					
					//04.99.77 ( (строки 3.1.7 + 3.2.7 раздела II) / (строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II) × 100%  = строке 5 раздела XI
					
					Значение = СтруктураЗначение.Раздел2_3_1_1 + СтруктураЗначение.Раздел2_3_1_3 + СтруктураЗначение.Раздел2_3_1_5 + СтруктураЗначение.Раздел2_3_2_1 + СтруктураЗначение.Раздел2_3_2_3 + СтруктураЗначение.Раздел2_3_2_5 ;
					Факт04_99_77 = ?(Значение = 0, 0, окр((СтруктураЗначение.Раздел2_3_1_7 + СтруктураЗначение.Раздел2_3_2_7)/ Значение*100, 1));
					
					НС_04_99_77 = СтруктураЗначение.Раздел11_5; 
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_77 = НС_04_99_77;    		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_77 = Факт04_99_77;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_77 <> НС_04_99_77 Тогда 
						ОписаниеУсловия = "ФН5 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 32 + КолДопКолонок, 2, 32 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "(строки 3.1.7 + 3.2.7 раздела II) / (строки 3.1.1 + 3.1.3 + 3.1.5 + 3.2.1 + 3.2.3 + 3.2.5 раздела II) × 100%  = " + Строка(Факт04_99_77) + " не равно " + Строка(НС_04_99_77);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.77");	
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_77 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 32 + КолДопКолонок, 2, 32 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;	
					КонецЕсли;
					
					//04.99.78 (строки 1.1.4 + 1.2.4 раздела II) / (строки 2.1 + 3.1.1+3.1.3 + 3.1.5 + 3.1.7 + 3.2.1 + 3.2.3 + 3.2.5 + 3.2.7 раздела II) × 100%  = строке 6 раздела XI
					
					Значение = СтруктураЗначение.Раздел2_2_1 + СтруктураЗначение.Раздел2_3_1_1 + СтруктураЗначение.Раздел2_3_1_3 + СтруктураЗначение.Раздел2_3_1_5 + СтруктураЗначение.Раздел2_3_1_7 + СтруктураЗначение.Раздел2_3_2_1 + СтруктураЗначение.Раздел2_3_2_3 + СтруктураЗначение.Раздел2_3_2_5 + СтруктураЗначение.Раздел2_3_2_7;
					Факт04_99_78 = ?(Значение = 0, 0, окр((СтруктураЗначение.Раздел2_1_1_4 + СтруктураЗначение.Раздел2_1_2_4 )/ Значение*100, 1));
					
					НС_04_99_78 = СтруктураЗначение.Раздел11_6; 
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_78 = НС_04_99_78;    		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_78 = Факт04_99_78;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_78 <> НС_04_99_78 Тогда 
						ОписаниеУсловия = "ФН6 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 33 + КолДопКолонок, 2, 33 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "(строки 1.1.4 + 1.2.4 раздела II) / (строки 2.1 + 3.1.1+3.1.3 + 3.1.5 + 3.1.7 + 3.2.1 + 3.2.3 + 3.2.5 + 3.2.7 раздела II) × 100%  = " + Строка(Факт04_99_78) + " не равно " + Строка(НС_04_99_78);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.78");	
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_78 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 33 + КолДопКолонок, 2, 33 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;	
					КонецЕсли;
					
					
					//04.99.79 (строки 1.12.1.1 + (1.12. - 1.12.1) + 1.3.2 + 1.4.2 +1.1 + 1.2 раздела II) / (3.1.1+3.1.3 + 3.1.5 + 3.1.7 + 3.2.1 + 3.2.3 + 3.2.5 + 3.2.7 раздела II) ×100%  = строке 7 раздела XI
					
					ЗначениеСумма = СтруктураЗначение.Раздел2_1_12_1_1 + СтруктураЗначение.Раздел2_1_12 - СтруктураЗначение.Раздел2_1_12_1+ СтруктураЗначение.Раздел2_1_3_2+ СтруктураЗначение.Раздел2_1_4_2+ СтруктураЗначение.Раздел2_1_1+ СтруктураЗначение.Раздел2_1_2;
					ЗначениеПлюс7 = СтруктураЗначение.Раздел2_3_1_1 + СтруктураЗначение.Раздел2_3_1_3 + СтруктураЗначение.Раздел2_3_1_5 + СтруктураЗначение.Раздел2_3_1_7 + СтруктураЗначение.Раздел2_3_2_1 + СтруктураЗначение.Раздел2_3_2_3 + СтруктураЗначение.Раздел2_3_2_5 + СтруктураЗначение.Раздел2_3_2_7;
					
					Факт04_99_79 = ?(ЗначениеПлюс7 = 0, 0, окр(ЗначениеСумма/ ЗначениеПлюс7*100, 1));
					
					НС_04_99_79 = СтруктураЗначение.Раздел11_7; 
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_79 = НС_04_99_79;    		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_79 = Факт04_99_79;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_79 <> НС_04_99_79 Тогда 
						ОписаниеУсловия = "ФН7 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 34 + КолДопКолонок, 2, 34 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "(строки 1.12.1.1 + (1.12. - 1.12.1) + 1.3.2 + 1.4.2 +1.1 + 1.2 раздела II) / (3.1.1+3.1.3 + 3.1.5 + 3.1.7 + 3.2.1 + 3.2.3 + 3.2.5 + 3.2.7 раздела II) ×100%  = " + Строка(Факт04_99_79) + " не равно " + Строка(НС_04_99_79);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.79");	
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_79 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 34 + КолДопКолонок, 2, 34 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;	
					КонецЕсли;
					
					
					//04.99.80 (строки 1.1 + 1.3+ 1.8.1 раздела II) / (строки 3.1 + 3.3.1 раздела II) × 100%  = строке 8 раздела XI
					
					ЗначениеСумма = СтруктураЗначение.Раздел2_1_1 + СтруктураЗначение.Раздел2_1_3 + СтруктураЗначение.Раздел2_1_8_1;
					Значение = СтруктураЗначение.Раздел2_3_1 + СтруктураЗначение.Раздел2_3_3_1;
					
					Факт04_99_80 = ?(Значение = 0, 0, окр(ЗначениеСумма/ Значение*100, 1));
					
					НС_04_99_80 = СтруктураЗначение.Раздел11_8; 
					
					ОбластьСтрокаНормативы.Параметры.НС_04_99_80 = НС_04_99_80;    		
					ОбластьСтрокаНормативы.Параметры.Факт04_99_80 = Факт04_99_80;
					
					// проверяем		
					// совпадение расчетного и показателя из файла
					Если Факт04_99_80 <> НС_04_99_80 Тогда 
						ОписаниеУсловия = "ФН8 не свпадает с расчетным";	
						ОбластьСтрокаНормативы.Область(1, 35 + КолДопКолонок, 2, 35 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
						ОписаниеОшибки = "(строки 1.1 + 1.3+ 1.8.1 раздела II) / (строки 3.1 + 3.3.1 раздела II) × 100%  = " + Строка(Факт04_99_80) + " не равно " + Строка(НС_04_99_80);
						ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, "04.99.80");	
						
						ОбластьСтрокаНормативы.параметры.Расшифровка04_99_80 = ОписаниеОшибки;
					Иначе
						ОбластьСтрокаНормативы.Область(1, 35 + КолДопКолонок, 2, 35 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;	
					КонецЕсли;  		
					
					
					
					РезультатНормативы.Вывести(ОбластьСтрокаНормативы);  
				КонецЕсли;
			КонецЦикла;     			
		КонецЦикла;
		
	КонецЦикла;
	
	ЭтотОбъект.РезультатНадзорныеСоотношения.ФиксацияСверху = 4;
	ЭтотОбъект.РезультатНадзорныеСоотношения.ФиксацияСлева = 4 + КолДопКолонок; 
	
	//ЭтотОбъект.РезультатКС.ФиксацияСверху = 4;
	//ЭтотОбъект.РезультатКС.ФиксацияСлева = 45 + КолДопКолонок;     
	
	
	
	
	
	
	
КонецПроцедуры 

&НаСервере
Процедура СформироватьНаСервере_До4кв2018()
	
	Отчет.ТаблицаОшибок.Очистить();  	
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет"); 	
	
	ЗапросПоПСК = Новый Запрос;
	МВТ = Новый МенеджерВременныхТаблиц;
	ЗапросПоПСК.МенеджерВременныхТаблиц = МВТ;
	ЗапросПоПСК.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗначенияПСК.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ДокументПСК
	|ИЗ
	|	Документ.ЗначенияПСК КАК ЗначенияПСК
	|ГДЕ
	|	ЗначенияПСК.Проведен = ИСТИНА
	|	И ЗначенияПСК.ДатаОкончанияОтчетногоПериода >= &ДатаОкончания
	|	И ЗначенияПСК.ДатаОкончанияОтчетногоПериода <= &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияПСКРазделыПСК.Раздел КАК Раздел,
	|	ЗначенияПСКРазделыПСК.ЗначениеПСК КАК ЗначениеПСК,
	|	ЗначенияПСКРазделыПСК.ПредельноеЗначениеПСК КАК ПредельноеЗначениеПСК,
	|	ВТ_ДокументПСК.Ссылка.ДатаОкончанияОтчетногоПериода КАК СсылкаДатаОкончанияОтчетногоПериода
	|ПОМЕСТИТЬ ВТ_ЗначенияПСК
	|ИЗ
	|	Документ.ЗначенияПСК.РазделыПСК КАК ЗначенияПСКРазделыПСК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДокументПСК КАК ВТ_ДокументПСК
	|		ПО ЗначенияПСКРазделыПСК.Ссылка = ВТ_ДокументПСК.Ссылка
	|ГДЕ
	|	ЗначенияПСКРазделыПСК.ЗначениеПСК > 0
	|	И ЗначенияПСКРазделыПСК.Ссылка.Проведен = ИСТИНА"; 
	
	Если ВидОтчета = 0 Тогда		
		НачалоПериода = НачалоКвартала(ДатаОкончанияОтчетногоПериода);
		ОкончаниеПериода = КонецКвартала(ДатаОкончанияОтчетногоПериода);
		
		ЗапросПоПСК.УстановитьПараметр("ДатаНачала", ДатаОкончанияОтчетногоПериода);
		ЗапросПоПСК.УстановитьПараметр("ДатаОкончания", ДатаОкончанияОтчетногоПериода);		
		КолДопКолонок = 0;
	Иначе
		НачалоПериода = НачалоМесяца(ПериодОтчета.ДатаНачала);
		ОкончаниеПериода = КонецМесяца(ПериодОтчета.ДатаОкончания);    
		
		ЗапросПоПСК.УстановитьПараметр("ДатаНачала", ПериодОтчета.ДатаНачала);
		ЗапросПоПСК.УстановитьПараметр("ДатаОкончания", ПериодОтчета.ДатаОкончания);	
		КолДопКолонок = 1;
	КонецЕсли;
	
	ЗапросПоПСК.УстановитьПараметр("Раздел6", Справочники.Разделы.Раздел6);
	
	ТЗПоПСК = ЗапросПоПСК.Выполнить().Выгрузить(); 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел.Код = ""2_1""
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел.Код = ""2_1_1""
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_1_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_1_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_1_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_1_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_1_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_1_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_2_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_2_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_2_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_2_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_2_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_2_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_3_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_3_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_3_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_3_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_4)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_4,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_4_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_4_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_4_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_4_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_5)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_5,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_5_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_5_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_5_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_5_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_6)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_6,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_7)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_7,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_7_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_7_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_7_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_7_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_7_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_7_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_8)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_8,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_8_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_8_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_8_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_8_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_8_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_8_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_9)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_9,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_10)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_10,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_11)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_11,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_12)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_12,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_12_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_12_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_12_1_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_12_1_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_12_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_12_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_12_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_12_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_12_4)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_12_4,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_1_13)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_1_13,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_2_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_1_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_2_1_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_1_1_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_2_1_1_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_1_1_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_2_1_1_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_1_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_2_1_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_1_2_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_2_1_2_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_1_2_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_2_1_2_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_2_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_2_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_3_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_2_3_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_2_4)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_2_4,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_1_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_1_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_1_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_1_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_1_2_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_1_2_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_1_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_1_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_1_3_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_1_3_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_1_3_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_1_3_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_1_3_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_1_3_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_2_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_2_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_2_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_2_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_2_2_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_2_2_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_2_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_2_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_2_3_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_2_3_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_2_3_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_2_3_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_2_3_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_2_3_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_3_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_3_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_3_1_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_3_1_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_3_1_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_3_1_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_3_1_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_3_1_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_3_1_4)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_3_1_4,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_3_1_5)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_3_1_5,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел2_3_3_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_3_3_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_4)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_4,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_4_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_4_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_4_1_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_4_1_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_4_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_4_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_4_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_4_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_4_4)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_4_4,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_4_5)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_4_5,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_5)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_5,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_5_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_5_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_5_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_5_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_5_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_5_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_5_3_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_5_3_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_5_4)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_5_4,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_5_5)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_5_5,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_5_6)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_5_6,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_9)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_9,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_9_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_9_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_9_1_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_9_1_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_9_1_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_9_1_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_10)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_10,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_10_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_10_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел3_10_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел3_10_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_11)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_11,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_11_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_11_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_11_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_11_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_12)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_12,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_12_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_12_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_12_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_12_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_13)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_13,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_13_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_13_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_13_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_13_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_14)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_14,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_14_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_14_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_14_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_14_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_14_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_14_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_14_3_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_14_3_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_14_3_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_14_3_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_15)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_15,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_15_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_15_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_15_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_15_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_15_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_15_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_17)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_17,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_17_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_17_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_17_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_17_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_17_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_17_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_17_4)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_17_4,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_17_5)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_17_5,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_18)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_18,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_18_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_18_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_18_1_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_18_1_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_18_1_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_18_1_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_18_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_18_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_18_2_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_18_2_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_18_2_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_18_2_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_19,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_19_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_1_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_19_1_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_19_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_2_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_19_2_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_19_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_3_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_19_3_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_3_1_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_19_3_1_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_3_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_19_3_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_3_2_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_19_3_2_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_3_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_19_3_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_19_3_3_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_19_3_3_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_20)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_20,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_21)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_21,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_22)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_22,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_22_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_22_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_22_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_22_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_23,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_23_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_1_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_23_1_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_23_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_2_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_23_2_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_23_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_3_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_23_3_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_3_1_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_23_3_1_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_3_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_23_3_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_3_2_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_23_3_2_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_3_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_23_3_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_23_3_3_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_23_3_3_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_24)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_24,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_24_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_24_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_24_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_24_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_24_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_24_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_25)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_25,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_25_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_25_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_25_1_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_25_1_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_25_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_25_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_25_2_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_25_2_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_26)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_26,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_27)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_27,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_29)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_29,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_29_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_29_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_29_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_29_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_29_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_29_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_30)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_30,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_30_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_30_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_30_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_30_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_30_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_30_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_31)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_31,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_31_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_31_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_31_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_31_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_31_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_31_3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_32)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_32,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_32_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_32_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_32_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_32_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_33)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_33,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_35)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_35,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_35_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_35_1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел4_35_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел4_35_2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел11_1)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел11_ФН1,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел11_2)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел11_ФН2,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел11_3)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел11_ФН3,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел11_4)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел11_ФН4,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел11_5)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел11_ФН5,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел11_6)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел11_ФН6,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел11_7)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел11_ФН7,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Раздел = ЗНАЧЕНИЕ(Справочник.Разделы.Раздел11_8)
	|				ТОГДА ОтчетностьКПКТаблицаПоказателей.Показатель1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел11_ФН8,
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК КАК КПК,
	|	ЕСТЬNULL(ОтчетностьКПКТаблицаПоказателей.Ссылка, НЕОПРЕДЕЛЕНО) КАК ДокументОтчетности
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	Документ.ОтчетностьКПК.ТаблицаПоказателей КАК ОтчетностьКПКТаблицаПоказателей
	|ГДЕ
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.ДатаОкончанияОтчетногоПериода МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ОтчетностьКПКТаблицаПоказателей.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ОтчетностьКПКТаблицаПоказателей.Ссылка.ИспользоватьДокумент = ИСТИНА
	|	#ОтборПоКПК#
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК,
	|	ЕСТЬNULL(ОтчетностьКПКТаблицаПоказателей.Ссылка, НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК КПК,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1, 0)) КАК Раздел2_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_1, 0)) КАК Раздел2_1_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_1_1, 0)) КАК Раздел2_1_1_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_1_2, 0)) КАК Раздел2_1_1_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_1_3, 0)) КАК Раздел2_1_1_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_2, 0)) КАК Раздел2_1_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_2_1, 0)) КАК Раздел2_1_2_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_2_2, 0)) КАК Раздел2_1_2_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_2_3, 0)) КАК Раздел2_1_2_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_3, 0)) КАК Раздел2_1_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_3_1, 0)) КАК Раздел2_1_3_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_3_2, 0)) КАК Раздел2_1_3_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_4, 0)) КАК Раздел2_1_4,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_4_1, 0)) КАК Раздел2_1_4_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_4_2, 0)) КАК Раздел2_1_4_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_5, 0)) КАК Раздел2_1_5,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_5_1, 0)) КАК Раздел2_1_5_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_5_2, 0)) КАК Раздел2_1_5_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_6, 0)) КАК Раздел2_1_6,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_7, 0)) КАК Раздел2_1_7,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_7_1, 0)) КАК Раздел2_1_7_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_7_2, 0)) КАК Раздел2_1_7_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_7_3, 0)) КАК Раздел2_1_7_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_8, 0)) КАК Раздел2_1_8,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_8_1, 0)) КАК Раздел2_1_8_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_8_2, 0)) КАК Раздел2_1_8_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_8_3, 0)) КАК Раздел2_1_8_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_9, 0)) КАК Раздел2_1_9,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_10, 0)) КАК Раздел2_1_10,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_11, 0)) КАК Раздел2_1_11,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_12, 0)) КАК Раздел2_1_12,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_12_1, 0)) КАК Раздел2_1_12_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_12_1_1, 0)) КАК Раздел2_1_12_1_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_12_2, 0)) КАК Раздел2_1_12_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_12_3, 0)) КАК Раздел2_1_12_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_12_4, 0)) КАК Раздел2_1_12_4,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_1_13, 0)) КАК Раздел2_1_13,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2, 0)) КАК Раздел2_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_1, 0)) КАК Раздел2_2_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_1_1, 0)) КАК Раздел2_2_1_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_1_1_1, 0)) КАК Раздел2_2_1_1_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_1_1_2, 0)) КАК Раздел2_2_1_1_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_1_2, 0)) КАК Раздел2_2_1_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_1_2_1, 0)) КАК Раздел2_2_1_2_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_1_2_2, 0)) КАК Раздел2_2_1_2_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_2, 0)) КАК Раздел2_2_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_3, 0)) КАК Раздел2_2_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_3_1, 0)) КАК Раздел2_2_3_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_2_4, 0)) КАК Раздел2_2_4,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3, 0)) КАК Раздел2_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_1, 0)) КАК Раздел2_3_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_1_1, 0)) КАК Раздел2_3_1_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_1_2, 0)) КАК Раздел2_3_1_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_1_2_1, 0)) КАК Раздел2_3_1_2_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_1_3, 0)) КАК Раздел2_3_1_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_1_3_1, 0)) КАК Раздел2_3_1_3_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_1_3_2, 0)) КАК Раздел2_3_1_3_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_1_3_3, 0)) КАК Раздел2_3_1_3_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_2, 0)) КАК Раздел2_3_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_2_1, 0)) КАК Раздел2_3_2_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_2_2, 0)) КАК Раздел2_3_2_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_2_2_1, 0)) КАК Раздел2_3_2_2_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_2_3, 0)) КАК Раздел2_3_2_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_2_3_1, 0)) КАК Раздел2_3_2_3_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_2_3_2, 0)) КАК Раздел2_3_2_3_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_2_3_3, 0)) КАК Раздел2_3_2_3_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_3, 0)) КАК Раздел2_3_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_3_1, 0)) КАК Раздел2_3_3_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_3_1_1, 0)) КАК Раздел2_3_3_1_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_3_1_2, 0)) КАК Раздел2_3_3_1_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_3_1_3, 0)) КАК Раздел2_3_3_1_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_3_1_4, 0)) КАК Раздел2_3_3_1_4,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_3_1_5, 0)) КАК Раздел2_3_3_1_5,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел2_3_3_2, 0)) КАК Раздел2_3_3_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_4, 0)) КАК Раздел3_4,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_4_1, 0)) КАК Раздел3_4_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_4_1_1, 0)) КАК Раздел3_4_1_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_4_2, 0)) КАК Раздел3_4_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_4_3, 0)) КАК Раздел3_4_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_4_4, 0)) КАК Раздел3_4_4,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_4_5, 0)) КАК Раздел3_4_5,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_5, 0)) КАК Раздел3_5,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_5_1, 0)) КАК Раздел3_5_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_5_2, 0)) КАК Раздел3_5_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_5_3, 0)) КАК Раздел3_5_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_5_3_1, 0)) КАК Раздел3_5_3_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_5_4, 0)) КАК Раздел3_5_4,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_5_5, 0)) КАК Раздел3_5_5,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_5_6, 0)) КАК Раздел3_5_6,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_9, 0)) КАК Раздел3_9,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_9_1, 0)) КАК Раздел3_9_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_9_1_1, 0)) КАК Раздел3_9_1_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_9_1_2, 0)) КАК Раздел3_9_1_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_10, 0)) КАК Раздел3_10,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_10_1, 0)) КАК Раздел3_10_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел3_10_2, 0)) КАК Раздел3_10_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_11, 0)) КАК Раздел4_11,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_11_1, 0)) КАК Раздел4_11_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_11_2, 0)) КАК Раздел4_11_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_12, 0)) КАК Раздел4_12,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_12_1, 0)) КАК Раздел4_12_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_12_2, 0)) КАК Раздел4_12_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_13, 0)) КАК Раздел4_13,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_13_1, 0)) КАК Раздел4_13_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_13_2, 0)) КАК Раздел4_13_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_14, 0)) КАК Раздел4_14,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_14_1, 0)) КАК Раздел4_14_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_14_2, 0)) КАК Раздел4_14_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_14_3, 0)) КАК Раздел4_14_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_14_3_1, 0)) КАК Раздел4_14_3_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_14_3_2, 0)) КАК Раздел4_14_3_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_15, 0)) КАК Раздел4_15,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_15_1, 0)) КАК Раздел4_15_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_15_2, 0)) КАК Раздел4_15_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_15_3, 0)) КАК Раздел4_15_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_17, 0)) КАК Раздел4_17,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_17_1, 0)) КАК Раздел4_17_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_17_2, 0)) КАК Раздел4_17_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_17_3, 0)) КАК Раздел4_17_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_17_4, 0)) КАК Раздел4_17_4,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_17_5, 0)) КАК Раздел4_17_5,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_18, 0)) КАК Раздел4_18,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_18_1, 0)) КАК Раздел4_18_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_18_1_1, 0)) КАК Раздел4_18_1_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_18_1_2, 0)) КАК Раздел4_18_1_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_18_2, 0)) КАК Раздел4_18_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_18_2_1, 0)) КАК Раздел4_18_2_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_18_2_2, 0)) КАК Раздел4_18_2_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19, 0)) КАК Раздел4_19,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_1, 0)) КАК Раздел4_19_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_1_1, 0)) КАК Раздел4_19_1_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_2, 0)) КАК Раздел4_19_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_2_1, 0)) КАК Раздел4_19_2_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_3, 0)) КАК Раздел4_19_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_3_1, 0)) КАК Раздел4_19_3_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_3_1_1, 0)) КАК Раздел4_19_3_1_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_3_2, 0)) КАК Раздел4_19_3_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_3_2_1, 0)) КАК Раздел4_19_3_2_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_3_3, 0)) КАК Раздел4_19_3_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_19_3_3_1, 0)) КАК Раздел4_19_3_3_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_20, 0)) КАК Раздел4_20,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_21, 0)) КАК Раздел4_21,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_22, 0)) КАК Раздел4_22,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_22_1, 0)) КАК Раздел4_22_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_22_2, 0)) КАК Раздел4_22_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23, 0)) КАК Раздел4_23,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_1, 0)) КАК Раздел4_23_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_1_1, 0)) КАК Раздел4_23_1_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_2, 0)) КАК Раздел4_23_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_2_1, 0)) КАК Раздел4_23_2_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_3, 0)) КАК Раздел4_23_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_3_1, 0)) КАК Раздел4_23_3_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_3_1_1, 0)) КАК Раздел4_23_3_1_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_3_2, 0)) КАК Раздел4_23_3_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_3_2_1, 0)) КАК Раздел4_23_3_2_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_3_3, 0)) КАК Раздел4_23_3_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_23_3_3_1, 0)) КАК Раздел4_23_3_3_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_24, 0)) КАК Раздел4_24,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_24_1, 0)) КАК Раздел4_24_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_24_2, 0)) КАК Раздел4_24_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_24_3, 0)) КАК Раздел4_24_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_25, 0)) КАК Раздел4_25,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_25_1, 0)) КАК Раздел4_25_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_25_1_1, 0)) КАК Раздел4_25_1_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_25_2, 0)) КАК Раздел4_25_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_25_2_1, 0)) КАК Раздел4_25_2_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_26, 0)) КАК Раздел4_26,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_27, 0)) КАК Раздел4_27,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_29, 0)) КАК Раздел4_29,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_29_1, 0)) КАК Раздел4_29_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_29_2, 0)) КАК Раздел4_29_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_29_3, 0)) КАК Раздел4_29_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_30, 0)) КАК Раздел4_30,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_30_1, 0)) КАК Раздел4_30_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_30_2, 0)) КАК Раздел4_30_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_30_3, 0)) КАК Раздел4_30_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_31, 0)) КАК Раздел4_31,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_31_1, 0)) КАК Раздел4_31_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_31_2, 0)) КАК Раздел4_31_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_31_3, 0)) КАК Раздел4_31_3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_32, 0)) КАК Раздел4_32,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_32_1, 0)) КАК Раздел4_32_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_32_2, 0)) КАК Раздел4_32_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_33, 0)) КАК Раздел4_33,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_35, 0)) КАК Раздел4_35,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_35_1, 0)) КАК Раздел4_35_1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел4_35_2, 0)) КАК Раздел4_35_2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел11_ФН1, 0)) КАК Раздел11_ФН1,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел11_ФН2, 0)) КАК Раздел11_ФН2,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел11_ФН3, 0)) КАК Раздел11_ФН3,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел11_ФН4, 0)) КАК Раздел11_ФН4,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел11_ФН5, 0)) КАК Раздел11_ФН5,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел11_ФН6, 0)) КАК Раздел11_ФН6,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел11_ФН7, 0)) КАК Раздел11_ФН7,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблица.Раздел11_ФН8, 0)) КАК Раздел11_ФН8,
	|	Контрагенты.НомерВРеестреСРО КАК НомерВРеестреСРО,
	|	НЕ ВременнаяТаблица.КПК ЕСТЬ NULL КАК ЕстьДокумент,
	|	ВременнаяТаблица.ДокументОтчетности КАК ДокументОтчетности
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		#СоединениеПоКПК# СОЕДИНЕНИЕ ВременнаяТаблица КАК ВременнаяТаблица
	|		ПО (ВременнаяТаблица.КПК = Контрагенты.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Контрагенты.Ссылка,
	|	Контрагенты.НомерВРеестреСРО,
	|	НЕ ВременнаяТаблица.КПК ЕСТЬ NULL,
	|	ВременнаяТаблица.ДокументОтчетности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.КПК КАК КПК,
	|	СУММА(ВТ.Раздел11_ФН1) КАК Раздел11_ФН1,
	|	СУММА(ВТ.Раздел11_ФН2) КАК Раздел11_ФН2,
	|	СУММА(ВТ.Раздел11_ФН3) КАК Раздел11_ФН3,
	|	СУММА(ВТ.Раздел11_ФН4) КАК Раздел11_ФН4,
	|	СУММА(ВТ.Раздел11_ФН5) КАК Раздел11_ФН5,
	|	СУММА(ВТ.Раздел11_ФН6) КАК Раздел11_ФН6,
	|	СУММА(ВТ.Раздел11_ФН7) КАК Раздел11_ФН7,
	|	СУММА(ВТ.Раздел11_ФН8) КАК Раздел11_ФН8,
	|	СУММА(ВТ.НомерВРеестреСРО) КАК НомерВРеестреСРО,
	|	ВЫБОР
	|		КОГДА СУММА(ВТ.Раздел2_3_1_1) + СУММА(ВТ.Раздел2_3_1_2) + СУММА(ВТ.Раздел2_3_2_1) + СУММА(ВТ.Раздел2_3_2_2) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ВТ.Раздел2_2_2) / (СУММА(ВТ.Раздел2_3_1_1) + СУММА(ВТ.Раздел2_3_1_2) + СУММА(ВТ.Раздел2_3_2_1) + СУММА(ВТ.Раздел2_3_2_2)) * 100 КАК ЧИСЛО(15, 1))
	|	КОНЕЦ КАК ФН1Расчетный,
	|	ВЫБОР
	|		КОГДА СУММА(ВТ.Раздел2_3_1_1) + СУММА(ВТ.Раздел2_3_1_2) + СУММА(ВТ.Раздел2_3_2_1) + СУММА(ВТ.Раздел2_3_2_2) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((СУММА(ВТ.Раздел4_20) - СУММА(ВТ.Раздел4_21)) / (СУММА(ВТ.Раздел2_3_1_1) + СУММА(ВТ.Раздел2_3_1_2) + СУММА(ВТ.Раздел2_3_2_1) + СУММА(ВТ.Раздел2_3_2_2)) * 100 КАК ЧИСЛО(15, 1))
	|	КОНЕЦ КАК ФН2Расчетный,
	|	ВЫБОР
	|		КОГДА СУММА(ВТ.Раздел2_1_1) + СУММА(ВТ.Раздел2_1_2) + СУММА(ВТ.Раздел4_35_1) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((СУММА(ВТ.Раздел4_26) - СУММА(ВТ.Раздел4_27)) / (СУММА(ВТ.Раздел2_1_1) + СУММА(ВТ.Раздел2_1_2) + СУММА(ВТ.Раздел4_35_1)) * 100 КАК ЧИСЛО(15, 1))
	|	КОНЕЦ КАК ФН3Расчетный,
	|	ВЫБОР
	|		КОГДА СУММА(ВТ.Раздел2_3_1_1) + СУММА(ВТ.Раздел2_3_1_2) + СУММА(ВТ.Раздел2_3_2_1) + СУММА(ВТ.Раздел2_3_2_2) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ВТ.Раздел2_2_1) / (СУММА(ВТ.Раздел2_3_1_1) + СУММА(ВТ.Раздел2_3_1_2) + СУММА(ВТ.Раздел2_3_2_1) + СУММА(ВТ.Раздел2_3_2_2)) * 100 КАК ЧИСЛО(15, 1))
	|	КОНЕЦ КАК ФН4Расчетный,
	|	ВЫБОР
	|		КОГДА СУММА(ВТ.Раздел2_3_1_1) + СУММА(ВТ.Раздел2_3_1_2) + СУММА(ВТ.Раздел2_3_2_1) + СУММА(ВТ.Раздел2_3_2_2) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((СУММА(ВТ.Раздел2_3_1_3) + СУММА(ВТ.Раздел2_3_2_3)) / (СУММА(ВТ.Раздел2_3_1_1) + СУММА(ВТ.Раздел2_3_1_2) + СУММА(ВТ.Раздел2_3_2_1) + СУММА(ВТ.Раздел2_3_2_2)) * 100 КАК ЧИСЛО(15, 1))
	|	КОНЕЦ КАК ФН5Расчетный,
	|	ВЫБОР
	|		КОГДА СУММА(ВТ.Раздел2_2_1) + СУММА(ВТ.Раздел2_3_1) + СУММА(ВТ.Раздел2_3_2) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((СУММА(ВТ.Раздел2_1_1_3) + СУММА(ВТ.Раздел2_1_2_3)) / (СУММА(ВТ.Раздел2_2_1) + СУММА(ВТ.Раздел2_3_1) + СУММА(ВТ.Раздел2_3_2)) * 100 КАК ЧИСЛО(15, 1))
	|	КОНЕЦ КАК ФН6Расчетный,
	|	ВЫБОР
	|		КОГДА СУММА(ВТ.Раздел2_3_1) + СУММА(ВТ.Раздел2_3_2) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((СУММА(ВТ.Раздел2_1_1) + СУММА(ВТ.Раздел2_1_2) + СУММА(ВТ.Раздел2_1_3_2) + СУММА(ВТ.Раздел2_1_4_2) + СУММА(ВТ.Раздел2_1_12_1_1) + СУММА(ВТ.Раздел2_1_12_2) + СУММА(ВТ.Раздел2_1_12_3) + СУММА(ВТ.Раздел2_1_12_4)) / (СУММА(ВТ.Раздел2_3_1) + СУММА(ВТ.Раздел2_3_2)) * 100 КАК ЧИСЛО(15, 1))
	|	КОНЕЦ КАК ФН7Расчетный,
	|	ВЫБОР
	|		КОГДА СУММА(ВТ.Раздел2_3_1) + СУММА(ВТ.Раздел2_3_3) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((СУММА(ВТ.Раздел2_1_1) + СУММА(ВТ.Раздел2_1_3) + СУММА(ВТ.Раздел2_1_8)) / (СУММА(ВТ.Раздел2_3_1) + СУММА(ВТ.Раздел2_3_3)) * 100 КАК ЧИСЛО(15, 1))
	|	КОНЕЦ КАК ФН8Расчетный,
	|	ВТ.ЕстьДокумент КАК ЕстьДокумент,
	|	СУММА(ВТ.Раздел2_1) КАК Раздел2_1,
	|	СУММА(ВТ.Раздел2_1_1) КАК Раздел2_1_1,
	|	СУММА(ВТ.Раздел2_1_1_1) КАК Раздел2_1_1_1,
	|	СУММА(ВТ.Раздел2_1_1_2) КАК Раздел2_1_1_2,
	|	СУММА(ВТ.Раздел2_1_1_3) КАК Раздел2_1_1_3,
	|	СУММА(ВТ.Раздел2_1_2) КАК Раздел2_1_2,
	|	СУММА(ВТ.Раздел2_1_2_1) КАК Раздел2_1_2_1,
	|	СУММА(ВТ.Раздел2_1_2_2) КАК Раздел2_1_2_2,
	|	СУММА(ВТ.Раздел2_1_2_3) КАК Раздел2_1_2_3,
	|	СУММА(ВТ.Раздел2_1_3) КАК Раздел2_1_3,
	|	СУММА(ВТ.Раздел2_1_3_1) КАК Раздел2_1_3_1,
	|	СУММА(ВТ.Раздел2_1_3_2) КАК Раздел2_1_3_2,
	|	СУММА(ВТ.Раздел2_1_4) КАК Раздел2_1_4,
	|	СУММА(ВТ.Раздел2_1_4_1) КАК Раздел2_1_4_1,
	|	СУММА(ВТ.Раздел2_1_4_2) КАК Раздел2_1_4_2,
	|	СУММА(ВТ.Раздел2_1_5) КАК Раздел2_1_5,
	|	СУММА(ВТ.Раздел2_1_5_1) КАК Раздел2_1_5_1,
	|	СУММА(ВТ.Раздел2_1_5_2) КАК Раздел2_1_5_2,
	|	СУММА(ВТ.Раздел2_1_6) КАК Раздел2_1_6,
	|	СУММА(ВТ.Раздел2_1_7) КАК Раздел2_1_7,
	|	СУММА(ВТ.Раздел2_1_7_1) КАК Раздел2_1_7_1,
	|	СУММА(ВТ.Раздел2_1_7_2) КАК Раздел2_1_7_2,
	|	СУММА(ВТ.Раздел2_1_7_3) КАК Раздел2_1_7_3,
	|	СУММА(ВТ.Раздел2_1_8) КАК Раздел2_1_8,
	|	СУММА(ВТ.Раздел2_1_8_1) КАК Раздел2_1_8_1,
	|	СУММА(ВТ.Раздел2_1_8_2) КАК Раздел2_1_8_2,
	|	СУММА(ВТ.Раздел2_1_8_3) КАК Раздел2_1_8_3,
	|	СУММА(ВТ.Раздел2_1_9) КАК Раздел2_1_9,
	|	СУММА(ВТ.Раздел2_1_10) КАК Раздел2_1_10,
	|	СУММА(ВТ.Раздел2_1_11) КАК Раздел2_1_11,
	|	СУММА(ВТ.Раздел2_1_12) КАК Раздел2_1_12,
	|	СУММА(ВТ.Раздел2_1_12_1) КАК Раздел2_1_12_1,
	|	СУММА(ВТ.Раздел2_1_12_1_1) КАК Раздел2_1_12_1_1,
	|	СУММА(ВТ.Раздел2_1_12_2) КАК Раздел2_1_12_2,
	|	СУММА(ВТ.Раздел2_1_12_3) КАК Раздел2_1_12_3,
	|	СУММА(ВТ.Раздел2_1_12_4) КАК Раздел2_1_12_4,
	|	СУММА(ВТ.Раздел2_1_13) КАК Раздел2_1_13,
	|	СУММА(ВТ.Раздел2_2) КАК Раздел2_2,
	|	СУММА(ВТ.Раздел2_2_1) КАК Раздел2_2_1,
	|	СУММА(ВТ.Раздел2_2_1_1) КАК Раздел2_2_1_1,
	|	СУММА(ВТ.Раздел2_2_1_1_1) КАК Раздел2_2_1_1_1,
	|	СУММА(ВТ.Раздел2_2_1_1_2) КАК Раздел2_2_1_1_2,
	|	СУММА(ВТ.Раздел2_2_1_2) КАК Раздел2_2_1_2,
	|	СУММА(ВТ.Раздел2_2_1_2_1) КАК Раздел2_2_1_2_1,
	|	СУММА(ВТ.Раздел2_2_1_2_2) КАК Раздел2_2_1_2_2,
	|	СУММА(ВТ.Раздел2_2_2) КАК Раздел2_2_2,
	|	СУММА(ВТ.Раздел2_2_3) КАК Раздел2_2_3,
	|	СУММА(ВТ.Раздел2_2_3_1) КАК Раздел2_2_3_1,
	|	СУММА(ВТ.Раздел2_2_4) КАК Раздел2_2_4,
	|	СУММА(ВТ.Раздел2_3) КАК Раздел2_3,
	|	СУММА(ВТ.Раздел2_3_1) КАК Раздел2_3_1,
	|	СУММА(ВТ.Раздел2_3_1_1) КАК Раздел2_3_1_1,
	|	СУММА(ВТ.Раздел2_3_1_2) КАК Раздел2_3_1_2,
	|	СУММА(ВТ.Раздел2_3_1_2_1) КАК Раздел2_3_1_2_1,
	|	СУММА(ВТ.Раздел2_3_1_3) КАК Раздел2_3_1_3,
	|	СУММА(ВТ.Раздел2_3_1_3_1) КАК Раздел2_3_1_3_1,
	|	СУММА(ВТ.Раздел2_3_1_3_2) КАК Раздел2_3_1_3_2,
	|	СУММА(ВТ.Раздел2_3_1_3_3) КАК Раздел2_3_1_3_3,
	|	СУММА(ВТ.Раздел2_3_2) КАК Раздел2_3_2,
	|	СУММА(ВТ.Раздел2_3_2_1) КАК Раздел2_3_2_1,
	|	СУММА(ВТ.Раздел2_3_2_2) КАК Раздел2_3_2_2,
	|	СУММА(ВТ.Раздел2_3_2_2_1) КАК Раздел2_3_2_2_1,
	|	СУММА(ВТ.Раздел2_3_2_3) КАК Раздел2_3_2_3,
	|	СУММА(ВТ.Раздел2_3_2_3_1) КАК Раздел2_3_2_3_1,
	|	СУММА(ВТ.Раздел2_3_2_3_2) КАК Раздел2_3_2_3_2,
	|	СУММА(ВТ.Раздел2_3_2_3_3) КАК Раздел2_3_2_3_3,
	|	СУММА(ВТ.Раздел2_3_3) КАК Раздел2_3_3,
	|	СУММА(ВТ.Раздел2_3_3_1) КАК Раздел2_3_3_1,
	|	СУММА(ВТ.Раздел2_3_3_1_1) КАК Раздел2_3_3_1_1,
	|	СУММА(ВТ.Раздел2_3_3_1_2) КАК Раздел2_3_3_1_2,
	|	СУММА(ВТ.Раздел2_3_3_1_3) КАК Раздел2_3_3_1_3,
	|	СУММА(ВТ.Раздел2_3_3_1_4) КАК Раздел2_3_3_1_4,
	|	СУММА(ВТ.Раздел2_3_3_1_5) КАК Раздел2_3_3_1_5,
	|	СУММА(ВТ.Раздел2_3_3_2) КАК Раздел2_3_3_2,
	|	СУММА(ВТ.Раздел3_4) КАК Раздел3_4,
	|	СУММА(ВТ.Раздел3_4_1) КАК Раздел3_4_1,
	|	СУММА(ВТ.Раздел3_4_1_1) КАК Раздел3_4_1_1,
	|	СУММА(ВТ.Раздел3_4_2) КАК Раздел3_4_2,
	|	СУММА(ВТ.Раздел3_4_3) КАК Раздел3_4_3,
	|	СУММА(ВТ.Раздел3_4_4) КАК Раздел3_4_4,
	|	СУММА(ВТ.Раздел3_4_5) КАК Раздел3_4_5,
	|	СУММА(ВТ.Раздел3_5) КАК Раздел3_5,
	|	СУММА(ВТ.Раздел3_5_1) КАК Раздел3_5_1,
	|	СУММА(ВТ.Раздел3_5_2) КАК Раздел3_5_2,
	|	СУММА(ВТ.Раздел3_5_3) КАК Раздел3_5_3,
	|	СУММА(ВТ.Раздел3_5_3_1) КАК Раздел3_5_3_1,
	|	СУММА(ВТ.Раздел3_5_4) КАК Раздел3_5_4,
	|	СУММА(ВТ.Раздел3_5_5) КАК Раздел3_5_5,
	|	СУММА(ВТ.Раздел3_5_6) КАК Раздел3_5_6,
	|	СУММА(ВТ.Раздел3_9) КАК Раздел3_9,
	|	СУММА(ВТ.Раздел3_9_1) КАК Раздел3_9_1,
	|	СУММА(ВТ.Раздел3_9_1_1) КАК Раздел3_9_1_1,
	|	СУММА(ВТ.Раздел3_9_1_2) КАК Раздел3_9_1_2,
	|	СУММА(ВТ.Раздел3_10) КАК Раздел3_10,
	|	СУММА(ВТ.Раздел3_10_1) КАК Раздел3_10_1,
	|	СУММА(ВТ.Раздел3_10_2) КАК Раздел3_10_2,
	|	СУММА(ВТ.Раздел4_11) КАК Раздел4_11,
	|	СУММА(ВТ.Раздел4_11_1) КАК Раздел4_11_1,
	|	СУММА(ВТ.Раздел4_11_2) КАК Раздел4_11_2,
	|	СУММА(ВТ.Раздел4_12) КАК Раздел4_12,
	|	СУММА(ВТ.Раздел4_12_1) КАК Раздел4_12_1,
	|	СУММА(ВТ.Раздел4_12_2) КАК Раздел4_12_2,
	|	СУММА(ВТ.Раздел4_13) КАК Раздел4_13,
	|	СУММА(ВТ.Раздел4_13_1) КАК Раздел4_13_1,
	|	СУММА(ВТ.Раздел4_13_2) КАК Раздел4_13_2,
	|	СУММА(ВТ.Раздел4_14) КАК Раздел4_14,
	|	СУММА(ВТ.Раздел4_14_1) КАК Раздел4_14_1,
	|	СУММА(ВТ.Раздел4_14_2) КАК Раздел4_14_2,
	|	СУММА(ВТ.Раздел4_14_3) КАК Раздел4_14_3,
	|	СУММА(ВТ.Раздел4_14_3_1) КАК Раздел4_14_3_1,
	|	СУММА(ВТ.Раздел4_14_3_2) КАК Раздел4_14_3_2,
	|	СУММА(ВТ.Раздел4_15) КАК Раздел4_15,
	|	СУММА(ВТ.Раздел4_15_1) КАК Раздел4_15_1,
	|	СУММА(ВТ.Раздел4_15_2) КАК Раздел4_15_2,
	|	СУММА(ВТ.Раздел4_15_3) КАК Раздел4_15_3,
	|	СУММА(ВТ.Раздел4_17) КАК Раздел4_17,
	|	СУММА(ВТ.Раздел4_17_1) КАК Раздел4_17_1,
	|	СУММА(ВТ.Раздел4_17_2) КАК Раздел4_17_2,
	|	СУММА(ВТ.Раздел4_17_3) КАК Раздел4_17_3,
	|	СУММА(ВТ.Раздел4_17_4) КАК Раздел4_17_4,
	|	СУММА(ВТ.Раздел4_17_5) КАК Раздел4_17_5,
	|	СУММА(ВТ.Раздел4_18) КАК Раздел4_18,
	|	СУММА(ВТ.Раздел4_18_1) КАК Раздел4_18_1,
	|	СУММА(ВТ.Раздел4_18_1_1) КАК Раздел4_18_1_1,
	|	СУММА(ВТ.Раздел4_18_1_2) КАК Раздел4_18_1_2,
	|	СУММА(ВТ.Раздел4_18_2) КАК Раздел4_18_2,
	|	СУММА(ВТ.Раздел4_18_2_1) КАК Раздел4_18_2_1,
	|	СУММА(ВТ.Раздел4_18_2_2) КАК Раздел4_18_2_2,
	|	СУММА(ВТ.Раздел4_19) КАК Раздел4_19,
	|	СУММА(ВТ.Раздел4_19_1) КАК Раздел4_19_1,
	|	СУММА(ВТ.Раздел4_19_1_1) КАК Раздел4_19_1_1,
	|	СУММА(ВТ.Раздел4_19_2) КАК Раздел4_19_2,
	|	СУММА(ВТ.Раздел4_19_2_1) КАК Раздел4_19_2_1,
	|	СУММА(ВТ.Раздел4_19_3) КАК Раздел4_19_3,
	|	СУММА(ВТ.Раздел4_19_3_1) КАК Раздел4_19_3_1,
	|	СУММА(ВТ.Раздел4_19_3_1_1) КАК Раздел4_19_3_1_1,
	|	СУММА(ВТ.Раздел4_19_3_2) КАК Раздел4_19_3_2,
	|	СУММА(ВТ.Раздел4_19_3_2_1) КАК Раздел4_19_3_2_1,
	|	СУММА(ВТ.Раздел4_19_3_3) КАК Раздел4_19_3_3,
	|	СУММА(ВТ.Раздел4_19_3_3_1) КАК Раздел4_19_3_3_1,
	|	СУММА(ВТ.Раздел4_20) КАК Раздел4_20,
	|	СУММА(ВТ.Раздел4_21) КАК Раздел4_21,
	|	СУММА(ВТ.Раздел4_22) КАК Раздел4_22,
	|	СУММА(ВТ.Раздел4_22_1) КАК Раздел4_22_1,
	|	СУММА(ВТ.Раздел4_22_2) КАК Раздел4_22_2,
	|	СУММА(ВТ.Раздел4_23) КАК Раздел4_23,
	|	СУММА(ВТ.Раздел4_23_1) КАК Раздел4_23_1,
	|	СУММА(ВТ.Раздел4_23_1_1) КАК Раздел4_23_1_1,
	|	СУММА(ВТ.Раздел4_23_2) КАК Раздел4_23_2,
	|	СУММА(ВТ.Раздел4_23_2_1) КАК Раздел4_23_2_1,
	|	СУММА(ВТ.Раздел4_23_3) КАК Раздел4_23_3,
	|	СУММА(ВТ.Раздел4_23_3_1) КАК Раздел4_23_3_1,
	|	СУММА(ВТ.Раздел4_23_3_1_1) КАК Раздел4_23_3_1_1,
	|	СУММА(ВТ.Раздел4_23_3_2) КАК Раздел4_23_3_2,
	|	СУММА(ВТ.Раздел4_23_3_2_1) КАК Раздел4_23_3_2_1,
	|	СУММА(ВТ.Раздел4_23_3_3) КАК Раздел4_23_3_3,
	|	СУММА(ВТ.Раздел4_23_3_3_1) КАК Раздел4_23_3_3_1,
	|	СУММА(ВТ.Раздел4_24) КАК Раздел4_24,
	|	СУММА(ВТ.Раздел4_24_1) КАК Раздел4_24_1,
	|	СУММА(ВТ.Раздел4_24_2) КАК Раздел4_24_2,
	|	СУММА(ВТ.Раздел4_24_3) КАК Раздел4_24_3,
	|	СУММА(ВТ.Раздел4_25) КАК Раздел4_25,
	|	СУММА(ВТ.Раздел4_25_1) КАК Раздел4_25_1,
	|	СУММА(ВТ.Раздел4_25_1_1) КАК Раздел4_25_1_1,
	|	СУММА(ВТ.Раздел4_25_2) КАК Раздел4_25_2,
	|	СУММА(ВТ.Раздел4_25_2_1) КАК Раздел4_25_2_1,
	|	СУММА(ВТ.Раздел4_26) КАК Раздел4_26,
	|	СУММА(ВТ.Раздел4_27) КАК Раздел4_27,
	|	СУММА(ВТ.Раздел4_29) КАК Раздел4_29,
	|	СУММА(ВТ.Раздел4_29_1) КАК Раздел4_29_1,
	|	СУММА(ВТ.Раздел4_29_2) КАК Раздел4_29_2,
	|	СУММА(ВТ.Раздел4_29_3) КАК Раздел4_29_3,
	|	СУММА(ВТ.Раздел4_30) КАК Раздел4_30,
	|	СУММА(ВТ.Раздел4_30_1) КАК Раздел4_30_1,
	|	СУММА(ВТ.Раздел4_30_2) КАК Раздел4_30_2,
	|	СУММА(ВТ.Раздел4_30_3) КАК Раздел4_30_3,
	|	СУММА(ВТ.Раздел4_31) КАК Раздел4_31,
	|	СУММА(ВТ.Раздел4_31_1) КАК Раздел4_31_1,
	|	СУММА(ВТ.Раздел4_31_2) КАК Раздел4_31_2,
	|	СУММА(ВТ.Раздел4_32) КАК Раздел4_32,
	|	СУММА(ВТ.Раздел4_32_1) КАК Раздел4_32_1,
	|	СУММА(ВТ.Раздел4_32_2) КАК Раздел4_32_2,
	|	СУММА(ВТ.Раздел4_33) КАК Раздел4_33,
	|	СУММА(ВТ.Раздел4_31_3) КАК Раздел4_31_3,
	|	СУММА(ВТ.Раздел4_35) КАК Раздел4_35,
	|	СУММА(ВТ.Раздел4_35_1) КАК Раздел4_35_1,
	|	СУММА(ВТ.Раздел4_35_2) КАК Раздел4_35_2,
	|	СУММА(ВТ.Раздел11_ФН1) КАК Раздел11_ФН11,
	|	СУММА(ВТ.Раздел11_ФН2) КАК Раздел11_ФН21,
	|	СУММА(ВТ.Раздел11_ФН3) КАК Раздел11_ФН31,
	|	СУММА(ВТ.Раздел11_ФН4) КАК Раздел11_ФН41,
	|	СУММА(ВТ.Раздел11_ФН5) КАК Раздел11_ФН51,
	|	СУММА(ВТ.Раздел11_ФН6) КАК Раздел11_ФН61,
	|	СУММА(ВТ.Раздел11_ФН7) КАК Раздел11_ФН71,
	|	СУММА(ВТ.Раздел11_ФН8) КАК Раздел11_ФН81,
	|	ВТ.НомерВРеестреСРО КАК НомерВРеестреСРО1,
	|	ВТ.ДокументОтчетности КАК ДокументОтчетности,
	|	ВТ.ДокументОтчетности.ДатаОкончанияОтчетногоПериода КАК ДатаОкончанияОтчетногоПериода
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.КПК,
	|	ВТ.ЕстьДокумент,
	|	ВТ.НомерВРеестреСРО,
	|	ВТ.ДокументОтчетности,
	|	ВТ.ДокументОтчетности.ДатаОкончанияОтчетногоПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерВРеестреСРО,
	|	ДатаОкончанияОтчетногоПериода";
	
	ОтборПоКПК = "";
	
	Если ВидОтчета = 0 Тогда		
		СоединениеПоКПК = "ЛЕВОЕ";
		Запрос.УстановитьПараметр("ДатаНачала", ДатаОкончанияОтчетногоПериода);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончанияОтчетногоПериода);	
	Иначе                                            		
		Запрос.УстановитьПараметр("ДатаНачала", ПериодОтчета.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ПериодОтчета.ДатаОкончания);	
		Запрос.УстановитьПараметр("СписокКПК", СписокКПК);	    
		
		ОтборПоКПК = "И ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК В (&СписокКПК)";
		СоединениеПоКПК = "ВНУТРЕННЕЕ";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ОтборПоКПК#", ОтборПоКПК);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#СоединениеПоКПК#", СоединениеПоКПК);
	
	
	РезультатЗапроса = Запрос.Выполнить(); 	
	
	// Запрос для раздлелов 7 и 8
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка КАК ДокументОтчетности,
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.ДатаОкончанияОтчетногоПериода КАК ДатаОкончанияОтчетногоПериода,
	|	ОтчетностьКПКТаблицаПоказателей.Раздел КАК Раздел,
	|	СУММА(ЕСТЬNULL(ОтчетностьКПКТаблицаПоказателей.Показатель1, 0)) КАК Графа3,
	|	СУММА(ЕСТЬNULL(ОтчетностьКПКТаблицаПоказателей.Показатель2, 0)) КАК Графа4,
	|	СУММА(ЕСТЬNULL(ОтчетностьКПКТаблицаПоказателей.Показатель3, 0)) КАК Графа5,
	|	СУММА(ЕСТЬNULL(ОтчетностьКПКТаблицаПоказателей.Показатель4, 0)) КАК Графа6,
	|	СУММА(ЕСТЬNULL(ОтчетностьКПКТаблицаПоказателей.Показатель5, 0)) КАК Графа7,
	|	СУММА(ЕСТЬNULL(ОтчетностьКПКТаблицаПоказателей.Показатель6, 0)) КАК Графа8,
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК КАК КПК,
	|	ОтчетностьКПКТаблицаПоказателей.Раздел КАК РазделДляРасчета
	|ИЗ
	|	Документ.ОтчетностьКПК.ТаблицаПоказателей КАК ОтчетностьКПКТаблицаПоказателей
	|ГДЕ
	|	ОтчетностьКПКТаблицаПоказателей.Раздел В(&СписокРазделов)
	|	И ОтчетностьКПКТаблицаПоказателей.Ссылка.ДатаОкончанияОтчетногоПериода МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ОтчетностьКПКТаблицаПоказателей.Ссылка.Проведен = ИСТИНА
	|	#ОтборПоКПК#
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка,
	|	ОтчетностьКПКТаблицаПоказателей.Раздел,
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК,
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.ДатаОкончанияОтчетногоПериода,
	|	ОтчетностьКПКТаблицаПоказателей.Раздел
	
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК.НомерВРеестреСРО,
	|	ДатаОкончанияОтчетногоПериода"; 		
	
	СписокРазделов = Новый Массив;
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_1_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_2_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_3_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_4_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_5_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_6_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_7_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_8_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_9_1);
	
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_1_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_2_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_3_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_4_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_5_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_6_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_7_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_8_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел7_9_2);
	
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_1_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_2_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_3_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_4_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_5_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_6_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_7_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_8_1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_9_1);
	
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_1_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_2_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_3_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_4_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_5_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_6_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_7_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_8_2);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел8_9_2);
	
	ОтборПоКПК = "";
	Если ВидОтчета = 0 Тогда			
		Запрос.УстановитьПараметр("ДатаНачала", ДатаОкончанияОтчетногоПериода);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончанияОтчетногоПериода);	
	Иначе                                            		
		Запрос.УстановитьПараметр("ДатаНачала", ПериодОтчета.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ПериодОтчета.ДатаОкончания);	
		Запрос.УстановитьПараметр("СписокКПК", СписокКПК);	    
		
		ОтборПоКПК = "И ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК В (&СписокКПК)";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ОтборПоКПК#", ОтборПоКПК);
	
	Запрос.УстановитьПараметр("СписокРазделов", СписокРазделов);       	
	
	
	ТЗразделы7_8 = Запрос.Выполнить().Выгрузить();
	
	// добавляем строку для посик КПК и ДатаОкончания
	СРО_ЗагрузкаОтчетности.ЗаполнитьКОлонкуДЛляПоиска(ТЗразделы7_8);
	
	
	
	
	ЗапросРаздел10 = Новый Запрос;
	ЗапросРаздел10.Текст = "ВЫБРАТЬ
	|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Ссылка КАК ДокументОтчетности,
	|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Ссылка.КПК КАК КПК,
	|	СУММА(ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.РазмерОбязательствНаКонецОтчетногоПериода) КАК РазмерОбязательствНаКонецОтчетногоПериода,
	|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.ВидДоговора КАК ВидДоговора,
	|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.КодРаздела КАК КодРаздела,
	|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Ссылка.ДатаОкончанияОтчетногоПериода КАК ДатаОкончанияОтчетногоПериода
	|ИЗ
	|	Документ.ОтчетностьКПК.ТаблицаДоговоровОдобренныхОбщимСобранием КАК ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием
	|ГДЕ
	|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Ссылка.ДатаОкончанияОтчетногоПериода МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Ссылка.Проведен = ИСТИНА
	|	И ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.КодРаздела <> """"
	|	#ОтборПоКПК#
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Ссылка,
	|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.ВидДоговора,
	|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.КодРаздела,
	|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Ссылка.ДатаОкончанияОтчетногоПериода";
	
	
	ОтборПоКПК = "";
	Если ВидОтчета = 0 Тогда			
		ЗапросРаздел10.УстановитьПараметр("ДатаНачала", ДатаОкончанияОтчетногоПериода);
		ЗапросРаздел10.УстановитьПараметр("ДатаОкончания", ДатаОкончанияОтчетногоПериода);	
	Иначе                                            		
		ЗапросРаздел10.УстановитьПараметр("ДатаНачала", ПериодОтчета.ДатаНачала);
		ЗапросРаздел10.УстановитьПараметр("ДатаОкончания", ПериодОтчета.ДатаОкончания);	
		ЗапросРаздел10.УстановитьПараметр("СписокКПК", СписокКПК);	    	
		ОтборПоКПК = "И ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Ссылка.КПК В (&СписокКПК)";
	КонецЕсли;
	
	ЗапросРаздел10.Текст = СтрЗаменить(ЗапросРаздел10.Текст, "#ОтборПоКПК#", ОтборПоКПК);
	
	
	ТЗРаздел10 = ЗапросРаздел10.Выполнить().Выгрузить();
	СРО_ЗагрузкаОтчетности.ЗаполнитьКОлонкуДЛляПоиска(ТЗРаздел10);
	
	
	
	
	// 2 Надзорное соотношение
	Цвет_ОшибкаВПоказателях = Новый Цвет(255, 203, 203);
	
	РезультатНадзорныеСоотношения.Очистить();
	
	Если ВидОтчета = 0 Тогда
		Макет = ОтчетОбъект.ПолучитьМакет("МакетКонтрольныеСоотношения");
	Иначе	
		Макет = ОтчетОбъект.ПолучитьМакет("МакетКонтрольныеСоотношенияПериод");
	КонецЕсли;
	
	ОбластьШапка = Макет.получитьОбласть("Шапка");
	
	ОбластьШапка.Параметры.ПредставлениеПериода = ПредставлениеПериода(НачалоПериода, ОкончаниеПериода);
	РезультатНадзорныеСоотношения.Вывести(ОбластьШапка);
	
	ОбластьСтрока = Макет.получитьОбласть("Строка"); 	
	
	// 3. КС
	
	РезультатКС.Очистить();
	
	Если ВидОтчета = 0 Тогда
		Макет = ОтчетОбъект.ПолучитьМакет("МакетКС");
	Иначе
		Макет = ОтчетОбъект.ПолучитьМакет("МакетКСПериод");		
	КонецЕсли;
	
	ОбластьШапка = Макет.получитьОбласть("Шапка");
	
	ОбластьШапка.Параметры.ПредставлениеПериода = ПредставлениеПериода(НачалоПериода, ОкончаниеПериода);
	РезультатКС.Вывести(ОбластьШапка);
	ОбластьСтрокаКС = Макет.получитьОбласть("Строка"); 	
	
	
	// Графа 4 раздел 6
	
	ЗапроРаздел6Графа4 = Новый Запрос;
	ЗапроРаздел6Графа4.Текст = "ВЫБРАТЬ
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка КАК ДокументОтчетности,
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК КАК КПК,
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка.ДатаОкончанияОтчетногоПериода КАК ДатаОкончанияОтчетногоПериода,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетностьКПКТаблицаПоказателей.Показатель2 = -99999
	|				ТОГДА 0
	|			ИНАЧЕ ОтчетностьКПКТаблицаПоказателей.Показатель2
	|		КОНЕЦ) КАК Графа4
	|ИЗ
	|	Документ.ОтчетностьКПК.ТаблицаПоказателей КАК ОтчетностьКПКТаблицаПоказателей
	|ГДЕ
	|	ОтчетностьКПКТаблицаПоказателей.Раздел В ИЕРАРХИИ(&Раздел)
	|	И ОтчетностьКПКТаблицаПоказателей.Ссылка.ДатаОкончанияОтчетногоПериода МЕЖДУ &ДатаНачала И &ДатаОкончания  
	|	#ОтборПоКПК#
	
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка";
	
	ОтборПоКПК = "";
	Если ВидОтчета = 0 Тогда			
		ЗапроРаздел6Графа4.УстановитьПараметр("ДатаНачала", ДатаОкончанияОтчетногоПериода);
		ЗапроРаздел6Графа4.УстановитьПараметр("ДатаОкончания", ДатаОкончанияОтчетногоПериода);	
	Иначе                                            		
		ЗапроРаздел6Графа4.УстановитьПараметр("ДатаНачала", ПериодОтчета.ДатаНачала);
		ЗапроРаздел6Графа4.УстановитьПараметр("ДатаОкончания", ПериодОтчета.ДатаОкончания);	
		ЗапроРаздел6Графа4.УстановитьПараметр("СписокКПК", СписокКПК);	    	
		ОтборПоКПК = "И ОтчетностьКПКТаблицаПоказателей.Ссылка.КПК В (&СписокКПК)";
	КонецЕсли;
	
	ЗапроРаздел6Графа4.Текст = СтрЗаменить(ЗапроРаздел6Графа4.Текст, "#ОтборПоКПК#", ОтборПоКПК); 	
	ЗапроРаздел6Графа4.УстановитьПараметр("Раздел", Справочники.Разделы.Раздел6);
	
	ТЗРаздел6Графа4 = ЗапроРаздел6Графа4.Выполнить().Выгрузить();
	СРО_ЗагрузкаОтчетности.ЗаполнитьКОлонкуДЛляПоиска(ТЗРаздел6Графа4);
	
	
	
	// выводим строки
	
	
	СтрокаЧетная = Ложь;
	
	НомерСтроки = 0;
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		Если ВыводитьТолькоКПКСОтчетностью И  НЕ Выборка.ЕстьДокумент Тогда
			Продолжить;			
		КонецЕсли;
		
		НомерСтроки = НомерСтроки +1;
		
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		
		ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
		ОбластьСтрока.Параметры.КраткоеНазваниеКПК = Выборка.КПК.НаименованиеКраткое;
		
		Если ВидОтчета = 1 Тогда
			ОбластьСтрока.Параметры.ПериодОтчетности = СРО_ЗагрузкаОтчетности.ПолучитьПредставлениеДатыотчета(Выборка.ДатаОкончанияОтчетногоПериода);
		КонецЕсли;
		
		
		Если СтрокаЧетная Тогда
			ЦветФонаСтроки = WebЦвета.ШелковыйОттенок;
		Иначе
			ЦветФонаСтроки = WebЦвета.Белый;
		КонецЕсли;
		
		СтрокаЧетная = ?(СтрокаЧетная, Ложь, Истина);  	
		ОбластьСтрока.Область(1, 1, 1, 66 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;	
		
		Если Выборка.ДокументОтчетности = null Тогда   			
			ОбластьСтрока.Параметры.ДокументОтчетности  = "Нет документа";
			ОбластьСтрока.Область(1, 3, 1, 3).ЦветТекста = WebЦвета.Черный;				
		Иначе	
			ОбластьСтрока.Параметры.ДокументОтчетности  = Выборка.ДокументОтчетности;
			ОбластьСтрока.Область(1, 3, 1, 3).ЦветТекста =  WebЦвета.Синий;
		КонецЕсли;
		
		
		
		// проверки
		
		ВсегоОшибок = 0;
		
		НазваниеТаблицы = "НадзорныеСоотношения";
		
		// 1) (строка 3.3.1 раздела II) < (строки 3.3.1.1+ 3.3.1.2+ 3.3.1.3+ 3.3.1.4+ 3.3.1.5 раздела II)
		Если Выборка.Раздел2_3_3_1 < Выборка.Раздел2_3_3_1_1 + Выборка.Раздел2_3_3_1_2 + Выборка.Раздел2_3_3_1_3 + Выборка.Раздел2_3_3_1_4 + Выборка.Раздел2_3_3_1_5 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Параметры.Проверка1 = "1";
			ОбластьСтрока.Область(1, 5 + КолДопКолонок, 1, 5 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
			
			
			ОписаниеУсловия = "(строка 3.3.1 раздела II) < (строки 3.3.1.1+ 3.3.1.2+ 3.3.1.3+ 3.3.1.4+ 3.3.1.5 раздела II)";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_3_1 )+" < " + Строка(Выборка.Раздел2_3_3_1_1) + " + " +Строка(Выборка.Раздел2_3_3_1_2) + " + " +Строка(Выборка.Раздел2_3_3_1_3) + " + " + Строка(Выборка.Раздел2_3_3_1_4) + " + " + Строка(Выборка.Раздел2_3_3_1_5);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);
			
		Иначе
			ОбластьСтрока.Параметры.Проверка1 = "0";
		КонецЕсли; 	
		
		// 2) если (строка 3.3.1.1 раздела II > 0), то (строки 3.1.1+ 3.2.1) =0
		//ОбластьСтрока.Параметры.Раздел2_3_3_1_1 = Выборка.Раздел2_3_3_1_1;
		ОбластьСтрока.Параметры.Сумма_311_321 = Выборка.Раздел2_3_1_1 + Выборка.Раздел2_3_2_1;
		
		Если Выборка.Раздел2_3_3_1_1 > 0 И (Выборка.Раздел2_3_1_1 + Выборка.Раздел2_3_2_1 = 0) Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 6 + КолДопКолонок, 1, 7 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;       			
			
			ОписаниеУсловия = "если (строка 3.3.1.1 раздела II > 0), то (строки 3.1.1+ 3.2.1) = 0";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_3_1_1 )+" > 0; строки 3.1.1+ 3.2.1 = " + Строка(Выборка.Раздел2_3_1_1) + " + " + Строка(Выборка.Раздел2_3_2_1);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);
			
		КонецЕсли;
		
		// 3) если (строка 3.3.1.2 раздела II > 0), то (строки 3.1.2+ 3.2.2) =0
		//ОбластьСтрока.Параметры.Раздел2_3_3_1_2 = Выборка.Раздел2_3_3_1_2;
		ОбластьСтрока.Параметры.Сумма_312_322 = Выборка.Раздел2_3_1_2 + Выборка.Раздел2_3_2_2;
		
		Если Выборка.Раздел2_3_3_1_2 > 0 И (Выборка.Раздел2_3_1_2 + Выборка.Раздел2_3_2_2 = 0) Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   			
			ОбластьСтрока.Область(1, 8 + КолДопКолонок, 1, 9 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
			
			ОписаниеУсловия = " если (строка 3.3.1.2 раздела II > 0), то (строки 3.1.2+ 3.2.2) = 0";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_3_1_2 )+" > 0; (строки 3.1.2+ 3.2.2) = " + Строка(Выборка.Раздел2_3_1_2) + " + " + Строка(Выборка.Раздел2_3_2_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);
			
		КонецЕсли;
		
		
		// 4) если (строка 3.3.1.3 раздела II > 0), то (строки 3.1.3.1+ 3.2.3.1) =0
		//ОбластьСтрока.Параметры.Раздел2_3_3_1_3 = Выборка.Раздел2_3_3_1_3;
		ОбластьСтрока.Параметры.Сумма_3131_3231 = Выборка.Раздел2_3_1_3_1 + Выборка.Раздел2_3_2_3_1;
		
		Если Выборка.Раздел2_3_3_1_3 > 0 И (Выборка.Раздел2_3_1_3_1 + Выборка.Раздел2_3_2_3_1 = 0) Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 10 + КолДопКолонок, 1, 11 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;  
			
			ОписаниеУсловия = "если (строка 3.3.1.3 раздела II > 0), то (строки 3.1.3.1+ 3.2.3.1) = 0";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_3_1_3 )+" > 0; строки 3.1.3.1+ 3.2.3.1 = " + Строка(Выборка.Раздел2_3_1_3_1) + " + " + Строка(Выборка.Раздел2_3_2_3_1);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);
			
		КонецЕсли;
		
		// 5) если (строка 3.3.1.4 раздела II > 0), то (строки 3.1.3.2+ 3.2.3.2) =0
		//ОбластьСтрока.Параметры.Раздел2_3_3_1_4 = Выборка.Раздел2_3_3_1_4;
		ОбластьСтрока.Параметры.Сумма_3132_3232 = Выборка.Раздел2_3_1_3_2 + Выборка.Раздел2_3_2_3_2;
		
		Если Выборка.Раздел2_3_3_1_4 > 0 И (Выборка.Раздел2_3_1_3_2 + Выборка.Раздел2_3_2_3_2 = 0) Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 12 + КолДопКолонок, 1, 13 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
			
			ОписаниеУсловия = "если (строка 3.3.1.4 раздела II > 0), то (строки 3.1.3.2+ 3.2.3.2) =0";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_3_1_4 )+" > 0; строки 3.1.3.2+ 3.2.3.2 = " + Строка(Выборка.Раздел2_3_1_3_2) + " + " + Строка(Выборка.Раздел2_3_2_3_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);
			
		КонецЕсли;
		
		// 6) если (строка 3.3.1.5 раздела II > 0), то (строки 3.1.3.3+ 3.2.3.3) =0
		//ОбластьСтрока.Параметры.Раздел2_3_3_1_5 = Выборка.Раздел2_3_3_1_5;
		ОбластьСтрока.Параметры.Сумма_3133_3233 = Выборка.Раздел2_3_1_3_3 + Выборка.Раздел2_3_2_3_3;
		
		Если Выборка.Раздел2_3_3_1_5 > 0 И (Выборка.Раздел2_3_1_3_3 + Выборка.Раздел2_3_2_3_3 = 0) Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 14 + КолДопКолонок, 1, 15 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;
			
			ОписаниеУсловия = "если (строка 3.3.1.5 раздела II > 0), то (строки 3.1.3.3+ 3.2.3.3) =0";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_3_1_5 )+" > 0; строки  3.1.3.3+ 3.2.3.3 = " + Строка(Выборка.Раздел2_3_1_3_3) + " + " + Строка(Выборка.Раздел2_3_2_3_3);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);
			
		КонецЕсли; 		
		
		
		// 7)если (строки 3.1 + 3.2 раздела II) > 0, то строка 14 раздела IV = 0
		ОбластьСтрока.Параметры.Сумма_31_32 = Выборка.Раздел2_3_1 + Выборка.Раздел2_3_2;
		//ОбластьСтрока.Параметры.Раздел4_14 = Выборка.Раздел4_14;
		
		Если (Выборка.Раздел2_3_1 + Выборка.Раздел2_3_2) > 0 И Выборка.Раздел4_14 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 16 + КолДопКолонок, 1, 17 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
			
			ОписаниеУсловия = "если (строки 3.1 + 3.2 раздела II) > 0, то строка 14 раздела IV = 0";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_1 ) + " + " + сТРОКА(Строка(Выборка.Раздел2_3_2 ))+" > 0; строка 14 = " + Строка(Выборка.Раздел4_14) ;
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);  	
			
		КонецЕсли;
		
		// 8) если (строки 3.1.1 + 3.2.1 раздела II) > 0, то строка 14.1 раздела IV = 0
		ОбластьСтрока.Параметры.Сумма_311_321 = Выборка.Раздел2_3_1_1 + Выборка.Раздел2_3_2_1;
		//ОбластьСтрока.Параметры.Раздел4_14_1 = Выборка.Раздел4_14_1;
		
		Если (Выборка.Раздел2_3_1_1 + Выборка.Раздел2_3_2_1) > 0 И Выборка.Раздел4_14_1 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 18 + КолДопКолонок, 1, 19 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
			
			ОписаниеУсловия = "если (строки 3.1.1 + 3.2.1 раздела II) > 0, то строка 14.1 раздела IV = 0";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_1_1 ) + " + " + Строка(Строка(Выборка.Раздел2_3_1_1 ))+" > 0; строка 14.1 = " + Строка(Выборка.Раздел4_14_1) ;
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);  	
		КонецЕсли;
		
		// 9) если (строки 3.1.2 + 3.2.2 раздела II) > 0, то строка 14.2 раздела IV = 0
		ОбластьСтрока.Параметры.Сумма_312_322 = Выборка.Раздел2_3_1_2 + Выборка.Раздел2_3_2_2;
		//ОбластьСтрока.Параметры.Раздел4_14_2 = Выборка.Раздел4_14_2;
		
		Если (Выборка.Раздел2_3_1_2 + Выборка.Раздел2_3_2_2) > 0 И Выборка.Раздел4_14_2 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 20 + КолДопКолонок, 1, 21 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;
			
			ОписаниеУсловия = "если (строки 3.1.2 + 3.2.2 раздела II) > 0, то строка 14.2 раздела IV = 0";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_1_2 ) + " + " + Строка(Строка(Выборка.Раздел2_3_2_2 ))+" > 0; строка 14.2 = " + Строка(Выборка.Раздел4_14_2) ;
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);  	
		КонецЕсли;
		
		
		// 10) если (строки 3.1.3 + 3.2.3 раздела II) > 0, то строка 14.3 раздела IV = 0
		ОбластьСтрока.Параметры.Сумма_313_323 = Выборка.Раздел2_3_1_3 + Выборка.Раздел2_3_2_3;
		//ОбластьСтрока.Параметры.Раздел4_14_3 = Выборка.Раздел4_14_3;
		
		Если (Выборка.Раздел2_3_1_3 + Выборка.Раздел2_3_2_3) > 0 И Выборка.Раздел4_14_3 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 22 + КолДопКолонок, 1, 23 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   		
			
			ОписаниеУсловия = "если (строки 3.1.3 + 3.2.3 раздела II) > 0, то строка 14.3 раздела IV = 0";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_1_3 ) + " + " + Строка(Строка(Выборка.Раздел2_3_2_3 ))+" > 0; строка 14.3 = " + Строка(Выборка.Раздел4_14_3) ;
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);  	
		КонецЕсли;
		
		// 11) если (строки 3.1.3.1 + 3.2.3.1  раздела II) > 0, то строка 14.3.1 раздела IV = 0
		ОбластьСтрока.Параметры.Сумма_3131_3231 = Выборка.Раздел2_3_1_3_1 + Выборка.Раздел2_3_2_3_1;
		//ОбластьСтрока.Параметры.Раздел4_14_3_1 = Выборка.Раздел4_14_3_1;
		
		Если (Выборка.Раздел2_3_1_3_1 + Выборка.Раздел2_3_2_3_1) > 0 И Выборка.Раздел4_14_3_1 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 24 + КолДопКолонок, 1, 25 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   		
			
			ОписаниеУсловия = "если (строки 3.1.3.1 + 3.2.3.1  раздела II) > 0, то строка 14.3.1 раздела IV = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_1_3_1 ) + " + " + Строка(Строка(Выборка.Раздел2_3_2_3_1 ))+" > 0; строка 14.3.1 = " + Строка(Выборка.Раздел4_14_3_1) ;
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);  	
		КонецЕсли;
		
		// 12) если (строки 3.1.3.2 + 3.2.3.2  раздела II) > 0, то строка 14.3.2 раздела IV = 0
		ОбластьСтрока.Параметры.Сумма_3132_3232 = Выборка.Раздел2_3_1_3_2 + Выборка.Раздел2_3_2_3_2;
		//ОбластьСтрока.Параметры.Раздел4_14_3_2 = Выборка.Раздел4_14_3_2;
		
		Если (Выборка.Раздел2_3_1_3_2 + Выборка.Раздел2_3_2_3_2) > 0 И Выборка.Раздел4_14_3_2 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 26 + КолДопКолонок, 1, 27 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
			
			ОписаниеУсловия = "если (строки 3.1.3.2 + 3.2.3.2  раздела II) > 0, то строка 14.3.2 раздела IV = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_1_3_2 ) + " + " + Строка(Строка(Выборка.Раздел2_3_2_3_2 ))+" > 0; строка 14.3.1 = " + Строка(Выборка.Раздел4_14_3_2) ;
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);  
		КонецЕсли;
		
		// 13) если (строка 14 раздела IV > 0), то (строки 3.1 + 3.2 раздела II) = 0
		Если Выборка.Раздел4_14 > 0 И Выборка.Раздел2_3_1 + Выборка.Раздел2_3_2 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 28 + КолДопКолонок, 1, 29 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
			
			ОписаниеУсловия = "если (строка 14 раздела IV > 0), то (строки 3.1 + 3.2 раздела II) = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел4_14 ) +" > 0; строки 3.1 + 3.2 раздела II) = " + Строка(Выборка.Раздел2_3_1) +" + " + Строка(Выборка.Раздел2_3_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
		КонецЕсли;
		
		// 14) если (строка 14.1 раздела IV > 0), то (строки 3.1.1 + 3.2.1 раздела II) = 0  		
		Если Выборка.Раздел4_14_1 > 0 И Выборка.Раздел2_3_1_1 + Выборка.Раздел2_3_2_1 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 30 + КолДопКолонок, 1, 31 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
			
			ОписаниеУсловия = "если (строка 14.1 раздела IV > 0), то (строки 3.1.1 + 3.2.1 раздела II) = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел4_14_1 ) +" > 0; строки 3.1.1 + 3.2.1 раздела II) = " + Строка(Выборка.Раздел2_3_1_1) +" + " + Строка(Выборка.Раздел2_3_2_1);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
			
		КонецЕсли;
		
		// 15) если (строка 14.2 раздела IV > 0), то (строки 3.1.2 + 3.2.2 раздела II) = 0
		Если Выборка.Раздел4_14_2 > 0 И Выборка.Раздел2_3_1_2 + Выборка.Раздел2_3_2_2 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 32 + КолДопКолонок, 1, 33 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;  
			
			ОписаниеУсловия = "если (строка 14.2 раздела IV > 0), то (строки 3.1.2 + 3.2.2 раздела II) = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел4_14_2 ) +" > 0; строки 3.1.2 + 3.2.2 раздела II) = " + Строка(Выборка.Раздел2_3_1_2) +" + " + Строка(Выборка.Раздел2_3_2_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
			
		КонецЕсли;
		
		// 16) если (строка 14.3 раздела IV > 0), то (строки 3.1.3 + 3.2.3 раздела II) = 0
		Если Выборка.Раздел4_14_3 > 0 И Выборка.Раздел2_3_1_3 + Выборка.Раздел2_3_2_3 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 34 + КолДопКолонок, 1, 35 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   	
			
			ОписаниеУсловия = "если (строка 14.3 раздела IV > 0), то (строки 3.1.3 + 3.2.3 раздела II) = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел4_14_3 ) +" > 0; строки 3.1.3 + 3.2.3 раздела II) = " + Строка(Выборка.Раздел2_3_1_3) +" + " + Строка(Выборка.Раздел2_3_2_3);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
			
		КонецЕсли;
		
		// 17) если (строка 14.3.1 раздела IV > 0), то (строки 3.1.3.1 + 3.2.3.1 раздела II) = 0
		Если Выборка.Раздел4_14_3_1 > 0 И Выборка.Раздел2_3_1_3_1 + Выборка.Раздел2_3_2_3_1 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 36 + КолДопКолонок, 1, 37 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   	
			
			ОписаниеУсловия = "если (строка 14.3.1 раздела IV > 0), то (строки 3.1.3.1 + 3.2.3.1 раздела II) = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел4_14_3_1 ) +" > 0; строки 3.1.3 + 3.2.3 раздела II) = " + Строка(Выборка.Раздел2_3_1_3_1) +" + " + Строка(Выборка.Раздел2_3_2_3_1);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
			
		КонецЕсли;
		
		// 18) если (строка 14.3.2 раздела IV > 0), то (строки 3.1.3.2 + 3.2.3.2 раздела II) = 0
		Если Выборка.Раздел4_14_3_2 > 0 И Выборка.Раздел4_3_1_3_2 + Выборка.Раздел4_3_2_3_2 = 0 Тогда
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 38 + КолДопКолонок, 1, 39 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
			
			ОписаниеУсловия = "если (строка 14.3.2 раздела IV > 0), то (строки 3.1.3.2 + 3.2.3.2 раздела II) = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел4_14_3_2 ) +" > 0; строки 3.1.3 + 3.2.3 раздела II) = " + Строка(Выборка.Раздел4_3_1_3_2) +" + " + Строка(Выборка.Раздел4_3_2_3_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
			
		КонецЕсли;
		
		// 19) если (строка 14.1 раздела IV) > 0, то строка 11.1 раздела IV = 0
		//ОбластьСтрока.Параметры.Раздел4_11_1 = Выборка.Раздел4_11_1;
		
		Если Выборка.Раздел4_14_1 > 0 И Выборка.Раздел4_11_1 = 0 Тогда  	 
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 40 + КолДопКолонок, 1, 41 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;  
			
			ОписаниеУсловия = "если (строка 14.1 раздела IV) > 0, то строка 11.1 раздела IV = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел4_14_1 ) +" > 0; строка 11.1 раздела IV = " + Строка(Выборка.Раздел4_11_1);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
			
		КонецЕсли;
		
		// 20) если (строка 14.2 раздела IV) > 0, то строка 11.2 раздела IV = 0
		//ОбластьСтрока.Параметры.Раздел4_11_2 = Выборка.Раздел4_11_2;
		
		Если Выборка.Раздел4_14_2 > 0 И Выборка.Раздел4_11_2 = 0 Тогда  	 
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 42 + КолДопКолонок, 1, 43 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
			
			ОписаниеУсловия = "если (строка 14.2 раздела IV) > 0, то строка 11.2 раздела IV = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел4_14_2 ) +" > 0; строка 11.2 раздела IV = " + Строка(Выборка.Раздел4_11_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
			
		КонецЕсли;
		
		// 21) если (строка 15.1 раздела IV) > 0, то строка 11.1 раздела IV = 0
		//ОбластьСтрока.Параметры.Раздел4_11_2 = Выборка.Раздел4_11_2;
		
		Если Выборка.Раздел4_15_1 > 0 И Выборка.Раздел4_11_1 = 0 Тогда  	 
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 44 + КолДопКолонок, 1, 45 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;  
			
			ОписаниеУсловия = "если (строка 15.1 раздела IV) > 0, то строка 11.1 раздела IV = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел4_15_1 ) +" > 0; строка 11.1 раздела IV = " + Строка(Выборка.Раздел4_11_1);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
			
		КонецЕсли;
		
		// 22) если (строка 15.2 раздела IV) > 0, то строка 11.2 раздела IV = 0
		//ОбластьСтрока.Параметры.Раздел4_11_2 = Выборка.Раздел4_11_2;
		
		Если Выборка.Раздел4_15_2 > 0 И Выборка.Раздел4_11_2 = 0 Тогда  	 
			ВсегоОшибок = ВсегоОшибок + 1;   
			ОбластьСтрока.Область(1, 46 + КолДопКолонок, 1, 47 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
			
			ОписаниеУсловия = "если (строка 15.2 раздела IV) > 0, то строка 11.2 раздела IV = 0";   			
			ОписаниеОшибки = Строка(Выборка.Раздел4_15_2 ) +" > 0; строка 11.2 раздела IV = " + Строка(Выборка.Раздел4_11_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
			
		КонецЕсли; 		
		
		Если НЕ Выборка.ЕстьДокумент Тогда
			РезультатНадзорныеСоотношения.Вывести(ОбластьСтрока);			
			Продолжить;
		КонецЕсли;
		
		// сравнение разделы 7 и 8  		
		
		СтруктураСтрок = Новый Структура;
		
		НайденныеСтроки = ТЗразделы7_8.НайтиСтроки(Новый Структура("КодКПК_ДатаОтчетности", СокрЛП(Выборка.КПК.Код) + "_" + Строка(Выборка.ДатаОкончанияОтчетногоПериода))); 			
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			// Добавляем графы *.1
			Если НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_1_1 Тогда
				СтруктураСтрок.Вставить("Раздел7_1_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_2_1 Тогда
				СтруктураСтрок.Вставить("Раздел7_2_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_3_1 Тогда
				СтруктураСтрок.Вставить("Раздел7_3_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_4_1 Тогда
				СтруктураСтрок.Вставить("Раздел7_4_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_5_1 Тогда
				СтруктураСтрок.Вставить("Раздел7_5_1", НайденнаяСтрока);	
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_6_1 Тогда
				СтруктураСтрок.Вставить("Раздел7_6_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_7_1 Тогда
				СтруктураСтрок.Вставить("Раздел7_7_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_8_1 Тогда
				СтруктураСтрок.Вставить("Раздел7_8_1", НайденнаяСтрока);	
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_9_1 Тогда
				СтруктураСтрок.Вставить("Раздел7_9_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_1_1 Тогда
				СтруктураСтрок.Вставить("Раздел8_1_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_2_1 Тогда
				СтруктураСтрок.Вставить("Раздел8_2_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_3_1 Тогда
				СтруктураСтрок.Вставить("Раздел8_3_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_4_1 Тогда
				СтруктураСтрок.Вставить("Раздел8_4_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_5_1 Тогда
				СтруктураСтрок.Вставить("Раздел8_5_1", НайденнаяСтрока);	
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_6_1 Тогда
				СтруктураСтрок.Вставить("Раздел8_6_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_7_1 Тогда
				СтруктураСтрок.Вставить("Раздел8_7_1", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_8_1 Тогда
				СтруктураСтрок.Вставить("Раздел8_8_1", НайденнаяСтрока);	
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_9_1 Тогда
				СтруктураСтрок.Вставить("Раздел8_9_1", НайденнаяСтрока);	
				
				// Добавляем графы *.2
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_1_2 Тогда
				СтруктураСтрок.Вставить("Раздел7_1_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_2_2 Тогда
				СтруктураСтрок.Вставить("Раздел7_2_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_3_2 Тогда
				СтруктураСтрок.Вставить("Раздел7_3_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_4_2 Тогда
				СтруктураСтрок.Вставить("Раздел7_4_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_5_2 Тогда
				СтруктураСтрок.Вставить("Раздел7_5_2", НайденнаяСтрока);	
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_6_2 Тогда
				СтруктураСтрок.Вставить("Раздел7_6_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_7_2 Тогда
				СтруктураСтрок.Вставить("Раздел7_7_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_8_2 Тогда
				СтруктураСтрок.Вставить("Раздел7_8_2", НайденнаяСтрока);	
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел7_9_2 Тогда
				СтруктураСтрок.Вставить("Раздел7_9_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_1_2 Тогда
				СтруктураСтрок.Вставить("Раздел8_1_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_2_2 Тогда
				СтруктураСтрок.Вставить("Раздел8_2_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_3_2 Тогда
				СтруктураСтрок.Вставить("Раздел8_3_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_4_2 Тогда
				СтруктураСтрок.Вставить("Раздел8_4_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_5_2 Тогда
				СтруктураСтрок.Вставить("Раздел8_5_2", НайденнаяСтрока);	
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_6_2 Тогда
				СтруктураСтрок.Вставить("Раздел8_6_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_7_2 Тогда
				СтруктураСтрок.Вставить("Раздел8_7_2", НайденнаяСтрока);
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_8_2 Тогда
				СтруктураСтрок.Вставить("Раздел8_8_2", НайденнаяСтрока);	
				
			ИначеЕсли НайденнаяСтрока.Раздел = Справочники.Разделы.Раздел8_9_2 Тогда
				СтруктураСтрок.Вставить("Раздел8_9_2", НайденнаяСтрока);		
			КонецЕсли; 	  			
		КонецЦикла;
		
		
		//////////////////////////////////////////////////////
		//    Основной долг                                 //
		//////////////////////////////////////////////////////
		
		// 1) 1.1(графы 3,4,5,6)РазделаVIII<>0  - создание резерва для данных категорий не предусмотрено;
		
		ОписаниеУсловия = "1.1 (графы 3,4,5,6) РазделаVIII <> 0  - создание резерва для данных категорий не предусмотрено";
		ОписаниеОшибки = "";
		Если СтруктураСтрок.Раздел8_1_1.Графа3 <> 0 ИЛИ СтруктураСтрок.Раздел8_1_1.Графа4 <> 0 ИЛИ СтруктураСтрок.Раздел8_1_1.Графа5 <> 0 ИЛИ СтруктураСтрок.Раздел8_1_1.Графа6 <> 0 Тогда
			Если СтруктураСтрок.Раздел8_1_1.Графа3 <> 0 Тогда
				ОписаниеОшибки = ?(ОписаниеОшибки = "", "", Символы.ПС) + ОписаниеОшибки + "1.1 РазделаVIII Графа 3 = " + Строка(СтруктураСтрок.Раздел8_1_1.Графа3);
				ВсегоОшибок = ВсегоОшибок + 1;      
			КонецЕсли;
			
			Если СтруктураСтрок.Раздел8_1_1.Графа4 <> 0 Тогда
				ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "1.1 РазделаVIII Графа 4 = " + Строка(СтруктураСтрок.Раздел8_1_1.Графа4);	
				ВсегоОшибок = ВсегоОшибок + 1;   
			КонецЕсли;
			
			Если СтруктураСтрок.Раздел8_1_1.Графа5 <> 0 Тогда
				ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "1.1 РазделаVIII Графа 5 = " + Строка(СтруктураСтрок.Раздел8_1_1.Графа5);		
				ВсегоОшибок = ВсегоОшибок + 1;   
			КонецЕсли;
			
			Если СтруктураСтрок.Раздел8_1_1.Графа6 <> 0 Тогда
				ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "1.1 РазделаVIII Графа 6 = " + Строка(СтруктураСтрок.Раздел8_1_1.Графа6);		
				ВсегоОшибок = ВсегоОшибок + 1;   
			КонецЕсли;
			
			ОбластьСтрока.Область(1, 48 + КолДопКолонок, 1, 48 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 			
		КонецЕсли;
		
		Проверка5_1 =  ОписаниеУсловия+?(ОписаниеОшибки="", "", Символы.ПС + ОписаниеОшибки);
		ОбластьСтрока.Параметры.Проверка5_1 = Проверка5_1;
		
		Если ОписаниеОшибки <> "" Тогда
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
		КонецЕсли;         
		
		
		// 2) 1.1(графа7)РазделаVII*2% <>1.1(графа7)РазделаVIII;     		
		ОписаниеУсловия = "1.1 (графа7) РазделаVII * 2% <> 1.1 (графа7) РазделаVIII";
		ОписаниеОшибки = "";
		Если Окр(СтруктураСтрок.Раздел7_1_1.Графа7 *2 /100, 3) <> СтруктураСтрок.Раздел8_1_1.Графа7 Тогда		
			ОписаниеОшибки = Строка(Окр(СтруктураСтрок.Раздел7_1_1.Графа7 *2 /100, 3)) + " <> " + Строка(СтруктураСтрок.Раздел8_1_1.Графа7);
			ОбластьСтрока.Область(1, 49 + КолДопКолонок, 1, 49 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
			ВсегоОшибок = ВсегоОшибок + 1;   
		КонецЕсли;
		
		Проверка5_2 = ОписаниеУсловия+?(ОписаниеОшибки="", "", Символы.ПС+ОписаниеОшибки);					
		ОбластьСтрока.Параметры.Проверка5_2 = Проверка5_2;
		
		Если ОписаниеОшибки <> "" Тогда
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);    		
		КонецЕсли;
		
		// 3) 1.1(графа8)РазделаVII*5%<>1.1(графа8)РазделаVIII    		
		ОписаниеУсловия = "1.1 (графа8) РазделаVII * 5% <> 1.1 (графа8) РазделаVIII";
		ОписаниеОшибки = "";
		Если Окр(СтруктураСтрок.Раздел7_1_1.Графа8 *5 /100, 3) <> СтруктураСтрок.Раздел8_1_1.Графа8 Тогда		
			ОписаниеОшибки = Строка(Окр(СтруктураСтрок.Раздел7_1_1.Графа8 *5 /100, 3)) + " <> " + Строка(СтруктураСтрок.Раздел8_1_1.Графа8);
			ОбластьСтрока.Область(1, 50 + КолДопКолонок, 1, 50 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 	
			ВсегоОшибок = ВсегоОшибок + 1;   
			
		КонецЕсли;
		
		Проверка5_3 = ОписаниеУсловия+?(ОписаниеОшибки="", "", Символы.ПС+ОписаниеОшибки);
		ОбластьСтрока.Параметры.Проверка5_3 = Проверка5_3; 
		
		Если ОписаниеОшибки <> "" Тогда
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);     
		КонецЕсли;
		
		// ------------------------------------------------------------
		// 3 графа 
		ОписаниеОшибки3Графа = "";
		КоличествоОшибокПо3Графе = 0;
		СтрокаРазделитель = Символы.ПС + "   ";
		
		// 4) 2.1(графа3)РазделаVII*1,5%<>2.1(графа3)РазделаVIII    		
		ОписаниеУсловия = "2.1 (графа3) РазделаVII * 1,5% <> 2.1(графа3)РазделаVIII";   	
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_2_1.Графа3 *1.5 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_2_1.Графа3; 
		ОписаниеОшибки = "";
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель);
		
		// 5) 3.1(графа3)РазделаVII*7%<>3.1(графа3)РазделаVIII    		
		ОписаниеУсловия = "3.1 (графа3) РазделаVII * 7% <> 3.1 (графа3) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_3_1.Графа3 *7 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_3_1.Графа3 ;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель);
		
		
		// 6) 4.1(графа3)РазделаVII*15%<>4.1(графа3)РазделаVIII   		
		ОписаниеУсловия = "4.1 (графа3) РазделаVII * 15% <> 3.1 (графа3) РазделаVIII";
		ЗначениеЛевое =  Окр(СтруктураСтрок.Раздел7_4_1.Графа3 *15 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_4_1.Графа3 ;   
		ОписаниеОшибки = "";  
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель);
		
		// 7) 5.1(графа3)РазделаVII*30%<>5.1(графа3)РазделаVIII   		
		ОписаниеУсловия = "5.1 (графа3) РазделаVII * 30% <> 5.1 (графа3) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_5_1.Графа3 *30 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_5_1.Графа3;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель);
		
		// 8) 6.1(графа3)РазделаVII*45%<>6.1(графа3)РазделаVIII  		
		ОписаниеУсловия = "6.1 (графа3) РазделаVII * 45% <> 6.1 (графа3) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_6_1.Графа3 *45 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_6_1.Графа3;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель);
		
		
		// 9) 7.1(графа3)РазделаVII*60%<>7.1(графа3)РазделаVIII  		
		ОписаниеУсловия = "7.1 (графа3) РазделаVII * 60% <> 7.1 (графа3) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_7_1.Графа3 *60 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_7_1.Графа3;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель);
		
		// 10) 8.1(графа3)РазделаVII*75%<>8.1(графа3)РазделаVIII  		
		ОписаниеУсловия = "8.1 (графа3) РазделаVII * 75 <> 8.1 (графа3) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_8_1.Графа3 *75 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_8_1.Графа3;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель);
		
		
		// 11) 9.1(графа3)РазделаVII*100%<>9.1(графа3)РазделаVIII  		
		ОписаниеУсловия = "9.1 (графа3) РазделаVII * 100% <> 9.1 (графа3) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_9_1.Графа3 *100 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_9_1.Графа3;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3Графе, СтрокаРазделитель);
		
		Если КоличествоОшибокПо3Графе > 0 Тогда
			ОбластьСтрока.Область(1, 51 + КолДопКолонок, 1, 51 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо3Графе = ?(КоличествоОшибокПо3Графе = 0, "", КоличествоОшибокПо3Графе);				
		ОбластьСтрока.Параметры.ОписаниеОшибки3Графа = ОписаниеОшибки3Графа; 
		
		//// ------------------------------------------------------------
		//// 4 графа
		ОписаниеОшибки4Графа = "";
		КоличествоОшибокПо4Графе = 0;	
		
		// 12) 2.1(графа4)РазделаVII*3%<>2.1(графа4)РазделаVIII  		
		ОписаниеУсловия = "2.1 (графа4) РазделаVII * 3% <> 2.1 (графа4) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_2_1.Графа4 *3 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_2_1.Графа4;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель);
		
		// 13) 3.1(графа4)РазделаVII*10%<>3.1(графа4)РазделаVIII  				
		ОписаниеУсловия = "3.1 (графа4) РазделаVII * 10% <> 3.1 (графа4) РазделаVIII";		
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_3_1.Графа4 *10 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_3_1.Графа4;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель);
		
		// 14) 4.1(графа4)РазделаVII*20%<>4.1(графа4)РазделаVIII  		
		ОписаниеУсловия = "4.1 (графа4) РазделаVII * 20% <> 4.1 (графа4) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_4_1.Графа4 *20 /100, 3);
		ЗначениеПравое =  СтруктураСтрок.Раздел8_4_1.Графа4;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель);
		
		// 15) 5.1(графа4)РазделаVII*40%<>5.1(графа4)РазделаVIII 		
		ОписаниеУсловия = "5.1 (графа4) РазделаVII * 40% <> 5.1 (графа4) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_5_1.Графа4 *40 /100, 3);
		ЗначениеПравое =  СтруктураСтрок.Раздел8_5_1.Графа4;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель);
		
		// 16) 6.1(графа4)РазделаVII*50%<>6.1(графа4)РазделаVIII 		
		ОписаниеУсловия = "6.1 (графа4) РазделаVII * 50% <> 6.1 (графа4) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_6_1.Графа4 *50 /100, 3);
		ЗначениеПравое =  СтруктураСтрок.Раздел8_6_1.Графа4;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель);
		
		// 17) 7.1(графа4)РазделаVII*65%<>7.1(графа4)РазделаVIII 		
		ОписаниеУсловия = "7.1 (графа4) РазделаVII * 65% <> 7.1 (графа4) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_7_1.Графа4 *65 /100, 3) ;
		ЗначениеПравое =  СтруктураСтрок.Раздел8_7_1.Графа4;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель);
		
		// 18) 8.1(графа4)РазделаVII*80%<>8.1(графа4)РазделаVIII		
		ОписаниеУсловия = "8.1 (графа4) РазделаVII * 80% <> 8.1 (графа4) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_8_1.Графа4 *80 /100, 3);
		ЗначениеПравое =  СтруктураСтрок.Раздел8_8_1.Графа4;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель);
		
		
		// 19) 9.1(графа4)РазделаVII*100%<>9.1(графа4)РазделаVIII		
		ОписаниеУсловия = "9.1 (графа4) РазделаVII * 100% <> 9.1 (графа4) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_9_1.Графа4 *100 /100, 3);
		ЗначениеПравое =  СтруктураСтрок.Раздел8_9_1.Графа4;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4Графе, СтрокаРазделитель);
		
		
		Если КоличествоОшибокПо4Графе > 0 Тогда
			ОбластьСтрока.Область(1, 52 + КолДопКолонок, 1, 52 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо4Графе = ?(КоличествоОшибокПо4Графе = 0, "", КоличествоОшибокПо4Графе);				
		ОбластьСтрока.Параметры.ОписаниеОшибки4Графа = ОписаниеОшибки4Графа; 
		
		
		// ------------------------------------------------------------
		// 5 графа   		
		
		ОписаниеОшибки5Графа = "";
		КоличествоОшибокПо5Графе = 0;
		
		// 20) 2.1(графа5)РазделаVII*1,5%<>2.1(графа5)РазделаVIII 		
		ОписаниеУсловия = "2.1 (графа5) РазделаVII * 1,5% <> 2.1 (графа5) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_2_1.Графа5 *1.5 /100, 3);
		ЗначениеПравое =  СтруктураСтрок.Раздел8_2_1.Графа5;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель);
		
		
		// 21) 3.1(графа5)РазделаVII*7%<>3.1(графа5)РазделаVIII 		
		ОписаниеУсловия = "3.1 (графа5) РазделаVII * 7% <> 3.1 (графа5) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_3_1.Графа5 *7 /100, 3);
		ЗначениеПравое =  СтруктураСтрок.Раздел8_3_1.Графа5;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель);
		
		// 22) 4.1(графа5)РазделаVII*15%<>4.1(графа5)РазделаVIII		
		ОписаниеУсловия = "4.1 (графа5) РазделаVII * 15% <> 4.1 (графа5) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_4_1.Графа5 *15 /100, 3);
		ЗначениеПравое =  СтруктураСтрок.Раздел8_4_1.Графа5;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель);
		
		// 23) 5.1(графа5)РазделаVII*35%<>5.1(графа5)РазделаVIII 		
		ОписаниеУсловия = "5.1 (графа5) РазделаVII * 35% <> 5.1 (графа5) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_5_1.Графа5 *35 /100, 3);
		ЗначениеПравое =  СтруктураСтрок.Раздел8_5_1.Графа5;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель);
		
		// 24) 6.1(графа5)РазделаVII*55%<>6.1(графа5)РазделаVIII 		
		ОписаниеУсловия = "6.1 (графа5) РазделаVII * 55% <> 6.1 (графа5) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_6_1.Графа5 *55 /100, 3);
		ЗначениеПравое =  СтруктураСтрок.Раздел8_6_1.Графа5;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель);
		
		// 25) 7.1(графа5)РазделаVII*75%<>7.1(графа5)РазделаVIII		
		ОписаниеУсловия = "7.1 (графа5) РазделаVII * 75% <> 7.1 (графа5) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_7_1.Графа5 *75 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_7_1.Графа5;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель);
		
		// 26) 8.1(графа5)РазделаVII*95%<>8.1(графа5)РазделаVIII		
		ОписаниеУсловия = "8.1 (графа5) РазделаVII * 95% <> 8.1 (графа5) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_8_1.Графа5 *95 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_8_1.Графа5;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель);
		
		// 27) 9.1(графа5)РазделаVII*100%<>9.1(графа5)РазделаVIII		
		ОписаниеУсловия = "9.1 (графа5) РазделаVII * 100% <> 9.1 (графа5) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_9_1.Графа5 *100 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_9_1.Графа5;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5Графе, СтрокаРазделитель);
		
		Если КоличествоОшибокПо5Графе > 0 Тогда
			ОбластьСтрока.Область(1, 53 + КолДопКолонок, 1, 53 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо5Графе = ?(КоличествоОшибокПо5Графе = 0, "", КоличествоОшибокПо5Графе);				
		ОбластьСтрока.Параметры.ОписаниеОшибки5Графа = ОписаниеОшибки5Графа; 
		
		
		// ------------------------------------------------------------
		// 6 графа
		
		ОписаниеОшибки6Графа = "";
		КоличествоОшибокПо6Графе = 0;
		
		// 28) 2.1(графа6)РазделаVII*3%<>2.1(графа6)РазделаVIII		
		ОписаниеУсловия = "2.1 (графа6) РазделаVII * 3% <> 2.1 (графа6) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_2_1.Графа6 *3 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_2_1.Графа6;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель);
		
		// 29) 3.1(графа6)РазделаVII*10%<>3.1(графа6)РазделаVIII		
		ОписаниеУсловия = "3.1 (графа6) РазделаVII * 10% <> 3.1 (графа6) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_3_1.Графа6 *10 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_3_1.Графа6;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель);
		
		// 30) 4.1(графа6)РазделаVII*20%<>4.1(графа6)РазделаVIII		
		ОписаниеУсловия = "4.1 (графа6) РазделаVII * 20% <> 4.1 (графа6) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_4_1.Графа6 *20 /100, 3) ;
		ЗначениеПравое = СтруктураСтрок.Раздел8_4_1.Графа6;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель);
		
		// 31) 5.1(графа6)РазделаVII*45%<>5.1(графа6)РазделаVIII 		
		ОписаниеУсловия = "5.1 (графа6) РазделаVII * 45% <> 5.1 (графа6) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_5_1.Графа6 *45 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_5_1.Графа6;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель);
		
		// 32) 6.1(графа6)РазделаVII*70%<>6.1(графа6)РазделаVIII 		
		ОписаниеУсловия = "6.1 (графа6) РазделаVII * 70% <> 6.1 (графа6) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_6_1.Графа6 *70 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_6_1.Графа6;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель);
		
		// 33) 7.1(графа6)РазделаVII*90%<>7.1(графа6)РазделаVIII		
		ОписаниеУсловия = "7.1 (графа6) РазделаVII * 90% <> 7.1 (графа6) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_7_1.Графа6 *90 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_7_1.Графа6;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель);
		
		// 34) 8.1(графа6)РазделаVII*100%<>8.1(графа6)РазделаVIII		
		ОписаниеУсловия = "8.1 (графа6) РазделаVII * 100% <> 8.1 (графа6) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_8_1.Графа6 *100 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_8_1.Графа6;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель);
		
		// 35) 9.1(графа6)РазделаVII*100%<>9.1(графа6)РазделаVIII		
		ОписаниеУсловия = "9.1 (графа6) РазделаVII * 100% <> 9.1 (графа6) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_9_1.Графа6 *100 /100, 3) ;
		ЗначениеПравое = СтруктураСтрок.Раздел8_9_1.Графа6;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6Графе, СтрокаРазделитель);
		
		Если КоличествоОшибокПо6Графе > 0 Тогда
			ОбластьСтрока.Область(1, 54 + КолДопКолонок, 1, 54 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо6Графе = ?(КоличествоОшибокПо6Графе = 0, "", КоличествоОшибокПо6Графе);				
		ОбластьСтрока.Параметры.ОписаниеОшибки6Графа = ОписаниеОшибки6Графа; 
		
		
		// ------------------------------------------------------------
		// 7 графа
		
		ОписаниеОшибки7Графа = "";
		КоличествоОшибокПо7Графе = 0;
		
		// 36) 2.1(графа6)РазделаVII*3%<>2.1(графа6)РазделаVIII		
		ОписаниеУсловия = "2.1 (графа7) РазделаVII * 5% <> 2.1 (графа7) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_2_1.Графа7 *5 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_2_1.Графа7;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель);
		
		// 37) 3.1(графа7)РазделаVII*20%<>3.1(графа7)РазделаVIII		
		ОписаниеУсловия = "3.1 (графа7) РазделаVII * 20% <> 3.1 (графа7) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_3_1.Графа7 *20 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_3_1.Графа7;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель);
		
		// 38) 4.1(графа7)РазделаVII*40%<>4.1(графа7)РазделаVIIII		
		ОписаниеУсловия = "4.1 (графа7) РазделаVII * 40% <> 4.1 (графа7) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_4_1.Графа7 *40 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_4_1.Графа7;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель);
		
		// 39) 5.1(графа7)РазделаVII*60%<>5.1(графа7)РазделаVIII		
		ОписаниеУсловия = "5.1 (графа7) РазделаVII * 60% <> 5.1 (графа7) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_5_1.Графа7 *60 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_5_1.Графа7;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель);
		
		// 40) 6.1(графа7)РазделаVII*80%<>6.1(графа7)РазделаVIII 		
		ОписаниеУсловия = "6.1 (графа7) РазделаVII * 80% <> 6.1 (графа7) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_6_1.Графа7 *80 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_6_1.Графа7;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель);
		
		// 41) 7.1(графа7)РазделаVII*95%<>7.1(графа7)РазделаVIII		
		ОписаниеУсловия = "7.1 (графа7) РазделаVII * 95% <> 7.1 (графа7) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_7_1.Графа7 *95 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_7_1.Графа7;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель);
		
		// 42) 8.1(графа7)РазделаVII*100%<>8.1(графа7)РазделаVIIII		
		ОписаниеУсловия = "8.1 (графа7) РазделаVII * 100% <> 8.1 (графа7) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_8_1.Графа7 *100 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_8_1.Графа7;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель);
		
		// 43) 9.1(графа7)РазделаVII*100%<>9.1(графа7)РазделаVIII		
		ОписаниеУсловия = "9.1 (графа7) РазделаVII * 100% <> 9.1 (графа7) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_9_1.Графа7 *100 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_9_1.Графа7;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7Графе, СтрокаРазделитель);
		
		Если КоличествоОшибокПо7Графе > 0 Тогда
			ОбластьСтрока.Область(1, 55 + КолДопКолонок, 1, 55 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо7Графе = ?(КоличествоОшибокПо7Графе = 0, "", КоличествоОшибокПо7Графе);				
		ОбластьСтрока.Параметры.ОписаниеОшибки7Графа = ОписаниеОшибки7Графа; 
		
		// ------------------------------------------------------------
		// 8 графа
		
		ОписаниеОшибки8Графа = "";
		КоличествоОшибокПо8Графе = 0;
		
		// 44) 2.1(графа8)РазделаVII*10%<>2.1(графа8)РазделаVIII
		ОписаниеУсловия = "2.1 (графа8) РазделаVII * 10% <> 2.1 (графа8) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_2_1.Графа8 *10 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_2_1.Графа8;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель);
		
		// 45) 3.1(графа8)РазделаVII*30%<>3.1(графа8)РазделаVIII		
		ОписаниеУсловия = "3.1 (графа8) РазделаVII * 30% <> 3.1 (графа8) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_3_1.Графа8 *30 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_3_1.Графа8;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель);
		
		// 46) 4.1(графа8)РазделаVII*50%<>4.1(графа8)РазделаVIII		
		ОписаниеУсловия = "4.1 (графа8) РазделаVII * 50% <> 4.1 (графа8) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_4_1.Графа8 *50 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_4_1.Графа8;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель);
		
		// 47) 5.1(графа8)РазделаVII*70%<>5.1(графа8)РазделаVIII		
		ОписаниеУсловия = "5.1 (графа8) РазделаVII * 70% <> 5.1 (графа8) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_5_1.Графа8 *70 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_5_1.Графа8;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель);
		
		// 48) 6.1(графа8)РазделаVII*90%<>6.1(графа8)РазделаVIII		
		ОписаниеУсловия = "6.1 (графа8) РазделаVII * 90% <> 6.1 (графа8) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_6_1.Графа8 *90 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_6_1.Графа8;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель);
		
		// 49) 7.1(графа8)РазделаVII*100%<>7.1(графа8)РазделаVIII		
		ОписаниеУсловия = "7.1 (графа8) РазделаVII * 100% <> 7.1 (графа8) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_7_1.Графа8 *100 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_7_1.Графа8;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель);
		
		// 50) 8.1(графа8)РазделаVII*100%<>8.1(графа8)РазделаVIIII		
		ОписаниеУсловия = "8.1 (графа8) РазделаVII * 100% <> 8.1 (графа8) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_8_1.Графа8 *100 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_8_1.Графа8;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель);
		
		// 51) 9.1(графа8)РазделаVII*100%<>9.1(графа8)РазделаVIII		
		ОписаниеУсловия = "9.1 (графа8) РазделаVII * 100% <> 9.1 (графа8) РазделаVIII";
		ЗначениеЛевое = Окр(СтруктураСтрок.Раздел7_9_1.Графа8 *100 /100, 3);
		ЗначениеПравое = СтруктураСтрок.Раздел8_9_1.Графа8;   
		ОписаниеОшибки = ""; 
		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8Графе, СтрокаРазделитель);
		
		Если КоличествоОшибокПо8Графе > 0 Тогда
			ОбластьСтрока.Область(1, 56 + КолДопКолонок, 1, 56 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо8Графе = ?(КоличествоОшибокПо8Графе = 0, "", КоличествоОшибокПо8Графе);				
		ОбластьСтрока.Параметры.ОписаниеОшибки8Графа = ОписаниеОшибки8Графа; 
		
		
		
		//////////////////////////////////////////////////////
		//    Проценты                                      //
		//////////////////////////////////////////////////////
		
		// 1) 1.2(графы 3,4,5,6)РазделаVIII<>0  - создание резерва для данных категорий не предусмотрено;
		
		ОписаниеУсловия = "1.2 (графы 3,4,5,6) РазделаVIII <> 0  - создание резерва для данных категорий не предусмотрено";
		ОписаниеОшибки = "";
		Если СтруктураСтрок.Раздел8_1_2.Графа3 <> 0 ИЛИ СтруктураСтрок.Раздел8_1_2.Графа4 <> 0 ИЛИ СтруктураСтрок.Раздел8_1_2.Графа5 <> 0 ИЛИ СтруктураСтрок.Раздел8_1_2.Графа6 <> 0 Тогда
			Если СтруктураСтрок.Раздел8_1_2.Графа3 <> 0 Тогда
				ОписаниеОшибки = ?(ОписаниеОшибки = "", "", Символы.ПС) + ОписаниеОшибки + "1.2 РазделаVIII Графа 3 = " + Строка(СтруктураСтрок.Раздел8_1_2.Графа3);
				ВсегоОшибок = ВсегоОшибок + 1;   
			КонецЕсли;
			
			Если СтруктураСтрок.Раздел8_1_2.Графа4 <> 0 Тогда
				ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "1.2 РазделаVIII Графа 4 = " + Строка(СтруктураСтрок.Раздел8_1_2.Графа4);	
				ВсегоОшибок = ВсегоОшибок + 1;   
			КонецЕсли;
			
			Если СтруктураСтрок.Раздел8_1_2.Графа5 <> 0 Тогда
				ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "1.2 РазделаVIII Графа 5 = " + Строка(СтруктураСтрок.Раздел8_1_2.Графа5);		
				ВсегоОшибок = ВсегоОшибок + 1;   
			КонецЕсли;
			
			Если СтруктураСтрок.Раздел8_1_2.Графа6 <> 0 Тогда
				ОписаниеОшибки = ОписаниеОшибки + ?(ОписаниеОшибки = "", "", Символы.ПС) + "1.2 РазделаVIII Графа 6 = " + Строка(СтруктураСтрок.Раздел8_1_2.Графа6);		
				ВсегоОшибок = ВсегоОшибок + 1;   
			КонецЕсли;
			
			ОбластьСтрока.Область(1, 57 + КолДопКолонок, 1, 57 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		Проверка5_4 =  ОписаниеУсловия+?(ОписаниеОшибки="", "", Символы.ПС + ОписаниеОшибки);
		ОбластьСтрока.Параметры.Проверка5_4 = Проверка5_4;
		
		Если ОписаниеОшибки <> "" Тогда
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки); 
		КонецЕсли;
		
		
		// 2) 1.1(графа7)РазделаVIII/1.1(графа7)РазделаVII*100<>1.2(графа7)Раздела VIII/1.2(графа7)РазделаVII*100
		ОписаниеУсловия = "1.1 (графа7) РазделаVIII / 1.1 (графа7) РазделаVII * 100 <> 1.2 (графа7) Раздела VIII / 1.2 (графа7) Раздела VII * 100";
		ОписаниеОшибки = "";
		
		Если СтруктураСтрок.Раздел7_1_1.Графа7 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_1_1.Графа7 / СтруктураСтрок.Раздел7_1_1.Графа7*100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_1_2.Графа7 = 0 Тогда
			Если СтруктураСтрок.Раздел8_1_2.Графа7 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе	 			
				ЗначениеПравое = 0;	
			КонецЕсли;
		Иначе
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_1_2.Графа7  / СтруктураСтрок.Раздел7_1_2.Графа7*100, 0);	
		КонецЕсли; 		     		
		
		Если ЗначениеЛевое <> ЗначениеПравое Тогда		
			ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_1_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_1_1.Графа7) + " * 100 <> " + Строка(СтруктураСтрок.Раздел8_1_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_1_2.Графа7) + " * 100";
			ОбластьСтрока.Область(1, 58 + КолДопКолонок, 1, 58 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
			ВсегоОшибок = ВсегоОшибок + 1;   
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
		КонецЕсли;
		
		Проверка5_5 = ОписаниеУсловия+?(ОписаниеОшибки="", "", Символы.ПС+ОписаниеОшибки);					
		ОбластьСтрока.Параметры.Проверка5_5 = Проверка5_5;
		
		// 3) 1.1(графа8)РазделаVIII/1.1(графа8)РазделаVII*100<>1.2(графа8)Раздела VIII/1.2(графа8)РазделаVII*100   		
		ОписаниеУсловия = "1.1 (графа8) РазделаVIII / 1.1(графа8)РазделаVII * 100 <> 1.2 (графа8) Раздела VIII / 1.2 (графа8) РазделаVII * 100";
		ОписаниеОшибки = "";
		
		Если СтруктураСтрок.Раздел7_1_1.Графа8 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_1_1.Графа8 / СтруктураСтрок.Раздел7_1_1.Графа8*100, 0) ;
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_1_2.Графа8 = 0 Тогда
			Если СтруктураСтрок.Раздел8_1_2.Графа8 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе	 
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_1_2.Графа8 / СтруктураСтрок.Раздел7_1_2.Графа8*100, 0);
		КонецЕсли;    		
		
		Если ЗначениеЛевое <> ЗначениеПравое Тогда		
			
			ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_1_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_1_1.Графа8) + " * 100 <> " + Строка(СтруктураСтрок.Раздел8_1_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_1_2.Графа8) + " * 100";
			
			ОбластьСтрока.Область(1, 59 + КолДопКолонок, 1, 59 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 					
			ВсегоОшибок = ВсегоОшибок + 1;   
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);    		
		КонецЕсли;
		
		Проверка5_6 = ОписаниеУсловия+?(ОписаниеОшибки="", "", Символы.ПС+ОписаниеОшибки);
		ОбластьСтрока.Параметры.Проверка5_6 = Проверка5_6; 
		
		
		// ------------------------------------------------------------
		// 3 графа проценты
		ОписаниеОшибки3Графа = "(Проценты) ";
		КоличествоОшибокПо3ГрафеПроценты = 0;
		
		
		// 4) 2.1 (графа3) РазделаVIII / 2.1 (графа3) РазделаVII*100 <> 2.2 (графа3) РазделаVIII / 2.2 (графа3) РазделаVII*100   		
		ОписаниеУсловия = "2.1 (графа3) РазделаVIII / 2.1 (графа3) РазделаVII*100 <> 2.2 (графа3) РазделаVIII / 2.2 (графа3) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_2_1.Графа3 = 0 Тогда  
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_2_1.Графа3 / СтруктураСтрок.Раздел7_2_1.Графа3 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_2_2.Графа3 = 0 Тогда    					
			Если СтруктураСтрок.Раздел8_2_2.Графа3 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе	
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_2_2.Графа3 / СтруктураСтрок.Раздел7_2_2.Графа3 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_2_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_2_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_2_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_2_2.Графа3) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель);
		
		// 5) 3.1 (графа3) РазделаVIII / 3.1 (графа3) РазделаVII*100 <> 3.2 (графа3) РазделаVIII / 3.2 (графа3) РазделаVII*100   		
		ОписаниеУсловия = "3.1 (графа3) РазделаVIII / 3.1 (графа3) РазделаVII*100 <> 3.2 (графа3) РазделаVIII / 3.2 (графа3) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_3_1.Графа3 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_3_1.Графа3 / СтруктураСтрок.Раздел7_3_1.Графа3 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_3_2.Графа3 = 0 Тогда
			Если СтруктураСтрок.Раздел8_3_2.Графа3 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе	
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_3_2.Графа3 / СтруктураСтрок.Раздел7_3_2.Графа3 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_3_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_3_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_3_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_3_2.Графа3) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель);
		
		// 6) 4.1 (графа3) РазделаVIII / 4.1 (графа3) РазделаVII*100 <> 4.2 (графа3) РазделаVIII / 4.2 (графа3) РазделаVII*100   		
		ОписаниеУсловия = "4.1 (графа3) РазделаVIII / 4.1 (графа3) РазделаVII*100 <> 4.2 (графа3) РазделаVIII / 4.2 (графа3) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_4_1.Графа3 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_4_1.Графа3 / СтруктураСтрок.Раздел7_4_1.Графа3 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_4_2.Графа3 = 0 Тогда
			Если СтруктураСтрок.Раздел8_4_2.Графа3 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе	  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_4_2.Графа3 / СтруктураСтрок.Раздел7_4_2.Графа3 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_4_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_4_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_4_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_4_2.Графа3) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель);
		
		// 7) 5.1 (графа3) РазделаVIII / 5.1 (графа3) РазделаVII*100 <> 5.2 (графа3) РазделаVIII / 5.2 (графа3) РазделаVII*100   		
		ОписаниеУсловия = "5.1 (графа3) РазделаVIII / 5.1 (графа3) РазделаVII*100 <> 5.2 (графа3) РазделаVIII / 5.2 (графа3) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_5_1.Графа3 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_5_1.Графа3 / СтруктураСтрок.Раздел7_5_1.Графа3 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_5_2.Графа3 = 0 Тогда
			Если СтруктураСтрок.Раздел8_5_2.Графа3 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе	  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_5_2.Графа3 / СтруктураСтрок.Раздел7_5_2.Графа3 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_5_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_5_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_5_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_5_2.Графа3) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель);
		
		// 8) 6.1 (графа3) РазделаVIII / 6.1 (графа3) РазделаVII*100 <> 6.2 (графа3) РазделаVIII / 6.2 (графа3) РазделаVII*100   		
		ОписаниеУсловия = "6.1 (графа3) РазделаVIII / 6.1 (графа3) РазделаVII*100 <> 6.2 (графа3) РазделаVIII / 6.2 (графа3) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_6_1.Графа3 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_6_1.Графа3 / СтруктураСтрок.Раздел7_6_1.Графа3 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_6_2.Графа3 = 0 Тогда
			Если СтруктураСтрок.Раздел8_6_2.Графа3 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе	  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_6_2.Графа3 / СтруктураСтрок.Раздел7_6_2.Графа3 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_6_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_6_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_6_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_6_2.Графа3) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель);
		
		// 9) 7.1 (графа3) РазделаVIII / 7.1 (графа3) РазделаVII*100 <> 7.2 (графа3) РазделаVIII / 7.2 (графа3) РазделаVII*100   		
		ОписаниеУсловия = "7.1 (графа3) РазделаVIII / 7.1 (графа3) РазделаVII*100 <> 7.2 (графа3) РазделаVIII / 7.2 (графа3) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_7_1.Графа3 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_7_1.Графа3 / СтруктураСтрок.Раздел7_7_1.Графа3 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_7_2.Графа3 = 0 Тогда
			Если СтруктураСтрок.Раздел8_7_2.Графа3 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_7_2.Графа3 / СтруктураСтрок.Раздел7_7_2.Графа3 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_7_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_7_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_7_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_7_2.Графа3) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель);
		
		// 10) 8.1 (графа3) РазделаVIII / 8.1 (графа3) РазделаVII*100 <> 8.2 (графа3) РазделаVIII / 8.2 (графа3) РазделаVII*100   		
		ОписаниеУсловия = "8.1 (графа3) РазделаVIII / 8.1 (графа3) РазделаVII*100 <> 8.2 (графа3) РазделаVIII / 8.2 (графа3) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_8_1.Графа3 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_8_1.Графа3 / СтруктураСтрок.Раздел7_8_1.Графа3 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_8_2.Графа3 = 0 Тогда
			Если СтруктураСтрок.Раздел8_8_2.Графа3 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_8_2.Графа3 / СтруктураСтрок.Раздел7_8_2.Графа3 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_8_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_8_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_8_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_8_2.Графа3) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель);
		
		// 11) 9.1 (графа3) РазделаVIII / 9.1 (графа3) РазделаVII*100 <> 9.2 (графа3) РазделаVIII / 9.2 (графа3) РазделаVII*100   		
		ОписаниеУсловия = "9.1 (графа3) РазделаVIII / 9.1 (графа3) РазделаVII*100 <> 9.2 (графа3) РазделаVIII / 9.2 (графа3) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_9_1.Графа3 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_9_1.Графа3 / СтруктураСтрок.Раздел7_9_1.Графа3 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_9_2.Графа3 = 0 Тогда
			Если СтруктураСтрок.Раздел8_9_2.Графа3 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_9_2.Графа3 / СтруктураСтрок.Раздел7_9_2.Графа3 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_9_1.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_9_1.Графа3) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_9_2.Графа3) + " / " + Строка(СтруктураСтрок.Раздел7_9_2.Графа3) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки3Графа, КоличествоОшибокПо3ГрафеПроценты, СтрокаРазделитель);
		
		Если КоличествоОшибокПо3ГрафеПроценты > 0 Тогда
			ОбластьСтрока.Область(1, 60 + КолДопКолонок, 1, 60 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо3ГрафеПроценты = ?(КоличествоОшибокПо3ГрафеПроценты = 0, "", КоличествоОшибокПо3ГрафеПроценты);				
		ОбластьСтрока.Параметры.ОписаниеОшибки3Графа = ОписаниеОшибки3Графа; 
		
		// 4 графа проценты
		ОписаниеОшибки4Графа = "(Проценты) ";
		КоличествоОшибокПо4ГрафеПроценты = 0;
		
		
		// 12) 2.1 (Графа4) РазделаVIII / 2.1 (графа4) РазделаVII*100 <> 2.2 (графа4) РазделаVIII / 2.2 (графа4) РазделаVII*100   		
		ОписаниеУсловия = "2.1 (графа4) РазделаVIII / 2.1 (графа4) РазделаVII*100 <> 2.2 (графа4) РазделаVIII / 2.2 (графа4) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_2_1.Графа4 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_2_1.Графа4 / СтруктураСтрок.Раздел7_2_1.Графа4 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_2_2.Графа4 = 0 Тогда
			Если СтруктураСтрок.Раздел8_2_2.Графа4 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_2_2.Графа4 / СтруктураСтрок.Раздел7_2_2.Графа4 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_2_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_2_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_2_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_2_2.Графа4) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель);
		
		// 13) 3.1 (графа4) РазделаVIII / 3.1 (графа4) РазделаVII*100 <> 3.2 (графа4) РазделаVIII / 3.2 (графа4) РазделаVII*100   		
		ОписаниеУсловия = "3.1 (графа4) РазделаVIII / 3.1 (графа4) РазделаVII*100 <> 3.2 (графа4) РазделаVIII / 3.2 (графа4) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_3_1.Графа4 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_3_1.Графа4 / СтруктураСтрок.Раздел7_3_1.Графа4 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_3_2.Графа4 = 0 Тогда
			Если СтруктураСтрок.Раздел8_3_2.Графа4 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_3_2.Графа4 / СтруктураСтрок.Раздел7_3_2.Графа4 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_3_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_3_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_3_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_3_2.Графа4) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель);
		
		// 14) 4.1 (графа4) РазделаVIII / 4.1 (графа4) РазделаVII*100 <> 4.2 (графа4) РазделаVIII / 4.2 (графа4) РазделаVII*100   		
		ОписаниеУсловия = "4.1 (графа4) РазделаVIII / 4.1 (графа4) РазделаVII*100 <> 4.2 (графа4) РазделаVIII / 4.2 (графа4) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_4_1.Графа4 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_4_1.Графа4 / СтруктураСтрок.Раздел7_4_1.Графа4 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_4_2.Графа4 = 0 Тогда
			Если СтруктураСтрок.Раздел8_4_2.Графа4 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_4_2.Графа4 / СтруктураСтрок.Раздел7_4_2.Графа4 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_4_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_4_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_4_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_4_2.Графа4) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель);
		
		// 15) 5.1 (графа4) РазделаVIII / 5.1 (графа4) РазделаVII*100 <> 5.2 (графа4) РазделаVIII / 5.2 (графа4) РазделаVII*100   		
		ОписаниеУсловия = "5.1 (графа4) РазделаVIII / 5.1 (графа4) РазделаVII*100 <> 5.2 (графа4) РазделаVIII / 5.2 (графа4) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_5_1.Графа4 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_5_1.Графа4 / СтруктураСтрок.Раздел7_5_1.Графа4 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_5_2.Графа4 = 0 Тогда
			Если СтруктураСтрок.Раздел8_5_2.Графа4 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_5_2.Графа4 / СтруктураСтрок.Раздел7_5_2.Графа4 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_5_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_5_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_5_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_5_2.Графа4) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель);
		
		// 16) 6.1 (графа4) РазделаVIII / 6.1 (графа4) РазделаVII*100 <> 6.2 (графа4) РазделаVIII / 6.2 (графа4) РазделаVII*100   		
		ОписаниеУсловия = "6.1 (графа4) РазделаVIII / 6.1 (графа4) РазделаVII*100 <> 6.2 (графа4) РазделаVIII / 6.2 (графа4) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_6_1.Графа4 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_6_1.Графа4 / СтруктураСтрок.Раздел7_6_1.Графа4 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_6_2.Графа4 = 0 Тогда
			Если СтруктураСтрок.Раздел8_6_2.Графа4 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе    
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_6_2.Графа4 / СтруктураСтрок.Раздел7_6_2.Графа4 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_6_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_6_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_6_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_6_2.Графа4) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель);
		
		// 17) 7.1 (графа4) РазделаVIII / 7.1 (графа4) РазделаVII*100 <> 7.2 (графа4) РазделаVIII / 7.2 (графа4) РазделаVII*100   		
		ОписаниеУсловия = "7.1 (графа4) РазделаVIII / 7.1 (графа4) РазделаVII*100 <> 7.2 (графа4) РазделаVIII / 7.2 (графа4) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_7_1.Графа4 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_7_1.Графа4 / СтруктураСтрок.Раздел7_7_1.Графа4 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_7_2.Графа4 = 0 Тогда
			Если СтруктураСтрок.Раздел8_7_2.Графа4 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_7_2.Графа4 / СтруктураСтрок.Раздел7_7_2.Графа4 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_7_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_7_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_7_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_7_2.Графа4) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель);
		
		// 18) 8.1 (графа4) РазделаVIII / 8.1 (графа4) РазделаVII*100 <> 8.2 (графа4) РазделаVIII / 8.2 (графа4) РазделаVII*100   		
		ОписаниеУсловия = "8.1 (графа4) РазделаVIII / 8.1 (графа4) РазделаVII*100 <> 8.2 (графа4) РазделаVIII / 8.2 (графа4) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_8_1.Графа4 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_8_1.Графа4 / СтруктураСтрок.Раздел7_8_1.Графа4 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_8_2.Графа4 = 0 Тогда
			Если СтруктураСтрок.Раздел8_8_2.Графа4 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_8_2.Графа4 / СтруктураСтрок.Раздел7_8_2.Графа4 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_8_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_8_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_8_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_8_2.Графа4) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель);
		
		// 19) 9.1 (графа4) РазделаVIII / 9.1 (графа4) РазделаVII*100 <> 9.2 (графа4) РазделаVIII / 9.2 (графа4) РазделаVII*100   		
		ОписаниеУсловия = "9.1 (графа4) РазделаVIII / 9.1 (графа4) РазделаVII*100 <> 9.2 (графа4) РазделаVIII / 9.2 (графа4) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_9_1.Графа4 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_9_1.Графа4 / СтруктураСтрок.Раздел7_9_1.Графа4 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_9_2.Графа4 = 0 Тогда
			Если СтруктураСтрок.Раздел8_9_2.Графа4 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_9_2.Графа4 / СтруктураСтрок.Раздел7_9_2.Графа4 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_9_1.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_9_1.Графа4) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_9_2.Графа4) + " / " + Строка(СтруктураСтрок.Раздел7_9_2.Графа4) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки4Графа, КоличествоОшибокПо4ГрафеПроценты, СтрокаРазделитель);
		
		Если КоличествоОшибокПо4ГрафеПроценты > 0 Тогда
			ОбластьСтрока.Область(1, 61 + КолДопКолонок, 1, 61 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо4ГрафеПроценты = ?(КоличествоОшибокПо4ГрафеПроценты = 0, "", КоличествоОшибокПо4ГрафеПроценты);				
		ОбластьСтрока.Параметры.ОписаниеОшибки4Графа = ОписаниеОшибки4Графа; 
		
		
		// 5 графа проценты
		ОписаниеОшибки5Графа = "(Проценты) ";
		КоличествоОшибокПо5ГрафеПроценты = 0;
		
		// 20) 2.1 (Графа5) РазделаVIII / 2.1 (Графа5) РазделаVII*100 <> 2.2 (Графа5) РазделаVIII / 2.2 (Графа5) РазделаVII*100   		
		ОписаниеУсловия = "2.1 (Графа5) РазделаVIII / 2.1 (Графа5) РазделаVII*100 <> 2.2 (Графа5) РазделаVIII / 2.2 (Графа5) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_2_1.Графа5 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_2_1.Графа5 / СтруктураСтрок.Раздел7_2_1.Графа5 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_2_2.Графа5 = 0 Тогда
			Если СтруктураСтрок.Раздел8_2_2.Графа5 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе      
				ЗначениеПравое = 0;
			КонецЕсли; 
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_2_2.Графа5 / СтруктураСтрок.Раздел7_2_2.Графа5 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_2_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_2_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_2_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_2_2.Графа5) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель);
		
		// 21) 3.1 (Графа5) РазделаVIII / 3.1 (Графа5) РазделаVII*100 <> 3.2 (Графа5) РазделаVIII / 3.2 (Графа5) РазделаVII*100   		
		ОписаниеУсловия = "3.1 (Графа5) РазделаVIII / 3.1 (Графа5) РазделаVII*100 <> 3.2 (Графа5) РазделаVIII / 3.2 (Графа5) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_3_1.Графа5 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_3_1.Графа5 / СтруктураСтрок.Раздел7_3_1.Графа5 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_3_2.Графа5 = 0 Тогда
			Если СтруктураСтрок.Раздел8_3_2.Графа5 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_3_2.Графа5 / СтруктураСтрок.Раздел7_3_2.Графа5 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_3_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_3_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_3_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_3_2.Графа5) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель);
		
		// 22) 4.1 (Графа5) РазделаVIII / 4.1 (Графа5) РазделаVII*100 <> 4.2 (Графа5) РазделаVIII / 4.2 (Графа5) РазделаVII*100   		
		ОписаниеУсловия = "4.1 (Графа5) РазделаVIII / 4.1 (Графа5) РазделаVII*100 <> 4.2 (Графа5) РазделаVIII / 4.2 (Графа5) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_4_1.Графа5 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_4_1.Графа5 / СтруктураСтрок.Раздел7_4_1.Графа5 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_4_2.Графа5 = 0 Тогда
			Если СтруктураСтрок.Раздел8_4_2.Графа5 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли; 
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_4_2.Графа5 / СтруктураСтрок.Раздел7_4_2.Графа5 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_4_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_4_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_4_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_4_2.Графа5) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель);
		
		// 23) 5.1 (Графа5) РазделаVIII / 5.1 (Графа5) РазделаVII*100 <> 5.2 (Графа5) РазделаVIII / 5.2 (Графа5) РазделаVII*100   		
		ОписаниеУсловия = "5.1 (Графа5) РазделаVIII / 5.1 (Графа5) РазделаVII*100 <> 5.2 (Графа5) РазделаVIII / 5.2 (Графа5) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_5_1.Графа5 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_5_1.Графа5 / СтруктураСтрок.Раздел7_5_1.Графа5 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_5_2.Графа5 = 0 Тогда
			Если СтруктураСтрок.Раздел8_5_2.Графа5 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_5_2.Графа5 / СтруктураСтрок.Раздел7_5_2.Графа5 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_5_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_5_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_5_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_5_2.Графа5) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель);
		
		// 24) 6.1 (Графа5) РазделаVIII / 6.1 (Графа5) РазделаVII*100 <> 6.2 (Графа5) РазделаVIII / 6.2 (Графа5) РазделаVII*100   		
		ОписаниеУсловия = "6.1 (Графа5) РазделаVIII / 6.1 (Графа5) РазделаVII*100 <> 6.2 (Графа5) РазделаVIII / 6.2 (Графа5) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_6_1.Графа5 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_6_1.Графа5 / СтруктураСтрок.Раздел7_6_1.Графа5 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_6_2.Графа5 = 0 Тогда
			Если СтруктураСтрок.Раздел8_6_2.Графа5 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_6_2.Графа5 / СтруктураСтрок.Раздел7_6_2.Графа5 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_6_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_6_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_6_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_6_2.Графа5) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель);
		
		// 25) 7.1 (Графа5) РазделаVIII / 7.1 (Графа5) РазделаVII*100 <> 7.2 (Графа5) РазделаVIII / 7.2 (Графа5) РазделаVII*100   		
		ОписаниеУсловия = "7.1 (Графа5) РазделаVIII / 7.1 (Графа5) РазделаVII*100 <> 7.2 (Графа5) РазделаVIII / 7.2 (Графа5) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_7_1.Графа5 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_7_1.Графа5 / СтруктураСтрок.Раздел7_7_1.Графа5 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_7_2.Графа5 = 0 Тогда
			Если СтруктураСтрок.Раздел8_7_2.Графа5 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_7_2.Графа5 / СтруктураСтрок.Раздел7_7_2.Графа5 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_7_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_7_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_7_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_7_2.Графа5) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель);
		
		// 26) 8.1 (Графа5) РазделаVIII / 8.1 (Графа5) РазделаVII*100 <> 8.2 (Графа5) РазделаVIII / 8.2 (Графа5) РазделаVII*100   		
		ОписаниеУсловия = "8.1 (Графа5) РазделаVIII / 8.1 (Графа5) РазделаVII*100 <> 8.2 (Графа5) РазделаVIII / 8.2 (Графа5) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_8_1.Графа5 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_8_1.Графа5 / СтруктураСтрок.Раздел7_8_1.Графа5 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_8_2.Графа5 = 0 Тогда
			Если СтруктураСтрок.Раздел8_8_2.Графа5 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_8_2.Графа5 / СтруктураСтрок.Раздел7_8_2.Графа5 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_8_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_8_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_8_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_8_2.Графа5) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель);
		
		// 27) 9.1 (Графа5) РазделаVIII / 9.1 (Графа5) РазделаVII*100 <> 9.2 (Графа5) РазделаVIII / 9.2 (Графа5) РазделаVII*100   		
		ОписаниеУсловия = "9.1 (Графа5) РазделаVIII / 9.1 (Графа5) РазделаVII*100 <> 9.2 (Графа5) РазделаVIII / 9.2 (Графа5) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_9_1.Графа5 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_9_1.Графа5 / СтруктураСтрок.Раздел7_9_1.Графа5 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_9_2.Графа5 = 0 Тогда  			
			Если СтруктураСтрок.Раздел8_9_2.Графа5 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     	
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_9_2.Графа5 / СтруктураСтрок.Раздел7_9_2.Графа5 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_9_1.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_9_1.Графа5) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_9_2.Графа5) + " / " + Строка(СтруктураСтрок.Раздел7_9_2.Графа5) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки5Графа, КоличествоОшибокПо5ГрафеПроценты, СтрокаРазделитель);
		
		Если КоличествоОшибокПо5ГрафеПроценты > 0 Тогда
			ОбластьСтрока.Область(1, 62 + КолДопКолонок, 1, 62 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо5ГрафеПроценты = ?(КоличествоОшибокПо5ГрафеПроценты = 0, "", КоличествоОшибокПо5ГрафеПроценты);				
		ОбластьСтрока.Параметры.ОписаниеОшибки5Графа = ОписаниеОшибки5Графа; 
		
		// 6 графа проценты
		ОписаниеОшибки6Графа = "(Проценты) ";
		КоличествоОшибокПо6ГрафеПроценты = 0;
		
		// 28) 2.1 (Графа6) РазделаVIII / 2.1 (Графа6) РазделаVII*100 <> 2.2 (Графа6) РазделаVIII / 2.2 (Графа6) РазделаVII*100   		
		ОписаниеУсловия = "2.1 (Графа6) РазделаVIII / 2.1 (Графа6) РазделаVII*100 <> 2.2 (Графа6) РазделаVIII / 2.2 (Графа6) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_2_1.Графа6 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_2_1.Графа6 / СтруктураСтрок.Раздел7_2_1.Графа6 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_2_2.Графа6 = 0 Тогда
			Если СтруктураСтрок.Раздел8_2_2.Графа6 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_2_2.Графа6 / СтруктураСтрок.Раздел7_2_2.Графа6 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_2_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_2_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_2_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_2_2.Графа6) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель);
		
		// 29) 3.1 (Графа6) РазделаVIII / 3.1 (Графа6) РазделаVII*100 <> 3.2 (Графа6) РазделаVIII / 3.2 (Графа6) РазделаVII*100   		
		ОписаниеУсловия = "3.1 (Графа6) РазделаVIII / 3.1 (Графа6) РазделаVII*100 <> 3.2 (Графа6) РазделаVIII / 3.2 (Графа6) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_3_1.Графа6 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_3_1.Графа6 / СтруктураСтрок.Раздел7_3_1.Графа6 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_3_2.Графа6 = 0 Тогда
			Если СтруктураСтрок.Раздел8_3_2.Графа6 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе    
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_3_2.Графа6 / СтруктураСтрок.Раздел7_3_2.Графа6 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_3_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_3_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_3_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_3_2.Графа6) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель);
		
		// 30) 4.1 (Графа6) РазделаVIII / 4.1 (Графа6) РазделаVII*100 <> 4.2 (Графа6) РазделаVIII / 4.2 (Графа6) РазделаVII*100   		
		ОписаниеУсловия = "4.1 (Графа6) РазделаVIII / 4.1 (Графа6) РазделаVII*100 <> 4.2 (Графа6) РазделаVIII / 4.2 (Графа6) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_4_1.Графа6 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_4_1.Графа6 / СтруктураСтрок.Раздел7_4_1.Графа6 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_4_2.Графа6 = 0 Тогда
			Если СтруктураСтрок.Раздел8_4_2.Графа6 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе 
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_4_2.Графа6 / СтруктураСтрок.Раздел7_4_2.Графа6 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_4_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_4_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_4_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_4_2.Графа6) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель);
		
		// 31) 5.1 (Графа6) РазделаVIII / 5.1 (Графа6) РазделаVII*100 <> 5.2 (Графа6) РазделаVIII / 5.2 (Графа6) РазделаVII*100   		
		ОписаниеУсловия = "5.1 (Графа6) РазделаVIII / 5.1 (Графа6) РазделаVII*100 <> 5.2 (Графа6) РазделаVIII / 5.2 (Графа6) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_5_1.Графа6 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_5_1.Графа6 / СтруктураСтрок.Раздел7_5_1.Графа6 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_5_2.Графа6 = 0 Тогда
			Если СтруктураСтрок.Раздел8_5_2.Графа6 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_5_2.Графа6 / СтруктураСтрок.Раздел7_5_2.Графа6 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_5_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_5_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_5_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_5_2.Графа6) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель);
		
		// 32) 6.1 (Графа6) РазделаVIII / 6.1 (Графа6) РазделаVII*100 <> 6.2 (Графа6) РазделаVIII / 6.2 (Графа6) РазделаVII*100   		
		ОписаниеУсловия = "6.1 (Графа6) РазделаVIII / 6.1 (Графа6) РазделаVII*100 <> 6.2 (Графа6) РазделаVIII / 6.2 (Графа6) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_6_1.Графа6 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_6_1.Графа6 / СтруктураСтрок.Раздел7_6_1.Графа6 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_6_2.Графа6 = 0 Тогда
			Если СтруктураСтрок.Раздел8_6_2.Графа6 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_6_2.Графа6 / СтруктураСтрок.Раздел7_6_2.Графа6 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_6_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_6_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_6_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_6_2.Графа6) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель);
		
		// 33) 7.1 (Графа6) РазделаVIII / 7.1 (Графа6) РазделаVII*100 <> 7.2 (Графа6) РазделаVIII / 7.2 (Графа6) РазделаVII*100   		
		ОписаниеУсловия = "7.1 (Графа6) РазделаVIII / 7.1 (Графа6) РазделаVII*100 <> 7.2 (Графа6) РазделаVIII / 7.2 (Графа6) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_7_1.Графа6 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_7_1.Графа6 / СтруктураСтрок.Раздел7_7_1.Графа6 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_7_2.Графа6 = 0 Тогда
			Если СтруктураСтрок.Раздел8_7_2.Графа6 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_7_2.Графа6 / СтруктураСтрок.Раздел7_7_2.Графа6 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_7_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_7_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_7_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_7_2.Графа6) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель);
		
		// 34) 8.1 (Графа6) РазделаVIII / 8.1 (Графа6) РазделаVII*100 <> 8.2 (Графа6) РазделаVIII / 8.2 (Графа6) РазделаVII*100   		
		ОписаниеУсловия = "8.1 (Графа6) РазделаVIII / 8.1 (Графа6) РазделаVII*100 <> 8.2 (Графа6) РазделаVIII / 8.2 (Графа6) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_8_1.Графа6 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_8_1.Графа6 / СтруктураСтрок.Раздел7_8_1.Графа6 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_8_2.Графа6 = 0 Тогда
			Если СтруктураСтрок.Раздел8_8_2.Графа6 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_8_2.Графа6 / СтруктураСтрок.Раздел7_8_2.Графа6 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_8_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_8_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_8_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_8_2.Графа6) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель);
		
		// 35) 9.1 (Графа6) РазделаVIII / 9.1 (Графа6) РазделаVII*100 <> 9.2 (Графа6) РазделаVIII / 9.2 (Графа6) РазделаVII*100   		
		ОписаниеУсловия = "9.1 (Графа6) РазделаVIII / 9.1 (Графа6) РазделаVII*100 <> 9.2 (Графа6) РазделаVIII / 9.2 (Графа6) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_9_1.Графа6 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_9_1.Графа6 / СтруктураСтрок.Раздел7_9_1.Графа6 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_9_2.Графа6 = 0 Тогда
			Если СтруктураСтрок.Раздел8_9_2.Графа6 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_9_2.Графа6 / СтруктураСтрок.Раздел7_9_2.Графа6 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_9_1.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_9_1.Графа6) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_9_2.Графа6) + " / " + Строка(СтруктураСтрок.Раздел7_9_2.Графа6) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки6Графа, КоличествоОшибокПо6ГрафеПроценты, СтрокаРазделитель);
		
		Если КоличествоОшибокПо6ГрафеПроценты > 0 Тогда
			ОбластьСтрока.Область(1, 63 + КолДопКолонок, 1, 63 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо6ГрафеПроценты = ?(КоличествоОшибокПо6ГрафеПроценты = 0, "", КоличествоОшибокПо6ГрафеПроценты);				
		ОбластьСтрока.Параметры.ОписаниеОшибки6Графа = ОписаниеОшибки6Графа; 
		
		// 7 графа проценты
		ОписаниеОшибки7Графа = "(Проценты) ";
		КоличествоОшибокПо7ГрафеПроценты = 0;
		
		// 36) 2.1 (Графа7) РазделаVIII / 2.1 (Графа7) РазделаVII*100 <> 2.2 (Графа7) РазделаVIII / 2.2 (Графа7) РазделаVII*100   		
		ОписаниеУсловия = "2.1 (Графа7) РазделаVIII / 2.1 (Графа7) РазделаVII*100 <> 2.2 (Графа7) РазделаVIII / 2.2 (Графа7) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_2_1.Графа7 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_2_1.Графа7 / СтруктураСтрок.Раздел7_2_1.Графа7 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_2_2.Графа7 = 0 Тогда
			Если СтруктураСтрок.Раздел8_2_2.Графа7 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_2_2.Графа7 / СтруктураСтрок.Раздел7_2_2.Графа7 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_2_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_2_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_2_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_2_2.Графа7) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель);
		
		// 37) 3.1 (Графа7) РазделаVIII / 3.1 (Графа7) РазделаVII*100 <> 3.2 (Графа7) РазделаVIII / 3.2 (Графа7) РазделаVII*100   		
		ОписаниеУсловия = "3.1 (Графа7) РазделаVIII / 3.1 (Графа7) РазделаVII*100 <> 3.2 (Графа7) РазделаVIII / 3.2 (Графа7) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_3_1.Графа7 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_3_1.Графа7 / СтруктураСтрок.Раздел7_3_1.Графа7 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_3_2.Графа7 = 0 Тогда
			Если СтруктураСтрок.Раздел8_3_2.Графа7 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе   
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_3_2.Графа7 / СтруктураСтрок.Раздел7_3_2.Графа7 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_3_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_3_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_3_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_3_2.Графа7) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель);
		
		// 38) 4.1 (Графа7) РазделаVIII / 4.1 (Графа7) РазделаVII*100 <> 4.2 (Графа7) РазделаVIII / 4.2 (Графа7) РазделаVII*100   		
		ОписаниеУсловия = "4.1 (Графа7) РазделаVIII / 4.1 (Графа7) РазделаVII*100 <> 4.2 (Графа7) РазделаVIII / 4.2 (Графа7) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_4_1.Графа7 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_4_1.Графа7 / СтруктураСтрок.Раздел7_4_1.Графа7 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_4_2.Графа7 = 0 Тогда
			Если СтруктураСтрок.Раздел8_4_2.Графа7 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_4_2.Графа7 / СтруктураСтрок.Раздел7_4_2.Графа7 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_4_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_4_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_4_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_4_2.Графа7) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель);
		
		// 39) 5.1 (Графа7) РазделаVIII / 5.1 (Графа7) РазделаVII*100 <> 5.2 (Графа7) РазделаVIII / 5.2 (Графа7) РазделаVII*100   		
		ОписаниеУсловия = "5.1 (Графа7) РазделаVIII / 5.1 (Графа7) РазделаVII*100 <> 5.2 (Графа7) РазделаVIII / 5.2 (Графа7) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_5_1.Графа7 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_5_1.Графа7 / СтруктураСтрок.Раздел7_5_1.Графа7 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_5_2.Графа7 = 0 Тогда
			Если СтруктураСтрок.Раздел8_5_2.Графа7 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_5_2.Графа7 / СтруктураСтрок.Раздел7_5_2.Графа7 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_5_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_5_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_5_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_5_2.Графа7) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель);
		
		// 40) 6.1 (Графа7) РазделаVIII / 6.1 (Графа7) РазделаVII*100 <> 6.2 (Графа7) РазделаVIII / 6.2 (Графа7) РазделаVII*100   		
		ОписаниеУсловия = "6.1 (Графа7) РазделаVIII / 6.1 (Графа7) РазделаVII*100 <> 6.2 (Графа7) РазделаVIII / 6.2 (Графа7) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_6_1.Графа7 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_6_1.Графа7 / СтруктураСтрок.Раздел7_6_1.Графа7 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_6_2.Графа7 = 0 Тогда
			Если СтруктураСтрок.Раздел8_6_2.Графа7 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_6_2.Графа7 / СтруктураСтрок.Раздел7_6_2.Графа7 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_6_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_6_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_6_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_6_2.Графа7) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель);
		
		// 41) 7.1 (Графа7) РазделаVIII / 7.1 (Графа7) РазделаVII*100 <> 7.2 (Графа7) РазделаVIII / 7.2 (Графа7) РазделаVII*100   		
		ОписаниеУсловия = "7.1 (Графа7) РазделаVIII / 7.1 (Графа7) РазделаVII*100 <> 7.2 (Графа7) РазделаVIII / 7.2 (Графа7) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_7_1.Графа7 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_7_1.Графа7 / СтруктураСтрок.Раздел7_7_1.Графа7 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_7_2.Графа7 = 0 Тогда
			Если СтруктураСтрок.Раздел8_7_2.Графа7 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_7_2.Графа7 / СтруктураСтрок.Раздел7_7_2.Графа7 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_7_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_7_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_7_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_7_2.Графа7) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель);
		
		// 42) 8.1 (Графа7) РазделаVIII / 8.1 (Графа7) РазделаVII*100 <> 8.2 (Графа7) РазделаVIII / 8.2 (Графа7) РазделаVII*100   		
		ОписаниеУсловия = "8.1 (Графа7) РазделаVIII / 8.1 (Графа7) РазделаVII*100 <> 8.2 (Графа7) РазделаVIII / 8.2 (Графа7) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_8_1.Графа7 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_8_1.Графа7 / СтруктураСтрок.Раздел7_8_1.Графа7 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_8_2.Графа7 = 0 Тогда
			Если СтруктураСтрок.Раздел8_8_2.Графа7 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_8_2.Графа7 / СтруктураСтрок.Раздел7_8_2.Графа7 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_8_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_8_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_8_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_8_2.Графа7) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель);
		
		// 43) 9.1 (Графа7) РазделаVIII / 9.1 (Графа7) РазделаVII*100 <> 9.2 (Графа7) РазделаVIII / 9.2 (Графа7) РазделаVII*100   		
		ОписаниеУсловия = "9.1 (Графа7) РазделаVIII / 9.1 (Графа7) РазделаVII*100 <> 9.2 (Графа7) РазделаVIII / 9.2 (Графа7) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_9_1.Графа7 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_9_1.Графа7 / СтруктураСтрок.Раздел7_9_1.Графа7 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_9_2.Графа7 = 0 Тогда
			Если СтруктураСтрок.Раздел8_9_2.Графа7 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе   
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_9_2.Графа7 / СтруктураСтрок.Раздел7_9_2.Графа7 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_9_1.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_9_1.Графа7) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_9_2.Графа7) + " / " + Строка(СтруктураСтрок.Раздел7_9_2.Графа7) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки7Графа, КоличествоОшибокПо7ГрафеПроценты, СтрокаРазделитель);
		
		Если КоличествоОшибокПо7ГрафеПроценты > 0 Тогда
			ОбластьСтрока.Область(1, 64 + КолДопКолонок, 1, 64 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо7ГрафеПроценты = ?(КоличествоОшибокПо7ГрафеПроценты = 0, "", КоличествоОшибокПо7ГрафеПроценты);				
		ОбластьСтрока.Параметры.ОписаниеОшибки7Графа = ОписаниеОшибки7Графа; 
		
		// 8 графа проценты
		ОписаниеОшибки8Графа = "(Проценты) ";
		КоличествоОшибокПо8ГрафеПроценты = 0;
		
		// 36) 2.1 (Графа8) РазделаVIII / 2.1 (Графа8) РазделаVII*100 <> 2.2 (Графа8) РазделаVIII / 2.2 (Графа8) РазделаVII*100   		
		ОписаниеУсловия = "2.1 (Графа8) РазделаVIII / 2.1 (Графа8) РазделаVII*100 <> 2.2 (Графа8) РазделаVIII / 2.2 (Графа8) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_2_1.Графа8 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_2_1.Графа8 / СтруктураСтрок.Раздел7_2_1.Графа8 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_2_2.Графа8 = 0 Тогда   			
			Если СтруктураСтрок.Раздел8_2_2.Графа8 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_2_2.Графа8 / СтруктураСтрок.Раздел7_2_2.Графа8 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_2_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_2_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_2_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_2_2.Графа8) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель);
		
		// 37) 3.1 (Графа8) РазделаVIII / 3.1 (Графа8) РазделаVII*100 <> 3.2 (Графа8) РазделаVIII / 3.2 (Графа8) РазделаVII*100   		
		ОписаниеУсловия = "3.1 (Графа8) РазделаVIII / 3.1 (Графа8) РазделаVII*100 <> 3.2 (Графа8) РазделаVIII / 3.2 (Графа8) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_3_1.Графа8 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_3_1.Графа8 / СтруктураСтрок.Раздел7_3_1.Графа8 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_3_2.Графа8 = 0 Тогда
			Если СтруктураСтрок.Раздел8_3_2.Графа8 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_3_2.Графа8 / СтруктураСтрок.Раздел7_3_2.Графа8 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_3_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_3_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_3_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_3_2.Графа8) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель);
		
		// 38) 4.1 (Графа8) РазделаVIII / 4.1 (Графа8) РазделаVII*100 <> 4.2 (Графа8) РазделаVIII / 4.2 (Графа8) РазделаVII*100   		
		ОписаниеУсловия = "4.1 (Графа8) РазделаVIII / 4.1 (Графа8) РазделаVII*100 <> 4.2 (Графа8) РазделаVIII / 4.2 (Графа8) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_4_1.Графа8 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_4_1.Графа8 / СтруктураСтрок.Раздел7_4_1.Графа8 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_4_2.Графа8 = 0 Тогда
			Если СтруктураСтрок.Раздел8_4_2.Графа8 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_4_2.Графа8 / СтруктураСтрок.Раздел7_4_2.Графа8 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_4_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_4_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_4_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_4_2.Графа8) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель);
		
		// 39) 5.1 (Графа8) РазделаVIII / 5.1 (Графа8) РазделаVII*100 <> 5.2 (Графа8) РазделаVIII / 5.2 (Графа8) РазделаVII*100   		
		ОписаниеУсловия = "5.1 (Графа8) РазделаVIII / 5.1 (Графа8) РазделаVII*100 <> 5.2 (Графа8) РазделаVIII / 5.2 (Графа8) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_5_1.Графа8 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_5_1.Графа8 / СтруктураСтрок.Раздел7_5_1.Графа8 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_5_2.Графа8 = 0 Тогда
			Если СтруктураСтрок.Раздел8_5_2.Графа8 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе     
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_5_2.Графа8 / СтруктураСтрок.Раздел7_5_2.Графа8 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_5_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_5_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_5_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_5_2.Графа8) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель);
		
		// 40) 6.1 (Графа8) РазделаVIII / 6.1 (Графа8) РазделаVII*100 <> 6.2 (Графа8) РазделаVIII / 6.2 (Графа8) РазделаVII*100   		
		ОписаниеУсловия = "6.1 (Графа8) РазделаVIII / 6.1 (Графа8) РазделаVII*100 <> 6.2 (Графа8) РазделаVIII / 6.2 (Графа8) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_6_1.Графа8 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_6_1.Графа8 / СтруктураСтрок.Раздел7_6_1.Графа8 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_6_2.Графа8 = 0 Тогда
			Если СтруктураСтрок.Раздел8_6_2.Графа8 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе 
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_6_2.Графа8 / СтруктураСтрок.Раздел7_6_2.Графа8 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_6_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_6_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_6_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_6_2.Графа8) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель);
		
		// 41) 7.1 (Графа8) РазделаVIII / 7.1 (Графа8) РазделаVII*100 <> 7.2 (Графа8) РазделаVIII / 7.2 (Графа8) РазделаVII*100   		
		ОписаниеУсловия = "7.1 (Графа8) РазделаVIII / 7.1 (Графа8) РазделаVII*100 <> 7.2 (Графа8) РазделаVIII / 7.2 (Графа8) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_7_1.Графа8 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_7_1.Графа8 / СтруктураСтрок.Раздел7_7_1.Графа8 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_7_2.Графа8 = 0 Тогда
			Если СтруктураСтрок.Раздел8_7_2.Графа8 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_7_2.Графа8 / СтруктураСтрок.Раздел7_7_2.Графа8 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_7_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_7_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_7_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_7_2.Графа8) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель);
		
		// 42) 8.1 (Графа8) РазделаVIII / 8.1 (Графа8) РазделаVII*100 <> 8.2 (Графа8) РазделаVIII / 8.2 (Графа8) РазделаVII*100   		
		ОписаниеУсловия = "8.1 (Графа8) РазделаVIII / 8.1 (Графа8) РазделаVII*100 <> 8.2 (Графа8) РазделаVIII / 8.2 (Графа8) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_8_1.Графа8 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_8_1.Графа8 / СтруктураСтрок.Раздел7_8_1.Графа8 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_8_2.Графа8 = 0 Тогда
			Если СтруктураСтрок.Раздел8_8_2.Графа8 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_8_2.Графа8 / СтруктураСтрок.Раздел7_8_2.Графа8 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_8_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_8_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_8_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_8_2.Графа8) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель);
		
		// 43) 9.1 (Графа8) РазделаVIII / 9.1 (Графа8) РазделаVII*100 <> 9.2 (Графа8) РазделаVIII / 9.2 (Графа8) РазделаVII*100   		
		ОписаниеУсловия = "9.1 (Графа8) РазделаVIII / 9.1 (Графа8) РазделаVII*100 <> 9.2 (Графа8) РазделаVIII / 9.2 (Графа8) РазделаVII*100";   	
		Если СтруктураСтрок.Раздел7_9_1.Графа8 = 0 Тогда
			ЗначениеЛевое = 0;
		Иначе			
			ЗначениеЛевое = Окр(СтруктураСтрок.Раздел8_9_1.Графа8 / СтруктураСтрок.Раздел7_9_1.Графа8 *100, 0);
		КонецЕсли;
		
		Если СтруктураСтрок.Раздел7_9_2.Графа8 = 0 Тогда
			Если СтруктураСтрок.Раздел8_9_2.Графа8 = 0 Тогда
				ЗначениеПравое = ЗначениеЛевое;
			Иначе  
				ЗначениеПравое = 0;
			КонецЕсли;
		Иначе			
			ЗначениеПравое = Окр(СтруктураСтрок.Раздел8_9_2.Графа8 / СтруктураСтрок.Раздел7_9_2.Графа8 *100, 0);
		КонецЕсли;  
		
		ОписаниеОшибки = Строка(СтруктураСтрок.Раздел8_9_1.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_9_1.Графа8) + "*100 <> " + Строка(СтруктураСтрок.Раздел8_9_2.Графа8) + " / " + Строка(СтруктураСтрок.Раздел7_9_2.Графа8) + "*100";    		
		ПроверкаНаОшибку(Выборка.КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, "<>", ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибки8Графа, КоличествоОшибокПо8ГрафеПроценты, СтрокаРазделитель);
		
		Если КоличествоОшибокПо8ГрафеПроценты > 0 Тогда
			ОбластьСтрока.Область(1, 65 + КолДопКолонок, 1, 65 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПо8ГрафеПроценты = ?(КоличествоОшибокПо8ГрафеПроценты = 0, "", КоличествоОшибокПо8ГрафеПроценты);				
		ОбластьСтрока.Параметры.ОписаниеОшибки8Графа = ОписаниеОшибки8Графа; 
		
		// проверки по ПСК
		ЗапросПоПСКПоДокументу = Новый Запрос;
		ЗапросПоПСКПоДокументу.МенеджерВременныхТаблиц = МВТ;
		ЗапросПоПСКПоДокументу.Текст = "      
		|ВЫБРАТЬ
		|	ОтчетностьКПКТаблицаПоказателей.Раздел КАК Раздел,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель1 КАК ПСКДокумента,
		|	ЕСТЬNULL(ВТ_ЗначенияПСК.ЗначениеПСК, 0) КАК ЗначениеПСК,
		|	ЕСТЬNULL(ВТ_ЗначенияПСК.ПредельноеЗначениеПСК, 0) КАК ПредельноеЗначениеПСК
		|ИЗ
		|	Документ.ОтчетностьКПК.ТаблицаПоказателей КАК ОтчетностьКПКТаблицаПоказателей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗначенияПСК КАК ВТ_ЗначенияПСК
		|		ПО ОтчетностьКПКТаблицаПоказателей.Раздел = ВТ_ЗначенияПСК.Раздел
		|ГДЕ
		|	ОтчетностьКПКТаблицаПоказателей.Раздел В ИЕРАРХИИ(&Раздел6)
		|	И ОтчетностьКПКТаблицаПоказателей.Ссылка = &Ссылка
		|	И ОтчетностьКПКТаблицаПоказателей.Показатель1 > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОтчетностьКПКТаблицаПоказателей.Раздел.КодРаздела";
		
		ЗапросПоПСКПоДокументу.УстановитьПараметр("Раздел6", Справочники.Разделы.Раздел6);
		ЗапросПоПСКПоДокументу.УстановитьПараметр("Ссылка", Выборка.ДокументОтчетности);
		
		ВыборкаПСК = ЗапросПоПСКПоДокументу.Выполнить().Выбрать();
		
		ОписаниеОшибокПоПСК = "";
		КоличествоОшибокПоПСК = 0;
		
		Пока ВыборкаПСК.Следующий() Цикл
			Если ВыборкаПСК.ПСКДокумента > ВыборкаПСК.ПредельноеЗначениеПСК Тогда
				КоличествоОшибокПоПСК = КоличествоОшибокПоПСК + 1;
				ОписаниеОшибки  = "В строке " + Строка(ВыборкаПСК.Раздел.КодРаздела) + " значение " + Строка(ВыборкаПСК.ПСКДокумента) + " > предельные значение " + Строка(ВыборкаПСК.ПредельноеЗначениеПСК) + " более чем на 1/3";				
				ОписаниеОшибокПоПСК = ОписаниеОшибокПоПСК + ?(ОписаниеОшибокПоПСК="", "", СтрокаРазделитель) + ОписаниеОшибки;  
				ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, "", ОписаниеОшибки);   
			КонецЕсли;			
		КонецЦикла;
		
		Если КоличествоОшибокПоПСК > 0 Тогда
			ОбластьСтрока.Область(1, 66 + КолДопКолонок, 1, 66 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 
		КонецЕсли;
		
		ОбластьСтрока.Параметры.КоличествоОшибокПоПСК = ?(КоличествоОшибокПоПСК = 0, "", КоличествоОшибокПоПСК);				
		ОбластьСтрока.Параметры.ОписаниеОшибокПоПСК = ОписаниеОшибокПоПСК; 	
		
		ВсегоОшибок = ВсегоОшибок + КоличествоОшибокПо3Графе + КоличествоОшибокПо4Графе + КоличествоОшибокПо5Графе + КоличествоОшибокПо6Графе + КоличествоОшибокПо7Графе + КоличествоОшибокПо8Графе + КоличествоОшибокПо3ГрафеПроценты + КоличествоОшибокПо4ГрафеПроценты + КоличествоОшибокПо5ГрафеПроценты + КоличествоОшибокПо6ГрафеПроценты + КоличествоОшибокПо7ГрафеПроценты + КоличествоОшибокПо8ГрафеПроценты + КоличествоОшибокПоПСК;
		
		
		ОбластьСтрока.Параметры.ИтогоОшибок = Строка(ВсегоОшибок);
		
		Если ВсегоОшибок > 0 Тогда
			ОбластьСтрока.Область(1, 4 + КолДопКолонок, 1, 4 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях; 	
		КонецЕсли;                                                  		
		
		РезультатНадзорныеСоотношения.Вывести(ОбластьСтрока); 		
		
		ЭтотОбъект.РезультатНадзорныеСоотношения.ФиксацияСверху = 3;
		ЭтотОбъект.РезультатНадзорныеСоотношения.ФиксацияСлева = 4;   	
		
		
		
		// 3. КС
		ИтогоОшибокКС = 0;
		НазваниеТаблицы = "КС";
		
		ОбластьСтрокаКС.Параметры.НомерСтроки = НомерСтроки;
		ОбластьСтрокаКС.Параметры.НомерВРеестреСРО = Выборка.НомерВРеестреСРО;
		ОбластьСтрокаКС.Параметры.КраткоеНазваниеКПК = СокрЛП(Выборка.КПК.НаименованиеКраткое);
		
		Если ВидОтчета = 1 Тогда
			ОбластьСтрокаКС.Параметры.ПериодОтчетности = СРО_ЗагрузкаОтчетности.ПолучитьПредставлениеДатыотчета(Выборка.ДатаОкончанияОтчетногоПериода);
		КонецЕсли;
		
		
		ОбластьСтрокаКС.Область(1, 1, 1, 143).ЦветФона = ЦветФонаСтроки;	
		
		Если Выборка.ДокументОтчетности = null Тогда   			
			ОбластьСтрокаКС.Параметры.ДокументОтчетности  = "Нет документа";
			ОбластьСтрокаКС.Область(1, 3, 1, 3).ЦветТекста = WebЦвета.Черный;				
		Иначе	
			ОбластьСтрокаКС.Параметры.ДокументОтчетности  = Выборка.ДокументОтчетности;
			ОбластьСтрокаКС.Область(1, 3, 1, 3).ЦветТекста =  WebЦвета.Синий;
		КонецЕсли;
		
		// Раздел 1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";
		
		СуммаРазделов = Выборка.Раздел2_1_1 + Выборка.Раздел2_1_2 + Выборка.Раздел2_1_3 +Выборка.Раздел2_1_4 + Выборка.Раздел2_1_5 + Выборка.Раздел2_1_6 + Выборка.Раздел2_1_7 + Выборка.Раздел2_1_8 + Выборка.Раздел2_1_9 + Выборка.Раздел2_1_10 + Выборка.Раздел2_1_11 + Выборка.Раздел2_1_12 + Выборка.Раздел2_1_13;
		Если Выборка.Раздел2_1 <>  СуммаРазделов Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1 Раздела II, должно быть равно сумме значений, указанных в строках 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 1.10, 1.11, 1.12 и 1.13.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1) + " <> " + Строка(СуммаРазделов);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 6 + КолДопКолонок, 1, 6 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 6 + КолДопКолонок, 1, 6 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		Разница = Выборка.Раздел2_1 - СуммаРазделов;
		ОбластьСтрокаКС.Параметры.Раздел1 = ?(Разница = 0, "0", Разница);			
		ОбластьСтрокаКС.Параметры.Проверка_Раздел1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		
		// Раздел 1.1 		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";		
		
		СуммаРазделов = Выборка.Раздел2_1_1_1 + Выборка.Раздел2_1_1_2 + Выборка.Раздел2_1_1_3;
		Если Выборка.Раздел2_1_1 <>  СуммаРазделов Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1.1 Раздела II, должно быть равно сумме значений, указанных в строках 1.1.1, 1.1.2 и 1.1.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1_1) + " <> " + Строка(СуммаРазделов);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 7 + КолДопКолонок, 1, 7 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;    	
		Иначе
			ОбластьСтрокаКС.Область(1, 7 + КолДопКолонок, 1, 7 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;  
		КонецЕсли;
		
		Разница = Выборка.Раздел2_1_1 - СуммаРазделов;  
		ОбластьСтрокаКС.Параметры.Раздел1_1 = ?(Разница = 0, "0", Разница);			
		ОбластьСтрокаКС.Параметры.Проверка_Раздел1_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		// Раздел 1.2 		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";		
		
		СуммаРазделов = Выборка.Раздел2_1_2_1 + Выборка.Раздел2_1_2_2 + Выборка.Раздел2_1_2_3;
		Если Выборка.Раздел2_1_2 <>  СуммаРазделов Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1.2 Раздела II, должно быть равно сумме значений, указанных в строках 1.2.1, 1.2.2 и 1.2.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1_2) + " <> " + Строка(СуммаРазделов);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 8 + КолДопКолонок, 1, 8 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;    	
		Иначе
			ОбластьСтрокаКС.Область(1, 8 + КолДопКолонок, 1, 8 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;  
		КонецЕсли;
		
		Разница = Выборка.Раздел2_1_2 - СуммаРазделов;
		ОбластьСтрокаКС.Параметры.Раздел2_1 =  ?(Разница = 0, "0", Разница);		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		// Раздел 1.1.1 и 1.2.1 		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";	
		
		УсловиеРазделов3 = СтруктураСтрок.Раздел7_1_1.Графа3 = 0 И СтруктураСтрок.Раздел7_2_1.Графа3 = 0 И СтруктураСтрок.Раздел7_3_1.Графа3 = 0 И СтруктураСтрок.Раздел7_4_1.Графа3 = 0 И СтруктураСтрок.Раздел7_5_1.Графа3 = 0 И СтруктураСтрок.Раздел7_6_1.Графа3 = 0 И СтруктураСтрок.Раздел7_7_1.Графа3  = 0 И СтруктураСтрок.Раздел7_8_1.Графа3 = 0 И СтруктураСтрок.Раздел7_9_1.Графа3 = 0;
		УсловиеРазделов4 = СтруктураСтрок.Раздел7_1_1.Графа4 = 0 И СтруктураСтрок.Раздел7_2_1.Графа4 = 0 И СтруктураСтрок.Раздел7_3_1.Графа4 = 0 И СтруктураСтрок.Раздел7_4_1.Графа4 = 0 И СтруктураСтрок.Раздел7_5_1.Графа4 = 0 И СтруктураСтрок.Раздел7_6_1.Графа4 = 0 И СтруктураСтрок.Раздел7_7_1.Графа4  = 0 И СтруктураСтрок.Раздел7_8_1.Графа4 = 0 И СтруктураСтрок.Раздел7_9_1.Графа4 = 0;
		УсловиеРазделов7 = СтруктураСтрок.Раздел7_1_1.Графа7 = 0 И СтруктураСтрок.Раздел7_2_1.Графа7 = 0 И СтруктураСтрок.Раздел7_3_1.Графа7 = 0 И СтруктураСтрок.Раздел7_4_1.Графа7 = 0 И СтруктураСтрок.Раздел7_5_1.Графа7 = 0 И СтруктураСтрок.Раздел7_6_1.Графа7 = 0 И СтруктураСтрок.Раздел7_7_1.Графа7  = 0 И СтруктураСтрок.Раздел7_8_1.Графа7 = 0 И СтруктураСтрок.Раздел7_9_1.Графа7 = 0;
		УсловиеРазделов8 = СтруктураСтрок.Раздел7_1_1.Графа8 = 0 И СтруктураСтрок.Раздел7_2_1.Графа8 = 0 И СтруктураСтрок.Раздел7_3_1.Графа8 = 0 И СтруктураСтрок.Раздел7_4_1.Графа8 = 0 И СтруктураСтрок.Раздел7_5_1.Графа8 = 0 И СтруктураСтрок.Раздел7_6_1.Графа8 = 0 И СтруктураСтрок.Раздел7_7_1.Графа8  = 0 И СтруктураСтрок.Раздел7_8_1.Графа8 = 0 И СтруктураСтрок.Раздел7_9_1.Графа8 = 0;
		
		УсловиеРазделов = УсловиеРазделов3 И УсловиеРазделов4 И УсловиеРазделов7 И УсловиеРазделов8;
		
		Если (Выборка.Раздел2_1_1_1 <> 0 ИЛИ Выборка.Раздел2_1_2_1 <> 0) И УсловиеРазделов Тогда
			
			ОписаниеУсловия= "Если в строках 1.1.1 и (или) 1.2.1 указаны значения, отличные от нуля, то как минимум в одной из граф 3, 4, 7, 8 строк 1.1, 2.1, 3.1, 4.1, 5.1, 6.1, 7.1, 8.1 и 9.1 Раздела VII должно быть указано значение, отличное от нуля.";
			//	ОписаниеОшибки = Строка(Выборка.Раздел2_1_2) + " <> " + Строка(СуммаРазделов);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 9 + КолДопКолонок, 1, 9 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;    	
		Иначе
			ОбластьСтрокаКС.Область(1, 9 + КолДопКолонок, 1, 9 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;  
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_1_1 = ОписаниеУсловия;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_1_1 = ОписаниеУсловия;
		
		// Раздел 1.1.2 и 1.2.2 		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";	
		
		УсловиеРазделов5 = СтруктураСтрок.Раздел7_1_1.Графа5 = 0 И СтруктураСтрок.Раздел7_2_1.Графа5 = 0 И СтруктураСтрок.Раздел7_3_1.Графа5 = 0 И СтруктураСтрок.Раздел7_4_1.Графа5 = 0 И СтруктураСтрок.Раздел7_5_1.Графа5 = 0 И СтруктураСтрок.Раздел7_6_1.Графа5 = 0 И СтруктураСтрок.Раздел7_7_1.Графа5  = 0 И СтруктураСтрок.Раздел7_8_1.Графа5 = 0 И СтруктураСтрок.Раздел7_9_1.Графа5 = 0;
		УсловиеРазделов6 = СтруктураСтрок.Раздел7_1_1.Графа6 = 0 И СтруктураСтрок.Раздел7_2_1.Графа6 = 0 И СтруктураСтрок.Раздел7_3_1.Графа6 = 0 И СтруктураСтрок.Раздел7_4_1.Графа6 = 0 И СтруктураСтрок.Раздел7_5_1.Графа6 = 0 И СтруктураСтрок.Раздел7_6_1.Графа6 = 0 И СтруктураСтрок.Раздел7_7_1.Графа6  = 0 И СтруктураСтрок.Раздел7_8_1.Графа6 = 0 И СтруктураСтрок.Раздел7_9_1.Графа6 = 0;
		УсловиеРазделов7 = СтруктураСтрок.Раздел7_1_1.Графа7 = 0 И СтруктураСтрок.Раздел7_2_1.Графа7 = 0 И СтруктураСтрок.Раздел7_3_1.Графа7 = 0 И СтруктураСтрок.Раздел7_4_1.Графа7 = 0 И СтруктураСтрок.Раздел7_5_1.Графа7 = 0 И СтруктураСтрок.Раздел7_6_1.Графа7 = 0 И СтруктураСтрок.Раздел7_7_1.Графа7  = 0 И СтруктураСтрок.Раздел7_8_1.Графа7 = 0 И СтруктураСтрок.Раздел7_9_1.Графа7 = 0;
		УсловиеРазделов8 = СтруктураСтрок.Раздел7_1_1.Графа8 = 0 И СтруктураСтрок.Раздел7_2_1.Графа8 = 0 И СтруктураСтрок.Раздел7_3_1.Графа8 = 0 И СтруктураСтрок.Раздел7_4_1.Графа8 = 0 И СтруктураСтрок.Раздел7_5_1.Графа8 = 0 И СтруктураСтрок.Раздел7_6_1.Графа8 = 0 И СтруктураСтрок.Раздел7_7_1.Графа8  = 0 И СтруктураСтрок.Раздел7_8_1.Графа8 = 0 И СтруктураСтрок.Раздел7_9_1.Графа8 = 0;
		
		УсловиеРазделов = УсловиеРазделов5 И УсловиеРазделов6 И УсловиеРазделов7 И УсловиеРазделов8;
		
		Если (Выборка.Раздел2_1_1_2 <> 0 ИЛИ Выборка.Раздел2_1_2_2 <> 0) И УсловиеРазделов Тогда   			
			ОписаниеУсловия= "Если в строках 1.1.2 и (или) 1.2.2 Раздела II указаны значения, отличные от нуля, то как минимум в одной из граф 5, 6, 7, 8 строк 1.1, 2.1, 3.1, 4.1, 5.1, 6.1, 7.1, 8.1 и 9.1 Раздела VII должно быть указано значение, отличное от нуля.";
			//	ОписаниеОшибки = Строка(Выборка.Раздел2_1_2) + " <> " + Строка(СуммаРазделов);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 10 + КолДопКолонок, 1, 10 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;    	
		Иначе
			ОбластьСтрокаКС.Область(1, 10 + КолДопКолонок, 1, 10 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;  
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_1_2 = ОписаниеУсловия;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_1_2 = ОписаниеУсловия;
		
		
		//  строках 1.1 или 1.2 
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если (Выборка.Раздел2_1_1 <> 0 ИЛИ Выборка.Раздел2_1_2 <> 0) И Выборка.Раздел4_15 = 0 Тогда
			ОписаниеУсловия= "Если в строках 1.1 или 1.2 Раздела II указано значение, отличное от нуля, то и в строке 15 Раздела IV должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "1.1 = " + Строка(Выборка.Раздел2_1_1) +"; 1.2 = " + Строка(Выборка.Раздел2_1_2)+"; строка 15 Раздела IV = " + Строка(Выборка.Раздел4_15);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 11 + КолДопКолонок, 1, 12 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 11 + КолДопКолонок, 1, 12 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Сумма_1_1_и_1_2 = Выборка.Раздел2_1_1 + Выборка.Раздел2_1_2;
		ОбластьСтрокаКС.Параметры.Раздел4_15 = Выборка.Раздел4_15;                  		
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_и_1_2 =  ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;  	
		
		//  строках 1.1.1 или 1.2.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если (Выборка.Раздел2_1_1_1 <> 0 ИЛИ Выборка.Раздел2_1_2_1 <> 0) И Выборка.Раздел4_15_1 = 0 Тогда
			ОписаниеУсловия= "Если в строках 1.1.1 или 1.2.1 Раздела II указано значение, отличное от нуля, то и в строке 15.1 Раздела IV должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "1.1.1 = " + Строка(Выборка.Раздел2_1_1_1) +"; 1.2.1 = " + Строка(Выборка.Раздел2_1_2_1)+"; строка 15.1 Раздела IV = " + Строка(Выборка.Раздел4_15_1);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 13 + КолДопКолонок, 1, 14 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 13 + КолДопКолонок, 1, 14 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Сумма_1_1_1_и_1_2_1 = Выборка.Раздел2_1_1_1 + Выборка.Раздел2_1_2_1;
		ОбластьСтрокаКС.Параметры.Раздел4_15_1 = Выборка.Раздел4_15_1;                  		
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_1_и_1_2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;	
		
		
		//  строках 1.1.2 или 1.2.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если (Выборка.Раздел2_1_1_2 <> 0 ИЛИ Выборка.Раздел2_1_2_2 <> 0) И Выборка.Раздел4_15_2 = 0 Тогда
			ОписаниеУсловия= "Если в строках 1.1.2 или 1.2.2 Раздела II указано значение, отличное от нуля, то и в строке 15.2 Раздела IV должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "1.1.2 = " + Строка(Выборка.Раздел2_1_1_2) +"; 1.2.2 = " + Строка(Выборка.Раздел2_1_2_2)+"; строка 15.2 Раздела IV = " + Строка(Выборка.Раздел4_15_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 15 + КолДопКолонок, 1, 16 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 15 + КолДопКолонок, 1, 16 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Сумма_1_1_2_и_1_2_2 = Выборка.Раздел2_1_1_2 + Выборка.Раздел2_1_2_2;
		ОбластьСтрокаКС.Параметры.Раздел4_15_2 = Выборка.Раздел4_15_2;                  		
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_2_и_1_2_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;
		
		// строках 1.1.3 или 1.2.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если (Выборка.Раздел2_1_1_3 <> 0 ИЛИ Выборка.Раздел2_1_2_3 <> 0) И Выборка.Раздел4_15_3 = 0 Тогда
			ОписаниеУсловия= "Если в строках 1.1.3 или 1.2.3 Раздела II указано значение, отличное от нуля, то и в строке 15.3 Раздела IV должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "1.1.3 = " + Строка(Выборка.Раздел2_1_1_3) +"; 1.2.3 = " + Строка(Выборка.Раздел2_1_2_3)+"; строка 15.3 Раздела IV = " + Строка(Выборка.Раздел4_15_3);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 17 + КолДопКолонок, 1, 18 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 17 + КолДопКолонок, 1, 18 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Сумма_1_1_3_и_1_2_3 = Выборка.Раздел2_1_1_3 + Выборка.Раздел2_1_2_3;
		ОбластьСтрокаКС.Параметры.Раздел4_15_3 = Выборка.Раздел4_15_3;                  		
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_3_и_1_2_3 =  ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;
		
		// Раздел 1.8.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";	
		
		УсловиеРазделов3 = СтруктураСтрок.Раздел7_1_2.Графа3 = 0 И СтруктураСтрок.Раздел7_2_2.Графа3 = 0 И СтруктураСтрок.Раздел7_3_2.Графа3 = 0 И СтруктураСтрок.Раздел7_4_2.Графа3 = 0 И СтруктураСтрок.Раздел7_5_2.Графа3 = 0 И СтруктураСтрок.Раздел7_6_2.Графа3 = 0 И СтруктураСтрок.Раздел7_7_2.Графа3  = 0 И СтруктураСтрок.Раздел7_8_2.Графа3 = 0 И СтруктураСтрок.Раздел7_9_2.Графа3 = 0;
		УсловиеРазделов4 = СтруктураСтрок.Раздел7_1_2.Графа4 = 0 И СтруктураСтрок.Раздел7_2_2.Графа4 = 0 И СтруктураСтрок.Раздел7_3_2.Графа4 = 0 И СтруктураСтрок.Раздел7_4_2.Графа4 = 0 И СтруктураСтрок.Раздел7_5_2.Графа4 = 0 И СтруктураСтрок.Раздел7_6_2.Графа4 = 0 И СтруктураСтрок.Раздел7_7_2.Графа4  = 0 И СтруктураСтрок.Раздел7_8_2.Графа4 = 0 И СтруктураСтрок.Раздел7_9_2.Графа4 = 0;
		УсловиеРазделов7 = СтруктураСтрок.Раздел7_1_2.Графа7 = 0 И СтруктураСтрок.Раздел7_2_2.Графа7 = 0 И СтруктураСтрок.Раздел7_3_2.Графа7 = 0 И СтруктураСтрок.Раздел7_4_2.Графа7 = 0 И СтруктураСтрок.Раздел7_5_2.Графа7 = 0 И СтруктураСтрок.Раздел7_6_2.Графа7 = 0 И СтруктураСтрок.Раздел7_7_2.Графа7  = 0 И СтруктураСтрок.Раздел7_8_2.Графа7 = 0 И СтруктураСтрок.Раздел7_9_2.Графа7 = 0;
		УсловиеРазделов8 = СтруктураСтрок.Раздел7_1_2.Графа8 = 0 И СтруктураСтрок.Раздел7_2_2.Графа8 = 0 И СтруктураСтрок.Раздел7_3_2.Графа8 = 0 И СтруктураСтрок.Раздел7_4_2.Графа8 = 0 И СтруктураСтрок.Раздел7_5_2.Графа8 = 0 И СтруктураСтрок.Раздел7_6_2.Графа8 = 0 И СтруктураСтрок.Раздел7_7_2.Графа8  = 0 И СтруктураСтрок.Раздел7_8_2.Графа8 = 0 И СтруктураСтрок.Раздел7_9_2.Графа8 = 0;
		
		УсловиеРазделов = УсловиеРазделов3 И УсловиеРазделов4 И УсловиеРазделов7 И УсловиеРазделов8;
		
		Если Выборка.Раздел2_1_8_1 <> 0  И УсловиеРазделов Тогда
			
			ОписаниеУсловия= "Если в строке 1.8.1 Раздела II указано значение, отличное от нуля, то как минимум в одной из граф 3, 4, 7, 8 строк 1.2, 2.2, 3.2, 4.2, 5.2, 6.2, 7.2, 8.2 и 9.2 Раздела VII должно быть указано значение, отличное от нуля.";
			//	ОписаниеОшибки = Строка(Выборка.Раздел2_1_2) + " <> " + Строка(СуммаРазделов);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 19 + КолДопКолонок, 1, 19 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;    	
		Иначе
			ОбластьСтрокаКС.Область(1, 19 + КолДопКолонок, 1, 19 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;  
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_8_1 = ОписаниеУсловия;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_8_1 = ОписаниеУсловия;
		
		// Раздел 1.8.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";	
		
		УсловиеРазделов5 = СтруктураСтрок.Раздел7_1_2.Графа5 = 0 И СтруктураСтрок.Раздел7_2_2.Графа5 = 0 И СтруктураСтрок.Раздел7_3_2.Графа5 = 0 И СтруктураСтрок.Раздел7_4_2.Графа5 = 0 И СтруктураСтрок.Раздел7_5_2.Графа5 = 0 И СтруктураСтрок.Раздел7_6_2.Графа5 = 0 И СтруктураСтрок.Раздел7_7_2.Графа5  = 0 И СтруктураСтрок.Раздел7_8_2.Графа5 = 0 И СтруктураСтрок.Раздел7_9_2.Графа5 = 0;
		УсловиеРазделов6 = СтруктураСтрок.Раздел7_1_2.Графа6 = 0 И СтруктураСтрок.Раздел7_2_2.Графа6 = 0 И СтруктураСтрок.Раздел7_3_2.Графа6 = 0 И СтруктураСтрок.Раздел7_4_2.Графа6 = 0 И СтруктураСтрок.Раздел7_5_2.Графа6 = 0 И СтруктураСтрок.Раздел7_6_2.Графа6 = 0 И СтруктураСтрок.Раздел7_7_2.Графа6  = 0 И СтруктураСтрок.Раздел7_8_2.Графа6 = 0 И СтруктураСтрок.Раздел7_9_2.Графа6 = 0;
		УсловиеРазделов7 = СтруктураСтрок.Раздел7_1_2.Графа7 = 0 И СтруктураСтрок.Раздел7_2_2.Графа7 = 0 И СтруктураСтрок.Раздел7_3_2.Графа7 = 0 И СтруктураСтрок.Раздел7_4_2.Графа7 = 0 И СтруктураСтрок.Раздел7_5_2.Графа7 = 0 И СтруктураСтрок.Раздел7_6_2.Графа7 = 0 И СтруктураСтрок.Раздел7_7_2.Графа7  = 0 И СтруктураСтрок.Раздел7_8_2.Графа7 = 0 И СтруктураСтрок.Раздел7_9_2.Графа7 = 0;
		УсловиеРазделов8 = СтруктураСтрок.Раздел7_1_2.Графа8 = 0 И СтруктураСтрок.Раздел7_2_2.Графа8 = 0 И СтруктураСтрок.Раздел7_3_2.Графа8 = 0 И СтруктураСтрок.Раздел7_4_2.Графа8 = 0 И СтруктураСтрок.Раздел7_5_2.Графа8 = 0 И СтруктураСтрок.Раздел7_6_2.Графа8 = 0 И СтруктураСтрок.Раздел7_7_2.Графа8  = 0 И СтруктураСтрок.Раздел7_8_2.Графа8 = 0 И СтруктураСтрок.Раздел7_9_2.Графа8 = 0;
		
		УсловиеРазделов = УсловиеРазделов5 И УсловиеРазделов6 И УсловиеРазделов7 И УсловиеРазделов8;
		
		Если Выборка.Раздел2_1_8_2 <> 0  И УсловиеРазделов Тогда
			
			ОписаниеУсловия = "Если в строках 1.8.2 Раздела II указано значение, отличное от нуля, то как минимум в одной из граф 5, 6, 7, 8 строк 1.2, 2.2, 3.2, 4.2, 5.2, 6.2, 7.2, 8.2 и 9.2 Раздела VII должно быть указано значение, отличное от нуля.";
			//	ОписаниеОшибки = Строка(Выборка.Раздел2_1_2) + " <> " + Строка(СуммаРазделов);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 20 + КолДопКолонок, 1, 20 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;    	
		Иначе
			ОбластьСтрокаКС.Область(1, 20 + КолДопКолонок, 1, 20 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;  
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_8_2 = ОписаниеУсловия;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_8_2 = ОписаниеУсловия;
		
		// строках 1.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_1_3 < Выборка.Раздел2_1_3_1 + Выборка.Раздел2_1_3_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1.3 Раздела II, должно быть больше или равно сумме значений, указанных в строках 1.3.1 и 1.3.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1_3) +" < " + Строка(Выборка.Раздел2_1_3_1 + Выборка.Раздел2_1_3_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 21 + КолДопКолонок, 1, 21 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 21 + КолДопКолонок, 1, 21 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_3 = Выборка.Раздел2_1_3 - Выборка.Раздел2_1_3_1  - Выборка.Раздел2_1_3_2;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_3 =  ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 1.4
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_1_4 < Выборка.Раздел2_1_4_1 + Выборка.Раздел2_1_4_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1.4 Раздела II, должно быть больше или равно сумме значений, указанных в строках 1.4.1 и 1.4.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1_4) +" < " + Строка(Выборка.Раздел2_1_4_1 + Выборка.Раздел2_1_4_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 22 + КолДопКолонок, 1, 22 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 22 + КолДопКолонок, 1, 22 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_4 = Выборка.Раздел2_1_4 - Выборка.Раздел2_1_4_1  - Выборка.Раздел2_1_4_2;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_4 =  ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 1.5
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_1_5 < Выборка.Раздел2_1_5_1 + Выборка.Раздел2_1_5_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1.5 Раздела II, должно быть равно сумме значений, указанных в строках 1.5.1 и 1.5.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1_5) +" < " + Строка(Выборка.Раздел2_1_5_1 + Выборка.Раздел2_1_5_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 23 + КолДопКолонок, 1, 23 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 23 + КолДопКолонок, 1, 23 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_5 = Выборка.Раздел2_1_5 - Выборка.Раздел2_1_5_1  - Выборка.Раздел2_1_5_2;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_5 =  ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 1.7
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_1_7 < Выборка.Раздел2_1_7_1 + Выборка.Раздел2_1_7_2 + Выборка.Раздел2_1_7_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1.7 Раздела II, должно быть равно сумме значений, указанных в строках 1.7.1, 1.7.2 и 1.7.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1_7) +" < " + Строка(Выборка.Раздел2_1_7_1 + Выборка.Раздел2_1_7_2 + Выборка.Раздел2_1_7_3);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 24 + КолДопКолонок, 1, 24 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 24 + КолДопКолонок, 1, 24 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_7 = Выборка.Раздел2_1_7 - Выборка.Раздел2_1_7_1  - Выборка.Раздел2_1_7_2  - Выборка.Раздел2_1_7_3;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_7 =  ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 1.8
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_1_8 < Выборка.Раздел2_1_8_1 + Выборка.Раздел2_1_8_2 + Выборка.Раздел2_1_8_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1.8 Раздела II, должно быть больше или равно сумме значений, указанных в строках 1.8.1, 1.8.2 и 1.8.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1_8) +" < " + Строка(Выборка.Раздел2_1_8_1 + Выборка.Раздел2_1_8_2 + Выборка.Раздел2_1_8_3);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 25 + КолДопКолонок, 1, 25 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 25 + КолДопКолонок, 1, 25 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_8 = Выборка.Раздел2_1_8 - Выборка.Раздел2_1_8_1  - Выборка.Раздел2_1_8_2  - Выборка.Раздел2_1_8_3;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_8 =  ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 1.12
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_1_12 < Выборка.Раздел2_1_12_1 + Выборка.Раздел2_1_12_2 + Выборка.Раздел2_1_12_3 + Выборка.Раздел2_1_12_4 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1.12 Раздела II, должно быть равно сумме значений, указанных в строках 1.12.1, 1.12.2, 1.12.3 и 1.12.4.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1_12) +" < " + Строка(Выборка.Раздел2_1_12_1 + Выборка.Раздел2_1_12_2 + Выборка.Раздел2_1_12_3 + Выборка.Раздел2_1_12_4);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 26 + КолДопКолонок, 1, 26 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 26 + КолДопКолонок, 1, 26 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_12 = Выборка.Раздел2_1_12 - Выборка.Раздел2_1_12_1  - Выборка.Раздел2_1_12_2 - Выборка.Раздел2_1_12_3 - Выборка.Раздел2_1_12_4;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_12 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 1.12.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_1_12_1 < Выборка.Раздел2_1_12_1_1 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1.12.1 Раздела II, должно быть больше или равно значению, указанному в строке 1.12.1.1.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1_12_1) +" < " + Строка(Выборка.Раздел2_1_12_1_1);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 27 + КолДопКолонок, 1, 27 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 27 + КолДопКолонок, 1, 27 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_12_1 = Выборка.Раздел2_1_12_1  - Выборка.Раздел2_1_12_1_1;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_12_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		
		// строках 1.12.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  
		
		Массив_1 = Выборка.ДокументОтчетности.ТаблицаПоказателей.НайтиСтроки(Новый Структура("Раздел", Справочники.Разделы.Раздел5_1));		
		Раздел5_1_Графа6 = Массив_1[0].Показатель4;
		Массив_2 = Выборка.ДокументОтчетности.ТаблицаПоказателей.НайтиСтроки(Новый Структура("Раздел", Справочники.Разделы.Раздел5_2));		
		Раздел5_2_Графа6 = Массив_2[0].Показатель4;
		Массив_3 = Выборка.ДокументОтчетности.ТаблицаПоказателей.НайтиСтроки(Новый Структура("Раздел", Справочники.Разделы.Раздел5_3));		
		Раздел5_3_Графа6 = Массив_3[0].Показатель4;   
		
		
		Если Выборка.Раздел2_1_12 < Раздел5_1_Графа6 + Раздел5_2_Графа6 + Раздел5_3_Графа6 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 1.12 Раздела II, должно быть больше или равно сумме значений строк 1, 2 и 3, указанных в графе 6 Раздела V.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_1_12) +" < " + Строка(Раздел5_1_Графа6 + Раздел5_2_Графа6 + Раздел5_3_Графа6);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 28 + КолДопКолонок, 1, 28 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 28 + КолДопКолонок, 1, 28 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_1_12_Графы = Выборка.Раздел2_1_12  - Раздел5_1_Графа6 - Раздел5_2_Графа6 - Раздел5_3_Графа6 ;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_1_12_Графы = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 		
		
		
		// строках 2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_2 <> Выборка.Раздел2_2_1 + Выборка.Раздел2_2_2 + Выборка.Раздел2_2_3 + Выборка.Раздел2_2_4 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 2 Раздела II, должно быть равно сумме значений, указанных в строке 2.1, 2.2, 2.3 и 2.4.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_2) +" <> " + Строка(Выборка.Раздел2_2_1 + Выборка.Раздел2_2_2 + Выборка.Раздел2_2_3 + Выборка.Раздел2_2_4);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 29 + КолДопКолонок, 1, 29 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 29 + КолДопКолонок, 1, 29 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_2 = Выборка.Раздел2_2 - Выборка.Раздел2_2_1 - Выборка.Раздел2_2_2 - Выборка.Раздел2_2_3 - Выборка.Раздел2_2_4;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 2_1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_2_1 < Выборка.Раздел2_2_1_1 + Выборка.Раздел2_2_1_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 2.1 Раздела II, должно быть больше или равно сумме значений, указанных в строках 2.1.1 и 2.1.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_2_1) +" < " + Строка(Выборка.Раздел2_2_1_1 + Выборка.Раздел2_2_1_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 30 + КолДопКолонок, 1, 30 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 30 + КолДопКолонок, 1, 30 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_2_1 = Выборка.Раздел2_2_1 - Выборка.Раздел2_2_1_1 - Выборка.Раздел2_2_1_2;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 2_1.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_2_1_1 < Выборка.Раздел2_2_1_1_1 + Выборка.Раздел2_2_1_1_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 2.1 Раздела II, должно быть больше или равно сумме значений, указанных в строках 2.1.1 и 2.1.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_2_1_1) +" < " + Строка(Выборка.Раздел2_2_1_1_1 + Выборка.Раздел2_2_1_1_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 31 + КолДопКолонок, 1, 31 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 31 + КолДопКолонок, 1, 31 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_2_1_1 = Выборка.Раздел2_2_1_1 - Выборка.Раздел2_2_1_1_1 - Выборка.Раздел2_2_1_1_2;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_2_1_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 2_1.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_2_1_2 < Выборка.Раздел2_2_1_2_1 + Выборка.Раздел2_2_1_2_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 2.1.2 Раздела II, должно быть больше или равно сумме значений, указанных в строках 2.1.2.1 и 2.1.2.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_2_1_2) +" < " + Строка(Выборка.Раздел2_2_1_2_1 + Выборка.Раздел2_2_1_2_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 32 + КолДопКолонок, 1, 32 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 32 + КолДопКолонок, 1, 32 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_2_1_2 = Выборка.Раздел2_2_1_2 - Выборка.Раздел2_2_1_2_1 - Выборка.Раздел2_2_1_2_2;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_2_1_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 2.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_2_3 < Выборка.Раздел2_2_3_1 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 2.3 Раздела II, должно быть больше или равно значению, указанному в строке 2.3.1.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_2_3) +" < " + Строка(Выборка.Раздел2_2_3_1);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 33 + КолДопКолонок, 1, 33 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 33 + КолДопКолонок, 1, 33 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_2_3 = Выборка.Раздел2_2_3 - Выборка.Раздел2_2_3_1 ;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_2_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 3.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_3_1 < Выборка.Раздел2_3_1_1 + Выборка.Раздел2_3_1_2 + Выборка.Раздел2_3_1_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 3.1 Раздела II, должно быть равно сумме значений, указанных в строках 3.1.1, 3.1.2 и 3.1.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_1) +" < " + Строка(Выборка.Раздел2_3_1_1 - Выборка.Раздел2_3_1_2 - Выборка.Раздел2_3_1_3);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 34 + КолДопКолонок, 1, 34 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 34 + КолДопКолонок, 1, 34 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_3_1 = Выборка.Раздел2_3_1 - Выборка.Раздел2_3_1_1 - Выборка.Раздел2_3_1_2 - Выборка.Раздел2_3_1_3;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_3_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 3.1.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_3_1_2 < Выборка.Раздел2_3_1_2_1 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 3.1.2 Раздела II, должно быть больше или равно значению, указанному в строке 3.1.2.1.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_1_2) +" < " + Строка(Выборка.Раздел2_3_1_2_1);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 35 + КолДопКолонок, 1, 35 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 35 + КолДопКолонок, 1, 35 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_3_1_2 = Выборка.Раздел2_3_1_2 - Выборка.Раздел2_3_1_2_1;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_3_1_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 3.1.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_3_1_3 <> Выборка.Раздел2_3_1_3_1 + Выборка.Раздел2_3_1_3_2 + Выборка.Раздел2_3_1_3_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 3.1.3 Раздела II, должно быть равно сумме значений, указанных в строках 3.1.3.1, 3.1.3.2 и 3.1.3.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_1_3) +" <> " + Строка(Выборка.Раздел2_3_1_3_1 + Выборка.Раздел2_3_1_3_2 + Выборка.Раздел2_3_1_3_3);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 36 + КолДопКолонок, 1, 36 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 36 + КолДопКолонок, 1, 36 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_3_1_3 = Выборка.Раздел2_3_1_3 - Выборка.Раздел2_3_1_3_1 - Выборка.Раздел2_3_1_3_2 - Выборка.Раздел2_3_1_3_3;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_3_1_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 3.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_3_2 <> Выборка.Раздел2_3_2_1 + Выборка.Раздел2_3_2_2 + Выборка.Раздел2_3_2_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 3.2 Раздела II, должно быть равно сумме значений, указанных в строках 3.2.1, 3.2.2 и 3.2.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_2) +" <> " + Строка(Выборка.Раздел2_3_2_1 + Выборка.Раздел2_3_2_2 + Выборка.Раздел2_3_2_3);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 37 + КолДопКолонок, 1, 37 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 37 + КолДопКолонок, 1, 37 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_3_2 = Выборка.Раздел2_3_2 - Выборка.Раздел2_3_2_1 - Выборка.Раздел2_3_2_2 - Выборка.Раздел2_3_2_3;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_3_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 3.2.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_3_2_2 < Выборка.Раздел2_3_2_2_1 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 3.2.2 Раздела II, должно быть больше или равно значению, указанному в строке 3.2.2.1.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_2_2) +" < " + Строка(Выборка.Раздел2_3_2_2_1);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 38 + КолДопКолонок, 1, 38 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 38 + КолДопКолонок, 1, 38 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_3_2_2 = Выборка.Раздел2_3_2_2 - Выборка.Раздел2_3_2_2_1;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_3_2_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		// строках 3.2.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_3_2_3 <> Выборка.Раздел2_3_2_3_1 +  Выборка.Раздел2_3_2_3_2 +  Выборка.Раздел2_3_2_3_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 3.2.3 Раздела II, должно быть равно сумме значений, указанных в строках 3.2.3.1, 3.2.3.2 и 3.2.3.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_2_3) +" <> " + Строка(Выборка.Раздел2_3_2_3_1 +  Выборка.Раздел2_3_2_3_2 +  Выборка.Раздел2_3_2_3_3);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 39 + КолДопКолонок, 1, 39 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 39 + КолДопКолонок, 1, 39 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_3_2_3 = Выборка.Раздел2_3_2_3 - Выборка.Раздел2_3_2_3_1 - Выборка.Раздел2_3_2_3_2 - Выборка.Раздел2_3_2_3_3;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_3_2_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		
		// строках 3.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел2_3_3 < Выборка.Раздел2_3_3_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 3.3 Раздела II, должно быть больше или равно значению, указанному в строке 3.3.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел2_3_3) +" < " + Строка(Выборка.Раздел2_3_3_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 40 + КолДопКолонок, 1, 40 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 40 + КолДопКолонок, 1, 40 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел2_3_3 = Выборка.Раздел2_3_3 - Выборка.Раздел2_3_3_2;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел2_3_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строках 1.1.1 или 1.2.1 и 1.8.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если (Выборка.Раздел2_1_1_1 = 0 И Выборка.Раздел2_1_2_1 = 0) И Выборка.Раздел2_1_8_1 <> 0 Тогда
			ОписаниеУсловия= "Если в строке 1.8.1  Раздела II указано значение, отличное от нуля, то и в строках 1.1.1 или 1.2.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "1.8.1 = " + Строка(Выборка.Раздел2_1_8_1) +"; 1.1.1 = " + Строка(Выборка.Раздел2_1_1_1) +"; 1.2.1 = " + Строка(Выборка.Раздел2_1_2_1);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 41 + КолДопКолонок, 1, 42 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 41 + КолДопКолонок, 1, 42 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Сумма_1_1_1_и_1_2_1 = Выборка.Раздел2_1_1_1 + Выборка.Раздел2_1_2_1;
		ОбластьСтрокаКС.Параметры.Раздел2_1_8_1 = Выборка.Раздел2_1_8_1;                  		
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_1_и_1_2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;	
		
		
		//  строках 1.1.2 или 1.2.2 и 1.8.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если (Выборка.Раздел2_1_1_2 = 0 И Выборка.Раздел2_1_2_2 = 0) И Выборка.Раздел2_1_8_2 <> 0 Тогда
			ОписаниеУсловия= "Если в строке 1.8.2 Раздела II указано значение, отличное от нуля, то и в строках 1.1.2 или 1.2.2 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "1.8.2 = " + Строка(Выборка.Раздел2_1_8_2) +"; 1.1.2 = " + Строка(Выборка.Раздел2_1_1_2) +"; 1.2.2 = " + Строка(Выборка.Раздел2_1_2_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 43 + КолДопКолонок, 1, 44 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 43 + КолДопКолонок, 1, 44 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Сумма_1_1_2_и_1_2_2 = Выборка.Раздел2_1_1_2 + Выборка.Раздел2_1_2_2;
		ОбластьСтрокаКС.Параметры.Раздел2_1_8_2 = Выборка.Раздел2_1_8_2;                  		
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_2_и_1_2_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;	
		
		//  строках 1.1.3 или 1.2.3 и 1.8.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если (Выборка.Раздел2_1_1_3 = 0 И Выборка.Раздел2_1_2_3 = 0) И Выборка.Раздел2_1_8_3 <> 0 Тогда
			ОписаниеУсловия= "Если в строке 1.8.3 Раздела II указано значение, отличное от нуля, то и в строках 1.1.3 или 1.2.3 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "1.8.3 = " + Строка(Выборка.Раздел2_1_8_3) +"; 1.1.3 = " + Строка(Выборка.Раздел2_1_1_3) +"; 1.2.3 = " + Строка(Выборка.Раздел2_1_2_3);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 45 + КолДопКолонок, 1, 46 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 45 + КолДопКолонок, 1, 46 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Сумма_1_1_3_и_1_2_3 = Выборка.Раздел2_1_1_3 + Выборка.Раздел2_1_2_3;
		ОбластьСтрокаКС.Параметры.Раздел2_1_8_3 = Выборка.Раздел2_1_8_3;                  		
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_3_и_1_2_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; ;	
		
		//  строка 4 
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел3_4 <> Выборка.Раздел3_4_1 + Выборка.Раздел3_4_2 + Выборка.Раздел3_4_3 + Выборка.Раздел3_4_4 + Выборка.Раздел3_4_5 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 4 Раздела III, должно быть равно сумме значений, указанных в строках 4.1, 4.2, 4.3, 4.4 и 4.5.";
			ОписаниеОшибки = Строка(Выборка.Раздел3_4) +" <> " + Строка(Выборка.Раздел3_4_1 + Выборка.Раздел3_4_2 + Выборка.Раздел3_4_3 + Выборка.Раздел3_4_4 + Выборка.Раздел3_4_5);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 49 + КолДопКолонок, 1, 49 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 49 + КолДопКолонок, 1, 49 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел3_4 = Выборка.Раздел3_4 - Выборка.Раздел3_4_1 - Выборка.Раздел3_4_2 - Выборка.Раздел3_4_3 - Выборка.Раздел3_4_4 - Выборка.Раздел3_4_5;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел3_4 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 4.1 
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел3_4_1 < Выборка.Раздел3_4_1_1 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 4 Раздела III, должно быть равно сумме значений, указанных в строках 4.1, 4.2, 4.3, 4.4 и 4.5.";
			ОписаниеОшибки = Строка(Выборка.Раздел3_4_1) +" < " + Строка(Выборка.Раздел3_4_1_1);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 50 + КолДопКолонок, 1, 50 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 50 + КолДопКолонок, 1, 50 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел3_4_1 = Выборка.Раздел3_4_1 - Выборка.Раздел3_4_1_1;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел3_4_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 5 
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел3_5 <> Выборка.Раздел3_5_1 + Выборка.Раздел3_5_2 + Выборка.Раздел3_5_3 + Выборка.Раздел3_5_4 + Выборка.Раздел3_5_5  + Выборка.Раздел3_5_6 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 5 Раздела III, должно быть равно сумме значений, указанных в строках 5.1, 5.2, 5.3, 5.4, 5.5 и 5.6.";
			ОписаниеОшибки = Строка(Выборка.Раздел3_5) +" <> " + Строка(Выборка.Раздел3_5_1 + Выборка.Раздел3_5_2 + Выборка.Раздел3_5_3 + Выборка.Раздел3_5_4 + Выборка.Раздел3_5_5  + Выборка.Раздел3_5_6);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 51 + КолДопКолонок, 1, 51 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 51 + КолДопКолонок, 1, 51 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел3_5 = Выборка.Раздел3_5 - Выборка.Раздел3_5_1 - Выборка.Раздел3_5_2 - Выборка.Раздел3_5_3 - Выборка.Раздел3_5_4 - Выборка.Раздел3_5_5  - Выборка.Раздел3_5_6;		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел3_5 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 5.3 
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел3_5_3 < Выборка.Раздел3_5_3_1 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 5.3 Раздела III, должно быть больше или равно значению, указанному в строке 5.3.1.";
			ОписаниеОшибки = Строка(Выборка.Раздел3_5_3) +" < " + Строка(Выборка.Раздел3_5_3_1);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 52 + КолДопКолонок, 1, 52 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 52 + КолДопКолонок, 1, 52 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел3_5_3 = Выборка.Раздел3_5 - Выборка.Раздел3_5_3 - Выборка.Раздел3_5_3_1;	
		ОбластьСтрокаКС.Параметры.Проверка_Раздел3_5_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 9.1 
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел3_9_1 < Выборка.Раздел3_9_1_1 + Выборка.Раздел3_9_1_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 9.1 Раздела III, должно быть больше или равно сумме значений, указанных в строках 9.1.1 и 9.1.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел3_9_1) +" < " + Строка(Выборка.Раздел3_9_1_1 + Выборка.Раздел3_9_1_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 53 + КолДопКолонок, 1, 53 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 53 + КолДопКолонок, 1, 53 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел3_9_1 = Выборка.Раздел3_9_1 - Выборка.Раздел3_9_1_1 - Выборка.Раздел3_9_1_2;	
		ОбластьСтрокаКС.Параметры.Проверка_Раздел3_9_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 10 
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел3_10 < Выборка.Раздел3_10_1 + Выборка.Раздел3_10_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 9.1 Раздела III, должно быть больше или равно сумме значений, указанных в строках 9.1.1 и 9.1.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел3_10) +" < " + Строка(Выборка.Раздел3_10_1 + Выборка.Раздел3_10_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 54 + КолДопКолонок, 1, 54 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 54 + КолДопКолонок, 1, 54 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел3_10 = Выборка.Раздел3_10 - Выборка.Раздел3_10_1 - Выборка.Раздел3_10_2;	
		ОбластьСтрокаКС.Параметры.Проверка_Раздел3_10 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 11
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_11 <> Выборка.Раздел4_11_1 + Выборка.Раздел4_11_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 11, должно быть равно сумме значений, указанных в строках 11.1 и 11.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_11) +" <> " + Строка(Выборка.Раздел4_11_1 + Выборка.Раздел4_11_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 56 + КолДопКолонок, 1, 56 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 56 + КолДопКолонок, 1, 56 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_11 = Выборка.Раздел4_11 - Выборка.Раздел4_11_1 - Выборка.Раздел4_11_2;	
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_11 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 12
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_12 <> Выборка.Раздел4_12_1 + Выборка.Раздел4_12_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 12, должно быть равно сумме значений, указанных в строках 12.1 и 12.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_12) +" <> " + Строка(Выборка.Раздел4_12_1 + Выборка.Раздел4_12_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 57 + КолДопКолонок, 1, 57 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 57 + КолДопКолонок, 1, 57 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_12 = Выборка.Раздел4_12 - Выборка.Раздел4_12_1 - Выборка.Раздел4_12_2;	
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_12 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 13
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_13 <> Выборка.Раздел4_13_1 + Выборка.Раздел4_13_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 13, должно быть равно сумме значений, указанных в строках 13.1 и 13.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_13) +" <> " + Строка(Выборка.Раздел4_13_1 + Выборка.Раздел4_13_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 58 + КолДопКолонок, 1, 58 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 58 + КолДопКолонок, 1, 58 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_13 = Выборка.Раздел4_13 - Выборка.Раздел4_13_1 - Выборка.Раздел4_13_2;	
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_13 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 14
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_14 <> Выборка.Раздел4_14_1 + Выборка.Раздел4_14_2 + Выборка.Раздел4_14_3  Тогда
			ОписаниеУсловия= "Значение, указанное в строке 14, должно быть равно сумме значений, указанных в строках 14.1, 14.2 и 14.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_14) +" <> " + Строка(Выборка.Раздел4_14_1 + Выборка.Раздел4_14_2 + Выборка.Раздел4_14_3);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 59 + КолДопКолонок, 1, 59 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 59 + КолДопКолонок, 1, 59 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_14 = Выборка.Раздел4_14 - Выборка.Раздел4_14_1 - Выборка.Раздел4_14_2 - Выборка.Раздел4_14_3;	
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_14 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 14.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_14_3 < Выборка.Раздел4_14_3_1 + Выборка.Раздел4_14_3_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 14.3, должно быть больше или равно сумме значений, указанных в строках 14.3.1 и 14.3.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_14_3) +" <> " + Строка(Выборка.Раздел4_14_3_1 + Выборка.Раздел4_14_3_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 60 + КолДопКолонок, 1, 60 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 60 + КолДопКолонок, 1, 60 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_14_3 = Выборка.Раздел4_14_3 - Выборка.Раздел4_14_3_1 - Выборка.Раздел4_14_3_2;	
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_14_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		
		//  строка 15 и 1.1. и 1.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_15 <> 0 И (Выборка.Раздел2_1_1 + Выборка.Раздел2_1_2) = 0 Тогда
			ОписаниеУсловия= "Если в строке 15 указано значение, отличное от нуля, то и в строках 1.1. или 1.2 раздела II должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "Строка 15 = " + Строка(Выборка.Раздел2_15) +"; 1.1 = " + Строка(Выборка.Раздел2_1_1)+"; 1.2 = " + Строка(Выборка.Раздел2_1_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 61 + КолДопКолонок, 1, 62 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 61 + КолДопКолонок, 1, 62 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_15 = Выборка.Раздел4_15;
		ОбластьСтрокаКС.Параметры.Сумма_1_1_и_1_2 = Выборка.Раздел2_1_1 + Выборка.Раздел2_1_2;	
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_и_1_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 15.1 и 1.1.1 и 1.2.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_15_1 <> 0 И (Выборка.Раздел2_1_1_1 + Выборка.Раздел2_1_2_1) = 0 Тогда
			ОписаниеУсловия= "Если в строке 15.1 указано значение, отличное от нуля, то и в строках 1.1.1 или 1.2.1 раздела II должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "Строка 15.1 = " + Строка(Выборка.Раздел2_15_1) +"; 1.1.1 = " + Строка(Выборка.Раздел2_1_1_1)+"; 1.2.1 = " + Строка(Выборка.Раздел2_1_2_1);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 63 + КолДопКолонок, 1, 64 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 63 + КолДопКолонок, 1, 64 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_15_1 = Выборка.Раздел4_15_1;
		ОбластьСтрокаКС.Параметры.Сумма_1_1_1_и_1_2_1 = Выборка.Раздел2_1_1_1 + Выборка.Раздел2_1_2_1;	
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_1_и_1_2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 15.2 и 1.1.2 и 1.2.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_15_2 <> 0 И (Выборка.Раздел2_1_1_2 + Выборка.Раздел2_1_2_2) = 0 Тогда
			ОписаниеУсловия= "Если в строке 15.2 указано значение, отличное от нуля, то и в строках 1.1.2 или 1.2.2 раздела II должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "Строка 15.2 = " + Строка(Выборка.Раздел4_15_2) +"; 1.1.2 = " + Строка(Выборка.Раздел2_1_1_2)+"; 1.2.2 = " + Строка(Выборка.Раздел2_1_2_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 65 + КолДопКолонок, 1, 66 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 65 + КолДопКолонок, 1, 66 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_15_2 = Выборка.Раздел4_15_2;
		ОбластьСтрокаКС.Параметры.Сумма_1_1_2_и_1_2_2 = Выборка.Раздел2_1_1_2 + Выборка.Раздел2_1_2_2;	
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_2_и_1_2_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 15.3 и 1.1.3 и 1.2.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_15_3 <> 0 И (Выборка.Раздел2_1_1_3 + Выборка.Раздел2_1_2_3) = 0 Тогда
			ОписаниеУсловия= "Если в строке 15.3 указано значение, отличное от нуля, то и в строках 1.1.3 или 1.2.3 раздела II должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = "Строка 15.3 = " + Строка(Выборка.Раздел4_15_3) +"; 1.1.3 = " + Строка(Выборка.Раздел2_1_1_3)+"; 1.2.3 = " + Строка(Выборка.Раздел2_1_2_3);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 67 + КолДопКолонок, 1, 68 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 67 + КолДопКолонок, 1, 68 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_15_3 = Выборка.Раздел4_15_3;
		ОбластьСтрокаКС.Параметры.Сумма_1_1_3_и_1_2_3 = Выборка.Раздел2_1_1_3 + Выборка.Раздел2_1_2_3;	
		ОбластьСтрокаКС.Параметры.Проверка_Сумма_1_1_3_и_1_2_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 15 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_15 <> Выборка.Раздел4_15_1 + Выборка.Раздел4_15_2 + Выборка.Раздел4_15_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 15, должно быть равно сумме значений, указанных в строках 15.1, 15.2 и 15.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_15) +" <> " + Строка(Выборка.Раздел4_15_1 + Выборка.Раздел4_15_2 + Выборка.Раздел4_15_3);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 69 + КолДопКолонок, 1, 69 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 69 + КолДопКолонок, 1, 69 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_15_Сумма = Выборка.Раздел4_15 - Выборка.Раздел4_15_1 - Выборка.Раздел4_15_2 - Выборка.Раздел4_15_3;	
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_15_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 17 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_17 <> Выборка.Раздел4_17_1 + Выборка.Раздел4_17_2 + Выборка.Раздел4_17_3 + Выборка.Раздел4_17_4 + Выборка.Раздел4_17_5 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 17, должно быть равно сумме значений, указанных в строках 17.1, 17.2, 17.3, 17.4 и 17.5.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_17) +" <> " + Строка(Выборка.Раздел4_17_1 + Выборка.Раздел4_17_2 + Выборка.Раздел4_17_3 + Выборка.Раздел4_17_4 + Выборка.Раздел4_17_5);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 70 + КолДопКолонок, 1, 70 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 70 + КолДопКолонок, 1, 70 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_17_Сумма = Выборка.Раздел4_17 - Выборка.Раздел4_17_1 - Выборка.Раздел4_17_2 - Выборка.Раздел4_17_3 - Выборка.Раздел4_17_4 - Выборка.Раздел4_17_5;	
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_17_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 18 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_18 <> Выборка.Раздел4_18_1 + Выборка.Раздел4_18_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 18, должно быть равно сумме значений, указанных в строках 18.1 и 18.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_18) +" <> " + Строка(Выборка.Раздел4_18_1 + Выборка.Раздел4_18_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 71 + КолДопКолонок, 1, 71 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 71 + КолДопКолонок, 1, 71 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_18_Сумма = Выборка.Раздел4_18 - Выборка.Раздел4_18_1 - Выборка.Раздел4_18_2;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_18_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 18.1 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_18_1 <> Выборка.Раздел4_18_1_1 + Выборка.Раздел4_18_1_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 18.1, должно быть равно сумме значений, указанных в строках 18.1.1 и 18.1.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_18_1) +" <> " + Строка(Выборка.Раздел4_18_1_1 + Выборка.Раздел4_18_1_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 72 + КолДопКолонок, 1, 72 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 72 + КолДопКолонок, 1, 72 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_18_1_Сумма = Выборка.Раздел4_18_1 - Выборка.Раздел4_18_1_1 - Выборка.Раздел4_18_1_2;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_18_1_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 18.2 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_18_2 <> Выборка.Раздел4_18_2_1 + Выборка.Раздел4_18_2_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 18.2, должно быть равно сумме значений, указанных в строках 18.2.1 и 18.2.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_18_2) +" <> " + Строка(Выборка.Раздел4_18_2_1 + Выборка.Раздел4_18_2_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 73 + КолДопКолонок, 1, 73 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 73 + КолДопКолонок, 1, 73 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_18_2_Сумма = Выборка.Раздел4_18_2 - Выборка.Раздел4_18_2_1 - Выборка.Раздел4_18_2_2;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_18_2_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 19 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19 <> Выборка.Раздел4_19_1 + Выборка.Раздел4_19_2 + Выборка.Раздел4_19_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 19, должно быть равно сумме значений, указанных в строках 19.1, 19.2 и 19.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19) +" <> " + Строка(Выборка.Раздел4_19_1 + Выборка.Раздел4_19_2 + Выборка.Раздел4_19_3);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 74 + КолДопКолонок, 1, 74 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 74 + КолДопКолонок, 1, 74 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_Сумма = Выборка.Раздел4_19 - Выборка.Раздел4_19_1 - Выборка.Раздел4_19_2 - Выборка.Раздел4_19_3;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 19.3 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_3 <> Выборка.Раздел4_19_3_1 + Выборка.Раздел4_19_3_2 + Выборка.Раздел4_19_3_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 19, должно быть равно сумме значений, указанных в строках 19.1, 19.2 и 19.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_3) +" <> " + Строка(Выборка.Раздел4_19_3_1 + Выборка.Раздел4_19_3_2 + Выборка.Раздел4_19_3_3);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 75 + КолДопКолонок, 1, 75 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 75 + КолДопКолонок, 1, 75 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_3_Сумма = Выборка.Раздел4_19_3 - Выборка.Раздел4_19_3_1 - Выборка.Раздел4_19_3_2 - Выборка.Раздел4_19_3_3;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_3_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 19.1 И 19.1.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_1 <> 0 И Выборка.Раздел4_19_1_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 19.1 указано значение, отличное от нуля, то и в строке 19.1.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_1) +" <> 0 И " + Строка(Выборка.Раздел4_19_1_1) +" = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 76 + КолДопКолонок, 1, 77 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 76 + КолДопКолонок, 1, 77 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_1 = Выборка.Раздел4_19_1;
		ОбластьСтрокаКС.Параметры.Раздел4_19_1_1 = Выборка.Раздел4_19_1_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_1_19_1_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 19.1.1 И 19.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_1_1 <> 0 И Выборка.Раздел4_19_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 19.1.1 указано значение, отличное от нуля, то и в строке 19.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_1_1) +" <> 0 И " + Строка(Выборка.Раздел4_19_1) +" = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 78 + КолДопКолонок, 1, 78 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 78 + КолДопКолонок, 1, 78 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_1_1_19_1 = Выборка.Раздел4_19_1 - Выборка.Раздел4_19_1_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_1_19_1_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 19.2 И 19.2.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_2 <> 0 И Выборка.Раздел4_19_2_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 19.2 указано значение, отличное от нуля, то и в строке 19.2.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_2) +" <> 0 И " + Строка(Выборка.Раздел4_19_2_1) +" = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 79 + КолДопКолонок, 1, 80 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 79 + КолДопКолонок, 1, 80 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_2 = Выборка.Раздел4_19_2;
		ОбластьСтрокаКС.Параметры.Раздел4_19_2_1 = Выборка.Раздел4_19_2_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_2_19_2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 19.2.1 И 19.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_2_1 <> 0 И Выборка.Раздел4_19_2 = 0 Тогда
			ОписаниеУсловия= "Если в строке 19.2.1 указано значение, отличное от нуля, то и в строке 19.2 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_2_1) +" <> 0 И " + Строка(Выборка.Раздел4_19_2) +" = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 81 + КолДопКолонок, 1, 81 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 81 + КолДопКолонок, 1, 81 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_2_1_19_2 = Выборка.Раздел4_19_2 - Выборка.Раздел4_19_2_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_2_1_19_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 19.3.1 И 19.3.1.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_3_1 <> 0 И Выборка.Раздел4_19_3_1_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 19.3.1 указано значение, отличное от нуля, то и в строке 19.3.1.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_3_1) +" <> 0 И " + Строка(Выборка.Раздел4_19_3_1_1) +" = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 82 + КолДопКолонок, 1, 83 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 82 + КолДопКолонок, 1, 83 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_3_1 = Выборка.Раздел4_19_3_1;
		ОбластьСтрокаКС.Параметры.Раздел4_19_3_1_1 = Выборка.Раздел4_19_3_1_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_3_1_19_3_1_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 19.3.1.1 И 19.3.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_3_1_1 <> 0 И Выборка.Раздел4_19_3_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 19.3.1.1 указано значение, отличное от нуля, то и в строке 19.3.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_3_1_1) +" <> 0 И " + Строка(Выборка.Раздел4_19_3_1) +" = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 84 + КолДопКолонок, 1, 84 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 84 + КолДопКолонок, 1, 84 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_3_1_1_19_3_1 = Выборка.Раздел4_19_3_1 - Выборка.Раздел4_19_3_1_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_3_1_1_19_3_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 19.3.2 И 19.3.2.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_3_2 <> 0 И Выборка.Раздел4_19_3_2_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 19.3.2 указано значение, отличное от нуля, то и в строке 19.3.2.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_3_2) +" <> 0 И " + Строка(Выборка.Раздел4_19_3_2_1) +" = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 85 + КолДопКолонок, 1, 86 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 85 + КолДопКолонок, 1, 86 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_3_2 = Выборка.Раздел4_19_3_2;
		ОбластьСтрокаКС.Параметры.Раздел4_19_3_2_1 = Выборка.Раздел4_19_3_2_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_3_2_19_3_2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 19.3.2.1 И 19.3.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_3_2_1 <> 0 И Выборка.Раздел4_19_3_2 = 0 Тогда
			ОписаниеУсловия= "Если в строке 19.3.2.1 указано значение, отличное от нуля, то и в строке 19.3.2 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_3_2_1) +" <> 0 И " + Строка(Выборка.Раздел4_19_3_2) +" = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 87 + КолДопКолонок, 1, 87 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 87 + КолДопКолонок, 1, 87 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_3_2_1_19_3_2 = Выборка.Раздел4_19_3_2 - Выборка.Раздел4_19_3_2_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_3_2_1_19_3_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 19.3.3 И 19.3.3.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_3_3 <> 0 И Выборка.Раздел4_19_3_3_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 19.3.3 указано значение, отличное от нуля, то и в строке 19.3.3.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_3_3) +" <> 0 И " + Строка(Выборка.Раздел4_19_3_3_1) +" = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 88 + КолДопКолонок, 1, 89 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 88 + КолДопКолонок, 1, 89 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_3_3 = Выборка.Раздел4_19_3_3;
		ОбластьСтрокаКС.Параметры.Раздел4_19_3_3_1 = Выборка.Раздел4_19_3_3_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_3_3_19_3_3_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 19.3.3.1 И 19.3.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_19_3_3_1 <> 0 И Выборка.Раздел4_19_3_3 = 0 Тогда
			ОписаниеУсловия= "Если в строке 19.3.3.1 указано значение, отличное от нуля, то и в строке 19.3.3 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_19_3_3_1) +" <> 0 И " + Строка(Выборка.Раздел4_19_3_3) +" = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 90 + КолДопКолонок, 1, 90 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 90 + КолДопКолонок, 1, 90 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_19_3_3_1_19_3_3 = Выборка.Раздел4_19_3_3 - Выборка.Раздел4_19_3_3_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_19_3_3_1_19_3_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		
		// проверка по строке 21 и разделу 10 по сумме
		НайденныеСтрокиРаздел10 = ТЗРаздел10.НайтиСтроки(Новый Структура("КодКПК_ДатаОтчетности", СокрЛП(Выборка.КПК.Код)+"_"+Строка(Выборка.ДатаОкончанияОтчетногоПериода)));
		
		СуммаСтрок1раздел10 = 0;
		ЕстьНольВСтроках1Раздела10 = Истина;
		
		СуммаСтрок2раздел10 = 0;
		ЕстьНольВСтроках2Раздела10 = Истина;    
		
		
		Если НайденныеСтрокиРаздел10.Количество() > 0 Тогда
			Для Каждого НайденнаяСтрока Из НайденныеСтрокиРаздел10 Цикл
				Если Лев(НайденнаяСтрока.КодРаздела, 1) = "1" Тогда
					СуммаСтрок1раздел10 = СуммаСтрок1раздел10 + НайденнаяСтрока.РазмерОбязательствНаКонецОтчетногоПериода;		
					
					Если НайденнаяСтрока.РазмерОбязательствНаКонецОтчетногоПериода <> 0 Тогда
						ЕстьНольВСтроках1Раздела10 = Ложь;
					КонецЕсли;
				ИначеЕсли Лев(НайденнаяСтрока.КодРаздела, 1) = "2" Тогда
					СуммаСтрок2раздел10 = СуммаСтрок2раздел10 + НайденнаяСтрока.РазмерОбязательствНаКонецОтчетногоПериода;		
					
					Если НайденнаяСтрока.РазмерОбязательствНаКонецОтчетногоПериода <> 0 Тогда
						ЕстьНольВСтроках2Раздела10 = Ложь;
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;   			
		КонецЕсли;
		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_21 <> СуммаСтрок1раздел10 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 21 должно быть равно сумме значений, указанных в графе 5 по строке 1 (1.1 – …) Раздела X.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_21) +" <> " + Строка(СуммаСтрок1раздел10);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 91 + КолДопКолонок, 1, 91 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 91 + КолДопКолонок, 1, 91 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_21_Раздел10 = Выборка.Раздел4_21 - СуммаСтрок1раздел10;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_21_Раздел10 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		// проверка по строке 21 и разделу 10 по нулям
		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_21 <> 0 И ЕстьНольВСтроках1Раздела10 = Истина Тогда
			ОписаниеУсловия= "Если в строке 21 указано значение, отличное от нуля, то и в графе 5 строк 1.1 – … Раздела Х должны быть указаны значения, отличные от нуля.";
			ОписаниеОшибки = "Строка 21 = " + Строка(Выборка.Раздел4_21) + ": " + Строка("Все строки 1 (1.1 – …) равны 0");
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 92 + КолДопКолонок, 1, 92 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 92 + КолДопКолонок, 1, 92 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_21_Раздел10_ПроверкаНаНоль = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;		
		
		
		//  строка 22 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_22 <> Выборка.Раздел4_22_1 + Выборка.Раздел4_22_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 22, должно быть равно сумме значений, указанных в строках 22.1 и 22.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_22) +" <> " + Строка(Выборка.Раздел4_22_1 + Выборка.Раздел4_22_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 93 + КолДопКолонок, 1, 93 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 93 + КолДопКолонок, 1, 93 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_22_Сумма = Выборка.Раздел4_22 - Выборка.Раздел4_22_1 - Выборка.Раздел4_22_2;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_22_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 23 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_23 <> Выборка.Раздел4_23_1 + Выборка.Раздел4_23_2 + Выборка.Раздел4_23_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 23, должно быть равно сумме значений, указанных в строках 23.1, 23.2 и 23.3. ";
			ОписаниеОшибки = Строка(Выборка.Раздел4_23) +" <> " + Строка(Выборка.Раздел4_23_1 + Выборка.Раздел4_23_2 + Выборка.Раздел4_23_3);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 94 + КолДопКолонок, 1, 94 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 94 + КолДопКолонок, 1, 94 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_23_Сумма = Выборка.Раздел4_23 - Выборка.Раздел4_23_1 - Выборка.Раздел4_23_2 - Выборка.Раздел4_23_3;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_23_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 23.3 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_23_3 <> Выборка.Раздел4_23_3_1 + Выборка.Раздел4_23_3_2 + Выборка.Раздел4_23_3_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 23.3, должно быть равно сумме значений, указанных в строках 23.3.1, 23.3.2 и 23.3.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_23_3) +" <> " + Строка(Выборка.Раздел4_23_3_1 + Выборка.Раздел4_23_3_2 + Выборка.Раздел4_23_3_3);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 95 + КолДопКолонок, 1, 95 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 95 + КолДопКолонок, 1, 95 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_23_3_Сумма = Выборка.Раздел4_23_3 - Выборка.Раздел4_23_3_1 - Выборка.Раздел4_23_3_2 - Выборка.Раздел4_23_3_3;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_23_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 23.1.1 И 23.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		                   
		
		Если Выборка.Раздел4_23_1_1 <> 0 И Выборка.Раздел4_23_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 23.1.1 указано значение, отличное от нуля, то и в строке 23.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_23_1_1) +" <> 0 И " + Строка(Выборка.Раздел4_23_1) +" = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 96 + КолДопКолонок, 1, 97 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 96 + КолДопКолонок, 1, 97 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_23_1_1 = Выборка.Раздел4_23_2_1;
		ОбластьСтрокаКС.Параметры.Раздел4_23_1 = Выборка.Раздел4_23_2;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_23_1_1_23_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		
		//  строка 23.2.1 И 23.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_23_2_1 <> 0 И Выборка.Раздел4_23_2 = 0 Тогда
			ОписаниеУсловия= "Если в строке 23.2.1 указано значение, отличное от нуля, то и в строке 23.2 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_23_2_1) +" <> 0 И " + Строка(Выборка.Раздел4_23_2) +" = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 98 + КолДопКолонок, 1, 99 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 98 + КолДопКолонок, 1, 99 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_23_2_1 = Выборка.Раздел4_23_2_1;
		ОбластьСтрокаКС.Параметры.Раздел4_23_2 = Выборка.Раздел4_23_2;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_23_2_1_23_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 23.3.1.1 И 23.3.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_23_3_1_1 <> 0 И Выборка.Раздел4_23_3_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 23.3.1.1 указано значение, отличное от нуля, то и в строке 23.3.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_23_3_1_1) +" <> 0 И " + Строка(Выборка.Раздел4_23_3_1) +" = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 100 + КолДопКолонок, 1, 101 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 100 + КолДопКолонок, 1, 101 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_23_3_1_1 = Выборка.Раздел4_23_3_1_1;
		ОбластьСтрокаКС.Параметры.Раздел4_23_3_1 = Выборка.Раздел4_23_3_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_23_2_1_23_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 23.3.2.1 И 23.3.2
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_23_3_2_1 <> 0 И Выборка.Раздел4_23_3_2 = 0 Тогда
			ОписаниеУсловия= "Если в строке 23.3.2.1 указано значение, отличное от нуля, то и в строке 23.3.2 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_23_3_2_1) +" <> 0 И " + Строка(Выборка.Раздел4_23_3_2) +" = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 102 + КолДопКолонок, 1, 103 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 102 + КолДопКолонок, 1, 103 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_23_3_2_1 = Выборка.Раздел4_23_3_2_1;
		ОбластьСтрокаКС.Параметры.Раздел4_23_3_2 = Выборка.Раздел4_23_3_2;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_23_3_2_1_23_3_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 23.3.3.1 И 23.3.3
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_23_3_3_1 <> 0 И Выборка.Раздел4_23_3_3 = 0 Тогда
			ОписаниеУсловия= "Если в строке 23.3.3.1 указано значение, отличное от нуля, то и в строке 23.3.3 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_23_3_3_1) +" <> 0 И " + Строка(Выборка.Раздел4_23_3_3) +" = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 104 + КолДопКолонок, 1, 105 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 104 + КолДопКолонок, 1, 105 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_23_3_3_1 = Выборка.Раздел4_23_3_3_1;
		ОбластьСтрокаКС.Параметры.Раздел4_23_3_3 = Выборка.Раздел4_23_3_3;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_23_3_3_1_23_3_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 24 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_24 <> Выборка.Раздел4_24_1 + Выборка.Раздел4_24_2 + Выборка.Раздел4_24_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 24, должно быть равно сумме значений, указанных в строках 24.1, 24.2 и 24.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_24) +" <> " + Строка(Выборка.Раздел4_24_1 + Выборка.Раздел4_24_2 + Выборка.Раздел4_24_3);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 106 + КолДопКолонок, 1, 106 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 106 + КолДопКолонок, 1, 106 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_24_Сумма = Выборка.Раздел4_24 - Выборка.Раздел4_24_1 - Выборка.Раздел4_24_2 - Выборка.Раздел4_24_3;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_24_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 25 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_25 < Выборка.Раздел4_25_1 + Выборка.Раздел4_25_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 25, должно быть больше или равно сумме значений, указанных в строках 25.1 и 25.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_25) +" < " + Строка(Выборка.Раздел4_25_1 + Выборка.Раздел4_25_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 107 + КолДопКолонок, 1, 107 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 107 + КолДопКолонок, 1, 107 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_25_Сумма = Выборка.Раздел4_25 - Выборка.Раздел4_25_1 - Выборка.Раздел4_25_2;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_25_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 25.1 И 25.1.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_25_1 <> 0 И Выборка.Раздел4_25_1_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 25.1 указано значение, отличное от нуля, то и в строке 25.1.1 должно быть указано значение, отличное от нуля ";
			ОписаниеОшибки = Строка(Выборка.Раздел4_25_1) +" <> 0 И " + Строка(Выборка.Раздел4_25_1_1) +" = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 108 + КолДопКолонок, 1, 109 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 108 + КолДопКолонок, 1, 109 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_25_1 = Выборка.Раздел4_25_1;
		ОбластьСтрокаКС.Параметры.Раздел4_25_1_1 = Выборка.Раздел4_25_1_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_25_1_25_1_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 25.1. и 25.1 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_25_1_1 <> 0 И  Выборка.Раздел4_25_1=0 Тогда
			ОписаниеУсловия= "Если в строке 25.1.1 указано значение, отличное от нуля, то и в строке 25.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_25_1_1) +" <> 0 И " + Строка(Выборка.Раздел4_25_1) + " = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 110 + КолДопКолонок, 1, 110 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 110 + КолДопКолонок, 1, 110 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		//  строка 25.2 И 25.2.1
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_25_2 <> 0 И Выборка.Раздел4_25_2_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 25.2 указано значение, отличное от нуля, то и в строке 25.2.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_25_2) +" <> 0 И " + Строка(Выборка.Раздел4_25_2_1) +" = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 111 + КолДопКолонок, 1, 112 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 111 + КолДопКолонок, 1, 112 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_25_2 = Выборка.Раздел4_25_2;
		ОбластьСтрокаКС.Параметры.Раздел4_25_2_1 = Выборка.Раздел4_25_2_1;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_25_2_25_2_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки; 
		
		//  строка 25.2.1 и 25.2 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_25_1_1 <> 0 И  Выборка.Раздел4_25_1=0 Тогда
			ОписаниеУсловия= "Если в строке 25.1.1 указано значение, отличное от нуля, то и в строке 25.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_25_1_1) +" <> 0 И " + Строка(Выборка.Раздел4_25_1) + " = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 113 + КолДопКолонок, 1, 113 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 113 + КолДопКолонок, 1, 113 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		// строка 25.1 и графа 4 раздел6 
		Графы4Раздел6 = 0;
		
		НайденныеСтроки = ТЗРаздел6Графа4.НайтиСтроки(Новый Структура("КодКПК_ДатаОтчетности", Выборка.КПК.Код+"_"+Строка(Выборка.ДатаОкончанияОтчетногоПериода)));
		
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			Графы4Раздел6 =  НайденныеСтроки[0].Графа4;
		КонецЕсли;
		
		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_25_1 < Графы4Раздел6 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 25.1, должно быть больше или равно сумме значений, указанных во всех строках графы 4 раздела VI.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_25_1) +" < " + Строка(Графы4Раздел6);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 114 + КолДопКолонок, 1, 114 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 114 + КолДопКолонок, 1, 114 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_25_1_Раздел6Графа4 = Выборка.Раздел4_25_1 - Графы4Раздел6;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_25_1_Раздел6Графа4 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		
		// Строка 27 и разделу 10 по нулям   
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_27 <> СуммаСтрок2раздел10 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 27 должно быть равно сумме значений, указанных в графе 5 по строке 2 (2.1 – …) Раздела Х..";
			ОписаниеОшибки = Строка(Выборка.Раздел4_27) +" <> " + Строка(СуммаСтрок2раздел10);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 115 + КолДопКолонок, 1, 115 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 115 + КолДопКолонок, 1, 115 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_27_Раздел10 = Выборка.Раздел4_27 - СуммаСтрок2раздел10;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_27_Раздел10 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		// проверка по строке 27 и разделу 10 по нулям
		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_27 <> 0 И ЕстьНольВСтроках2Раздела10 = Истина Тогда
			ОписаниеУсловия= "Если в строке 27 указано значение, отличное от нуля, то и графе 5 строк 2.1 – … Раздела Х должно быть указано значение, отличное от нуля..";
			ОписаниеОшибки = "Строка 27 = " + Строка(Выборка.Раздел4_21) + ": " + Строка("Все строки 2 (2.1 – …) равны 0");
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 116 + КолДопКолонок, 1, 116 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 116 + КолДопКолонок, 1, 116 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_27_Раздел10_ПроверкаНаНоль = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;		
		
		
		
		//  строка 29 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_29 <> Выборка.Раздел4_29_1 + Выборка.Раздел4_29_2  + Выборка.Раздел4_29_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 29, должно быть равно сумме значений, указанных в строках 29.1, 29.2 и 29.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_29) +" <> " + Строка(Выборка.Раздел4_29_1 + Выборка.Раздел4_29_2 + Выборка.Раздел4_29_3);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 117 + КолДопКолонок, 1, 117 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 117 + КолДопКолонок, 1, 117 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_29_Сумма = Выборка.Раздел4_29 - Выборка.Раздел4_29_1 - Выборка.Раздел4_29_2 - Выборка.Раздел4_29_3;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_29_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 30 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_30 <> Выборка.Раздел4_30_1 + Выборка.Раздел4_30_2  + Выборка.Раздел4_30_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 30, должно быть равно сумме значений, указанных в строках 30.1, 30.2 и 30.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_30) +" <> " + Строка(Выборка.Раздел4_30_1 + Выборка.Раздел4_30_2 + Выборка.Раздел4_30_3);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 118 + КолДопКолонок, 1, 118 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 118 + КолДопКолонок, 1, 118 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_30_Сумма = Выборка.Раздел4_30 - Выборка.Раздел4_30_1 - Выборка.Раздел4_30_2 - Выборка.Раздел4_30_3;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_30_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		
		//  строка 30 и 31 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_30 <> 0 И  Выборка.Раздел4_31 = 0 Тогда
			ОписаниеУсловия= "Если в строке 30 указано значение, отличное от нуля, то и в строке 31 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_30) +" <> 0 И " + Строка(Выборка.Раздел4_31) + " = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 119 + КолДопКолонок, 1, 120 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 119 + КолДопКолонок, 1, 120 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_30 = Выборка.Раздел4_30 ;
		ОбластьСтрокаКС.Параметры.Раздел4_31 = Выборка.Раздел4_31 ;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_30_31 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 30.1 и 31.1 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_30_1 <> 0 И  Выборка.Раздел4_31_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 30.1 указано значение, отличное от нуля, то и в строке 31.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_30_1) +" <> 0 И " + Строка(Выборка.Раздел4_31_1) + " = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 121 + КолДопКолонок, 1, 122 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 121 + КолДопКолонок, 1, 122 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_30_1 = Выборка.Раздел4_30_1 ;
		ОбластьСтрокаКС.Параметры.Раздел4_31_1 = Выборка.Раздел4_31_1 ;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_30_1_31_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 30.2 и 31.2 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_30_2 <> 0 И  Выборка.Раздел4_31_2 = 0 Тогда
			ОписаниеУсловия= "Если в строке 30.2 указано значение, отличное от нуля, то и в строке 31.2 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_30_2) +" <> 0 И " + Строка(Выборка.Раздел4_31_2) + " = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 123 + КолДопКолонок, 1, 124 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 123 + КолДопКолонок, 1, 124 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_30_2 = Выборка.Раздел4_30_2 ;
		ОбластьСтрокаКС.Параметры.Раздел4_31_2 = Выборка.Раздел4_31_2 ;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_30_2_31_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 30.3 и 31.3 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_30_3 <> 0 И  Выборка.Раздел4_31_3 = 0 Тогда
			ОписаниеУсловия= "Если в строке 30.3 указано значение, отличное от нуля, то и в строке 31.3 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_30_3) +" <> 0 И " + Строка(Выборка.Раздел4_31_3) + " = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 125 + КолДопКолонок, 1, 126 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 125 + КолДопКолонок, 1, 126 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_30_3 = Выборка.Раздел4_30_3 ;
		ОбластьСтрокаКС.Параметры.Раздел4_31_3 = Выборка.Раздел4_31_3 ;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_30_3_31_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 31 и 30 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_31 <> 0 И  Выборка.Раздел4_30 = 0 Тогда
			ОписаниеУсловия= "Если в строке 31 указано значение, отличное от нуля, то и в строке 30 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_31) +" <> 0 И " + Строка(Выборка.Раздел4_30) + " = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 127 + КолДопКолонок, 1, 128 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 127 + КолДопКолонок, 1, 128 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_31_30 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 31.1 и 30.1 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_31_1 <> 0 И  Выборка.Раздел4_30_1 = 0 Тогда
			ОписаниеУсловия= "Если в строке 31.1 указано значение, отличное от нуля, то и в строке 30.1 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_31_1) +" <> 0 И " + Строка(Выборка.Раздел4_30_1) + " = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 129 + КолДопКолонок, 1, 130 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 129 + КолДопКолонок, 1, 130 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_31_1_30_1 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 31.2 и 30.2 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_31_2 <> 0 И  Выборка.Раздел4_30_2 = 0 Тогда
			ОписаниеУсловия= "Если в строке 31.2 указано значение, отличное от нуля, то и в строке 30.2 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_31_2) +" <> 0 И " + Строка(Выборка.Раздел4_30_2) + " = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 131 + КолДопКолонок, 1, 132 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 131 + КолДопКолонок, 1, 132 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_31_2_30_2 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 31.3 и 30.3 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_31_3 <> 0 И  Выборка.Раздел4_30_3 = 0 Тогда
			ОписаниеУсловия= "Если в строке 31.3 указано значение, отличное от нуля, то и в строке 30.3 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_31_3) +" <> 0 И " + Строка(Выборка.Раздел4_30_3) + " = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 133 + КолДопКолонок, 1, 134 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 133 + КолДопКолонок, 1, 134 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_31_3_30_3 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 31 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_31 <> Выборка.Раздел4_31_1 + Выборка.Раздел4_31_2  + Выборка.Раздел4_31_3 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 31, должно быть равно сумме значений, указанных в строках 31.1, 31.2 и 31.3.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_30) +" <> " + Строка(Выборка.Раздел4_30_1 + Выборка.Раздел4_30_2 + Выборка.Раздел4_30_3);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 135 + КолДопКолонок, 1, 135 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 135 + КолДопКолонок, 1, 135 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_31_Сумма = Выборка.Раздел4_31 - Выборка.Раздел4_31_1 - Выборка.Раздел4_31_2 - Выборка.Раздел4_31_3;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_31_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 32 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_32 <> Выборка.Раздел4_32_1 + Выборка.Раздел4_32_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 32, должно быть равно сумме значений, указанных в строках 32.1 и 32.2.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_32) +" <> " + Строка(Выборка.Раздел4_32_1 + Выборка.Раздел4_32_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 136 + КолДопКолонок, 1, 136 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 136 + КолДопКолонок, 1, 136 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_32_Сумма = Выборка.Раздел4_32 - Выборка.Раздел4_32_1 - Выборка.Раздел4_32_2 ;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_32_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 32 и 33 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_32 <> 0 И  Выборка.Раздел4_33 = 0 Тогда
			ОписаниеУсловия= "Если в строке 32 указано значение, отличное от нуля, то и в строке 33 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_32) +" <> 0 И " + Строка(Выборка.Раздел4_33) + " = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 137 + КолДопКолонок, 1, 138 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 137 + КолДопКолонок, 1, 138 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_32 = Выборка.Раздел4_32;
		ОбластьСтрокаКС.Параметры.Раздел4_33 = Выборка.Раздел4_33 ;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_32_33 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;  
		
		//  строка 33 и 32 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_33 <> 0 И  Выборка.Раздел4_32 = 0 Тогда
			ОписаниеУсловия= "Если в строке 33 указано значение, отличное от нуля, то и в строке 32 должно быть указано значение, отличное от нуля.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_33) +" <> 0 И " + Строка(Выборка.Раздел4_32) + " = 0";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 139 + КолДопКолонок, 1, 140 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 139 + КолДопКолонок, 1, 140 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_33_32 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;    
		
		
		//  строка 35 сумма		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_35 <> Выборка.Раздел4_35_1 + Выборка.Раздел4_35_2 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 35, должно быть равно сумме значений, указанных в строках 35.1 и 35.2";
			ОписаниеОшибки = Строка(Выборка.Раздел4_35) +" <> " + Строка(Выборка.Раздел4_35_1 + Выборка.Раздел4_35_2);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 141 + КолДопКолонок, 1, 141 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 141 + КолДопКолонок, 1, 141 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_35_Сумма = Выборка.Раздел4_35 - Выборка.Раздел4_35_1 - Выборка.Раздел4_35_2 ;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_35_Сумма = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 35.1 равна сумме граф 3-8 раздела 8 строка *.1
		
		СуммаГраф3_8 = 	СтруктураСтрок.Раздел8_1_1.Графа3 +СтруктураСтрок.Раздел8_2_1.Графа3 + СтруктураСтрок.Раздел8_3_1.Графа3 + СтруктураСтрок.Раздел8_4_1.Графа3 + СтруктураСтрок.Раздел8_5_1.Графа3 + СтруктураСтрок.Раздел8_6_1.Графа3 + СтруктураСтрок.Раздел8_7_1.Графа3  + СтруктураСтрок.Раздел8_8_1.Графа3 + СтруктураСтрок.Раздел8_9_1.Графа3;
		СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_1.Графа4 +СтруктураСтрок.Раздел8_2_1.Графа4 + СтруктураСтрок.Раздел8_3_1.Графа4 + СтруктураСтрок.Раздел8_4_1.Графа4 + СтруктураСтрок.Раздел8_5_1.Графа4 + СтруктураСтрок.Раздел8_6_1.Графа4 + СтруктураСтрок.Раздел8_7_1.Графа4  + СтруктураСтрок.Раздел8_8_1.Графа4 + СтруктураСтрок.Раздел8_9_1.Графа4;
		СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_1.Графа5 +СтруктураСтрок.Раздел8_2_1.Графа5 + СтруктураСтрок.Раздел8_3_1.Графа5 + СтруктураСтрок.Раздел8_4_1.Графа5 + СтруктураСтрок.Раздел8_5_1.Графа5 + СтруктураСтрок.Раздел8_6_1.Графа5 + СтруктураСтрок.Раздел8_7_1.Графа5  + СтруктураСтрок.Раздел8_8_1.Графа5 + СтруктураСтрок.Раздел8_9_1.Графа5;
		СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_1.Графа6 +СтруктураСтрок.Раздел8_2_1.Графа6 + СтруктураСтрок.Раздел8_3_1.Графа6 + СтруктураСтрок.Раздел8_4_1.Графа6 + СтруктураСтрок.Раздел8_5_1.Графа6 + СтруктураСтрок.Раздел8_6_1.Графа6 + СтруктураСтрок.Раздел8_7_1.Графа6  + СтруктураСтрок.Раздел8_8_1.Графа6 + СтруктураСтрок.Раздел8_9_1.Графа6;
		СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_1.Графа7 +СтруктураСтрок.Раздел8_2_1.Графа7 + СтруктураСтрок.Раздел8_3_1.Графа7 + СтруктураСтрок.Раздел8_4_1.Графа7 + СтруктураСтрок.Раздел8_5_1.Графа7 + СтруктураСтрок.Раздел8_6_1.Графа7 + СтруктураСтрок.Раздел8_7_1.Графа7  + СтруктураСтрок.Раздел8_8_1.Графа7 + СтруктураСтрок.Раздел8_9_1.Графа7;
		СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_1.Графа8 +СтруктураСтрок.Раздел8_2_1.Графа8 + СтруктураСтрок.Раздел8_3_1.Графа8 + СтруктураСтрок.Раздел8_4_1.Графа8 + СтруктураСтрок.Раздел8_5_1.Графа8 + СтруктураСтрок.Раздел8_6_1.Графа8 + СтруктураСтрок.Раздел8_7_1.Графа8  + СтруктураСтрок.Раздел8_8_1.Графа8 + СтруктураСтрок.Раздел8_9_1.Графа8;
		СуммаГраф3_8 = Окр(СуммаГраф3_8, 0);
		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_35_1 <> СуммаГраф3_8 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 35.1, должно быть равно сумме значений, указанных в графах 3 – 8 строк 1.1, 2.1, 3.1, 4.1, 5.1, 6.1, 7.1, 8.1 и 9.1 Раздела VIII.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_35_1) +" <> " + Строка(СуммаГраф3_8);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 142 + КолДопКолонок, 1, 142 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 142 + КолДопКолонок, 1, 142 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_35_1_Граф3_8 = Выборка.Раздел4_35_1 - СуммаГраф3_8;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_35_1_Граф3_8 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		//  строка 35.2 равна сумме граф 3-8 раздела 8 строка *.2
		
		СуммаГраф3_8 = 	СтруктураСтрок.Раздел8_1_2.Графа3 +СтруктураСтрок.Раздел8_2_2.Графа3 + СтруктураСтрок.Раздел8_3_2.Графа3 + СтруктураСтрок.Раздел8_4_2.Графа3 + СтруктураСтрок.Раздел8_5_2.Графа3 + СтруктураСтрок.Раздел8_6_2.Графа3 + СтруктураСтрок.Раздел8_7_2.Графа3  + СтруктураСтрок.Раздел8_8_2.Графа3 + СтруктураСтрок.Раздел8_9_2.Графа3;
		СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_2.Графа4 +СтруктураСтрок.Раздел8_2_2.Графа4 + СтруктураСтрок.Раздел8_3_2.Графа4 + СтруктураСтрок.Раздел8_4_2.Графа4 + СтруктураСтрок.Раздел8_5_2.Графа4 + СтруктураСтрок.Раздел8_6_2.Графа4 + СтруктураСтрок.Раздел8_7_2.Графа4  + СтруктураСтрок.Раздел8_8_2.Графа4 + СтруктураСтрок.Раздел8_9_2.Графа4;
		СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_2.Графа5 +СтруктураСтрок.Раздел8_2_2.Графа5 + СтруктураСтрок.Раздел8_3_2.Графа5 + СтруктураСтрок.Раздел8_4_2.Графа5 + СтруктураСтрок.Раздел8_5_2.Графа5 + СтруктураСтрок.Раздел8_6_2.Графа5 + СтруктураСтрок.Раздел8_7_2.Графа5  + СтруктураСтрок.Раздел8_8_2.Графа5 + СтруктураСтрок.Раздел8_9_2.Графа5;
		СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_2.Графа6 +СтруктураСтрок.Раздел8_2_2.Графа6 + СтруктураСтрок.Раздел8_3_2.Графа6 + СтруктураСтрок.Раздел8_4_2.Графа6 + СтруктураСтрок.Раздел8_5_2.Графа6 + СтруктураСтрок.Раздел8_6_2.Графа6 + СтруктураСтрок.Раздел8_7_2.Графа6  + СтруктураСтрок.Раздел8_8_2.Графа6 + СтруктураСтрок.Раздел8_9_2.Графа6;
		СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_2.Графа7 +СтруктураСтрок.Раздел8_2_2.Графа7 + СтруктураСтрок.Раздел8_3_2.Графа7 + СтруктураСтрок.Раздел8_4_2.Графа7 + СтруктураСтрок.Раздел8_5_2.Графа7 + СтруктураСтрок.Раздел8_6_2.Графа7 + СтруктураСтрок.Раздел8_7_2.Графа7  + СтруктураСтрок.Раздел8_8_2.Графа7 + СтруктураСтрок.Раздел8_9_2.Графа7;
		СуммаГраф3_8 = СуммаГраф3_8 + СтруктураСтрок.Раздел8_1_2.Графа8 +СтруктураСтрок.Раздел8_2_2.Графа8 + СтруктураСтрок.Раздел8_3_2.Графа8 + СтруктураСтрок.Раздел8_4_2.Графа8 + СтруктураСтрок.Раздел8_5_2.Графа8 + СтруктураСтрок.Раздел8_6_2.Графа8 + СтруктураСтрок.Раздел8_7_2.Графа8  + СтруктураСтрок.Раздел8_8_2.Графа8 + СтруктураСтрок.Раздел8_9_2.Графа8;
		СуммаГраф3_8 = Окр(СуммаГраф3_8, 0);
		
		ОписаниеУсловия = "";
		ОписаниеОшибки = "";  		
		
		Если Выборка.Раздел4_35_2 <> СуммаГраф3_8 Тогда
			ОписаниеУсловия= "Значение, указанное в строке 35.2, должно быть равно сумме значений, указанных в графах 3 – 8 строк 1.2, 2.2, 3.2, 4.2, 5.2, 6.2, 7.2, 8.2 и 9.2 Раздела VIII.";
			ОписаниеОшибки = Строка(Выборка.Раздел4_35_2) +" <> " + Строка(СуммаГраф3_8);
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);   
			ИтогоОшибокКС = ИтогоОшибокКС + 1;
			
			ОбластьСтрокаКС.Область(1, 143 + КолДопКолонок, 1, 143 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;   
		Иначе
			ОбластьСтрокаКС.Область(1, 143 + КолДопКолонок, 1, 143 + КолДопКолонок).ЦветФона = ЦветФонаСтроки; 		
		КонецЕсли;
		
		ОбластьСтрокаКС.Параметры.Раздел4_35_2_Граф3_8 = Выборка.Раздел4_35_2 - СуммаГраф3_8;
		ОбластьСтрокаКС.Параметры.Проверка_Раздел4_35_2_Граф3_8 = ОписаниеУсловия + ?(ОписаниеУсловия = "", "", Символы.ПС) + ОписаниеОшибки;
		
		
		ОбластьСтрокаКС.Параметры.ИтогоОшибокКС = ?(ИтогоОшибокКС = 0, "0", ИтогоОшибокКС);
		
		Если ИтогоОшибокКС > 0 Тогда
			ОбластьСтрокаКС.Область(1, 4 + КолДопКолонок, 1, 4 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;
		КонецЕсли;            
		
		РезультатКС.Вывести(ОбластьСтрокаКС); 	
		
	КонецЦикла;
	
	ЭтотОбъект.РезультатКС.ФиксацияСверху = 4;
	ЭтотОбъект.РезультатКС.ФиксацияСлева = 4;     
	
	
	// 4. Нормативы
	
	НазваниеТаблицы = "Нормативы";
	// Табличный документ 
	РезультатНормативы.Очистить();
	РезультатНормативы.НачатьАвтогруппировкуСтрок(); 	
	
	
	Если ВидОтчета = 0 Тогда
		Макет = ОтчетОбъект.ПолучитьМакет("МакетНормативы");
	Иначе
		Макет = ОтчетОбъект.ПолучитьМакет("МакетНормативыПериод");
	КонецЕсли;
	
	ОбластьШапкаПредставлениеПериода = Макет.получитьОбласть("ШапкаПредставлениеПериода");
	
	ОбластьШапкаПредставлениеПериода.Параметры.ПредставлениеПериода = ПредставлениеПериода(НачалоПериода, ОкончаниеПериода);
	РезультатНормативы.Вывести(ОбластьШапкаПредставлениеПериода);
	
	
	ШапкаПредельныеЗначения = Макет.ПолучитьОбласть("ШапкаПредельныеЗначения");
	РезультатНормативы.Вывести(ШапкаПредельныеЗначения, 1);
	
	ОбластьСтрокиПредельныеЗначения = Макет.ПолучитьОбласть("СтрокиПредельныеЗначения");
	РезультатНормативы.Вывести(ОбластьСтрокиПредельныеЗначения, 2);
	
	
	РезультатНормативы.ЗакончитьАвтогруппировкуСтрок();
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	РезультатНормативы.Вывести(ОбластьШапкаТаблицы, 2); 	
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	
	Выборка.Сбросить();	
	
	СтрокаЧетная = Ложь;
	
	НомерСтроки = 0;
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		Если ВыводитьТолькоКПКСОтчетностью И  НЕ Выборка.ЕстьДокумент Тогда
			Продолжить;			
		КонецЕсли;
		
		НомерСтроки = НомерСтроки +1;
		
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		
		ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
		ОбластьСтрока.Параметры.КраткоеНазваниеКПК = Выборка.КПК.НаименованиеКраткое;
		
		Если ВидОтчета = 1 Тогда
			ОбластьСтрока.Параметры.ПериодОтчетности = СРО_ЗагрузкаОтчетности.ПолучитьПредставлениеДатыотчета(Выборка.ДатаОкончанияОтчетногоПериода);
		КонецЕсли;
		
		
		Если СтрокаЧетная Тогда
			ЦветФонаСтроки = WebЦвета.ШелковыйОттенок;
		Иначе
			ЦветФонаСтроки = WebЦвета.Белый;
		КонецЕсли;
		
		СтрокаЧетная = ?(СтрокаЧетная, Ложь, Истина);  
		
		
		ОбластьСтрока.Область(1, 1, 2, 12 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;		
		
		// если нет документа отчетности, то пропускаем проверки
		
		Если НЕ Выборка.ЕстьДокумент Тогда
			РезультатНормативы.Вывести(ОбластьСтрока); 	 		
			Продолжить;
		КонецЕсли;
		
		// записываем расшгифровки
		
		Если Выборка.ДокументОтчетности = null Тогда   			
			ОбластьСтрока.Параметры.ДокументОтчетности  = "Нет документа";
			ОбластьСтрока.Область(1, 3, 1, 3).ЦветТекста = WebЦвета.Черный;				
		Иначе	
			ОбластьСтрока.Параметры.ДокументОтчетности  = Выборка.ДокументОтчетности;
			ОбластьСтрока.Область(1, 3, 1, 3).ЦветТекста =  WebЦвета.Синий;
		КонецЕсли;
		
		
		ОбластьСтрока.Параметры.РасшифровкаФН1 = Строка(Выборка.Раздел2_2_2) + " / (" + Строка(Выборка.Раздел2_3_1_1) + " + " + Строка(Выборка.Раздел2_3_1_2) + " + " + Строка(Выборка.Раздел2_3_2_1) + " + " + Строка(Выборка.Раздел2_3_2_2)+")*100";		
		ОбластьСтрока.Параметры.РасшифровкаФН2 = "(" + Строка(Выборка.Раздел4_20) +" - " + Строка(Выборка.Раздел4_21) +") / (" + Строка(Выборка.Раздел2_3_1_1) + " + " + Строка(Выборка.Раздел2_3_1_2) + " + " + Строка(Выборка.Раздел2_3_2_1) + " + " + Строка(Выборка.Раздел2_3_2_2)+")*100";
		ОбластьСтрока.Параметры.РасшифровкаФН3 = "(" + Строка(Выборка.Раздел4_26) +" - " + Строка(Выборка.Раздел4_27) +") / (" + Строка(Выборка.Раздел2_1_1) + " + " + Строка(Выборка.Раздел2_1_2) + " + " + Строка(Выборка.Раздел4_35_1) +")*100";
		ОбластьСтрока.Параметры.РасшифровкаФН4 = Строка(Выборка.Раздел2_2_1) + " / (" + Строка(Выборка.Раздел2_3_1_1) + " + " + Строка(Выборка.Раздел2_3_1_2) + " + " + Строка(Выборка.Раздел2_3_2_1) + " + " + Строка(Выборка.Раздел2_3_2_2)+")*100";
		ОбластьСтрока.Параметры.РасшифровкаФН5 = "(" + Строка(Выборка.Раздел2_3_1_3) +" + " + Строка(Выборка.Раздел2_3_2_3)+ ") / (" + Строка(Выборка.Раздел2_3_1_1) + " + " + Строка(Выборка.Раздел2_3_1_2) + " + " + Строка(Выборка.Раздел2_3_2_1) + " + " + Строка(Выборка.Раздел2_3_2_2)+")*100";
		ОбластьСтрока.Параметры.РасшифровкаФН6 = "(" + Строка(Выборка.Раздел2_1_1_3) +" + " + Строка(Выборка.Раздел2_1_2_3)+ ") / (" + Строка(Выборка.Раздел2_2_1) + " + " + Строка(Выборка.Раздел2_3_1) + " + " + Строка(Выборка.Раздел2_3_2)+")*100";
		ОбластьСтрока.Параметры.РасшифровкаФН7 = "(" + Строка(Выборка.Раздел2_1_1) +" + " + Строка(Выборка.Раздел2_1_2)+" + " + Строка(Выборка.Раздел2_1_3_2)+" + " + Строка(Выборка.Раздел2_1_4_2)+" + " +Строка(Выборка.Раздел2_1_12_1_1)+" + " + Строка(Выборка.Раздел2_1_12_2)+" + " + Строка(Выборка.Раздел2_1_12_3)+" + " + Строка(Выборка.Раздел2_1_12_4)+ ") / (" + Строка(Выборка.Раздел2_3_1) + " + " + Строка(Выборка.Раздел2_3_2) +")*100";
		ОбластьСтрока.Параметры.РасшифровкаФН8 = "(" + Строка(Выборка.Раздел2_1_1) +" + " + Строка(Выборка.Раздел2_1_3) +" + " + Строка(Выборка.Раздел2_1_8)+ ") / (" + Строка(Выборка.Раздел2_3_1) + " + " + Строка(Выборка.Раздел2_3_3)+")*100";
		
		// проверяем		
		// совпадение расчетного и показателя из файла
		Если Выборка.Раздел11_ФН1 <> Выборка.ФН1Расчетный Тогда 
			ОписаниеУсловия = "ФН1 не свпадает с расчетным";	
			ОбластьСтрока.Область(1, 4 + КолДопКолонок, 2, 4 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
			ОписаниеОшибки = "ФН1 (" + Строка(Выборка.Раздел11_ФН1) + ") <> ФН1 расч. (" + Строка(Выборка.ФН1Расчетный)+")";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе
			//	ОбластьСтрока.Область(1, 4 + КолДопКолонок, 2, 4 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
		КонецЕсли;
		
		Если Выборка.Раздел11_ФН2 <> Выборка.ФН2Расчетный Тогда 
			ОписаниеУсловия = "ФН2 не свпадает с расчетным";	
			ОбластьСтрока.Область(1, 5 + КолДопКолонок, 2, 5 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;     			
			ОписаниеОшибки = "ФН2 (" + Строка(Выборка.Раздел11_ФН2) + ") <> ФН2 расч. (" + Строка(Выборка.ФН2Расчетный)+")";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе
			//	ОбластьСтрока.Область(1, 5 + КолДопКолонок, 2, 5 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
		КонецЕсли;
		
		Если Выборка.Раздел11_ФН3 <> Выборка.ФН3Расчетный Тогда 
			ОписаниеУсловия = "ФН3 не свпадает с расчетным";	
			ОбластьСтрока.Область(1, 6 + КолДопКолонок, 2, 6 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;     			
			ОписаниеОшибки = "ФН3 (" + Строка(Выборка.Раздел11_ФН3) + ") <> ФН3 расч. (" + Строка(Выборка.ФН3Расчетный)+")";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе
			//	ОбластьСтрока.Область(1, 6 + КолДопКолонок, 2, 6 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
		КонецЕсли;
		
		Если Выборка.Раздел11_ФН4 <> Выборка.ФН4Расчетный Тогда 
			ОписаниеУсловия = "ФН4 не свпадает с расчетным";	
			ОбластьСтрока.Область(1, 7 + КолДопКолонок, 2, 7 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;     			
			ОписаниеОшибки = "ФН4 (" + Строка(Выборка.Раздел11_ФН4) + ") <> ФН4 расч. (" + Строка(Выборка.ФН4Расчетный)+")";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе
			//	ОбластьСтрока.Область(1, 7 + КолДопКолонок, 2, 7 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
		КонецЕсли;
		
		Если Выборка.Раздел11_ФН5 <> Выборка.ФН5Расчетный Тогда 
			ОписаниеУсловия = "ФН5 не свпадает с расчетным";	
			ОбластьСтрока.Область(1, 8 + КолДопКолонок, 2, 8 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;     			
			ОписаниеОшибки = "ФН5 (" + Строка(Выборка.Раздел11_ФН5) + ") <> ФН5 расч. (" + Строка(Выборка.ФН5Расчетный)+")";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе
			//	ОбластьСтрока.Область(1, 8 + КолДопКолонок, 2, 8 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
		КонецЕсли;
		
		Если Выборка.Раздел11_ФН6 <> Выборка.ФН6Расчетный Тогда 
			ОписаниеУсловия = "ФН6 не свпадает с расчетным";	
			ОбластьСтрока.Область(1, 9 + КолДопКолонок, 2, 9 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;     			
			ОписаниеОшибки = "ФН6 (" + Строка(Выборка.Раздел11_ФН6) + ") <> ФН6 расч. (" + Строка(Выборка.ФН6Расчетный)+")";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе
			//	ОбластьСтрока.Область(1, 9 + КолДопКолонок, 2, 9 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
		КонецЕсли;
		
		Если Выборка.Раздел11_ФН7 <> Выборка.ФН7Расчетный Тогда 
			ОписаниеУсловия = "ФН7 не свпадает с расчетным";	
			ОбластьСтрока.Область(1, 10 + КолДопКолонок, 2, 10 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;     			
			ОписаниеОшибки = "ФН7 (" + Строка(Выборка.Раздел11_ФН7) + ") <> ФН7 расч. (" + Строка(Выборка.ФН7Расчетный)+")";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе
			//	ОбластьСтрока.Область(1, 10 + КолДопКолонок, 2, 10 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
		КонецЕсли;
		
		Если Выборка.Раздел11_ФН8 <> Выборка.ФН8Расчетный Тогда 
			ОписаниеУсловия = "ФН8 не свпадает с расчетным";	
			ОбластьСтрока.Область(1, 11 + КолДопКолонок, 2, 11 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;     			
			ОписаниеОшибки = "ФН8 (" + Строка(Выборка.Раздел11_ФН8) + ") <> ФН8 расч. (" + Строка(Выборка.ФН8Расчетный)+")";
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе
			//	ОбластьСтрока.Область(1, 11 + КолДопКолонок, 2, 11 + КолДопКолонок).ЦветФона = ЦветФонаСтроки;
		КонецЕсли;
		
		// сравниваем расчетные с показателями по нормативам
		
		
		
		Если Выборка.Раздел4_11 <= 100 Тогда
			ФН1ПредельноеЗначение = 2;			
			ФН2ПредельноеЗначение = 50;
			ФН3ПредельноеЗначение = 50;
			
			ФН6ПредельноеЗначение = 25;
			
		ИначеЕсли Выборка.Раздел4_11 <= 200 Тогда
			ФН1ПредельноеЗначение = 4;
			ФН2ПредельноеЗначение = 25;
			ФН3ПредельноеЗначение = 20;
			
			ФН6ПредельноеЗначение = 15;
			
			
		ИначеЕсли Выборка.Раздел4_11 <= 3000 Тогда
			ФН1ПредельноеЗначение = 5;
			ФН2ПредельноеЗначение = 20;
			ФН3ПредельноеЗначение = 10;
			
			ФН6ПредельноеЗначение = 10;
			
		Иначе
			ФН1ПредельноеЗначение = 5;		
			ФН2ПредельноеЗначение = 15;
			ФН3ПредельноеЗначение = 7;
			
			ФН6ПредельноеЗначение = 25;			
			
		КонецЕсли;
		
		ФН4ПредельноеЗначение = 6;
		ФН5ПредельноеЗначение = 50;
		
		ФН7ПредельноеЗначение = 70;
		ФН8ПредельноеЗначение = 75;
		
		ОписаниеУловие = "";
		
		
		Если Выборка.ФН1Расчетный < ФН1ПредельноеЗначение Тогда
			ОписаниеУсловия = "Значение ФН1 (расчетное) меньше передельного значения";
			ОбластьСтрока.Область(2, 4 + КолДопКолонок, 2, 4 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
			ОписаниеОшибки = "Значение ФН1 (расчетное) = " + Строка(Выборка.ФН1Расчетный) + " меньше предельного значения " + Строка(ФН1ПредельноеЗначение);			
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
		КонецЕсли;	
		
		// проверяем ФН2 по условию в шапке
		Если Выборка.Раздел2_3_1 + Выборка.Раздел2_3_2 > 0 И Выборка.ФН2Расчетный = 0 Тогда
			ОписаниеУсловия = "";   
			ОбластьСтрока.Область(2, 5 + КолДопКолонок, 2, 5 + КолДопКолонок).ЦветТекста = WebЦвета.Красный;			
			ОписаниеОшибки = "Значение ФН2 (расчетное) = 0, но 3.1 + 3.2 = " + Строка(Выборка.Раздел2_3_1 + Выборка.Раздел2_3_2);			
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		
		КонецЕсли;
		
		
		Если Выборка.ФН2Расчетный > ФН2ПредельноеЗначение Тогда
			ОписаниеУсловия = "Значение ФН2 (расчетное) больше передельного значения";
			ОбластьСтрока.Область(2, 5 + КолДопКолонок, 2, 5 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
			ОписаниеОшибки = "Значение ФН2 (расчетное) = " + Строка(Выборка.ФН2Расчетный) + " больше предельного значения " + Строка(ФН2ПредельноеЗначение);			
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
		КонецЕсли;			
		
		// проверяем Фн3 по условию в шапке
		Если Выборка.Раздел2_1_1 + Выборка.Раздел2_1_2 > 0 И Выборка.ФН3Расчетный = 0 Тогда
			ОписаниеУсловия = "";
			ОбластьСтрока.Область(2, 6 + КолДопКолонок, 2, 6 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
			ОписаниеОшибки = "Значение ФН3 (расчетное) = 0, но 1.1 + 1.2 = " + Строка(Выборка.Раздел2_1_1 + Выборка.Раздел2_1_2);			
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    								
		КонецЕсли;
		
		Если Выборка.ФН3Расчетный > ФН3ПредельноеЗначение Тогда
			ОписаниеУсловия = "Значение ФН3 (расчетное) больше передельного значения";      
			
			ОбластьСтрока.Область(2, 6 + КолДопКолонок, 2, 6 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
			ОписаниеОшибки = "Значение ФН3 (расчетное) = " + Строка(Выборка.ФН3Расчетный) + " больше предельного значения " + Строка(ФН3ПредельноеЗначение);			
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе	
			//	ОбластьСтрока.Область(1, 6, 1, 6).ЦветФона =ЦветФонаСтроки;     
		КонецЕсли;	
		
		Если Выборка.ФН4Расчетный < ФН4ПредельноеЗначение Тогда	
			ОписаниеУсловия = "Значение ФН4 (расчетное) меньше передельного значения";
			
			ОбластьСтрока.Область(2, 7 + КолДопКолонок, 2, 7 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
			ОписаниеОшибки = "Значение ФН4 (расчетное) = " + Строка(Выборка.ФН4Расчетный) + " меньше предельного значения " + Строка(ФН4ПредельноеЗначение);			
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе	
			//	ОбластьСтрока.Область(1, 7, 1, 7).ЦветФона =ЦветФонаСтроки;   
		КонецЕсли;	
		
		Если Выборка.ФН5Расчетный > ФН5ПредельноеЗначение Тогда		
			ОписаниеУсловия = "Значение ФН5 (расчетное) больше передельного значения";
			
			ОбластьСтрока.Область(2, 8 + КолДопКолонок, 2, 8 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
			ОписаниеОшибки = "Значение ФН5 (расчетное) = " + Строка(Выборка.ФН5Расчетный) + " больше предельного значения " + Строка(ФН5ПредельноеЗначение);			
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе	
			//	ОбластьСтрока.Область(1, 8, 1, 8).ЦветФона =ЦветФонаСтроки;  
		КонецЕсли;	
		
		Если Выборка.ФН6Расчетный > ФН6ПредельноеЗначение Тогда 
			ОписаниеУсловия = "Значение ФН6 (расчетное) больше передельного значения";
			
			ОбластьСтрока.Область(2, 9 + КолДопКолонок, 2, 9 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
			ОписаниеОшибки = "Значение ФН6 (расчетное) = " + Строка(Выборка.ФН6Расчетный) + " больше предельного значения " + Строка(ФН6ПредельноеЗначение);			
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе	
			//	ОбластьСтрока.Область(1, 9, 1, 9).ЦветФона =ЦветФонаСтроки;   
		КонецЕсли;	 		
		
		Если Выборка.ФН7Расчетный < ФН7ПредельноеЗначение Тогда	
			ОписаниеУсловия = "Значение ФН7 (расчетное) меньше передельного значения";
			
			ОбластьСтрока.Область(2, 10 + КолДопКолонок, 2, 10 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;			
			ОписаниеОшибки = "Значение ФН7 (расчетное) = " + Строка(Выборка.ФН7Расчетный) + " меньше предельного значения " + Строка(ФН7ПредельноеЗначение);			
			ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки);		    					
			//Иначе	
			//	ОбластьСтрока.Область(1, 10, 1, 10).ЦветФона =ЦветФонаСтроки;   
		КонецЕсли;	
		
		
		Если Выборка.ФН8Расчетный < ФН8ПредельноеЗначение Тогда	
			ОписаниеУсловия = "Значение ФН8 (расчетное) меньше передельного значения";
			
			ОбластьСтрока.Область(2, 11 + КолДопКолонок, 2, 11 + КолДопКолонок).ЦветФона = Цвет_ОшибкаВПоказателях;		
			ОписаниеОшибки = "Значение ФН8 (расчетное) = " + Строка(Выборка.ФН8Расчетный) + " меньше предельного значения " + Строка(ФН8ПредельноеЗначение);			
			//ДобавитьОшибкуВТаблицу(НомерСтроки, Выборка.КПК, ОписаниеОшибки);  			
		Иначе	
			ОбластьСтрока.Область(2, 11, 2, 11).ЦветФона =ЦветФонаСтроки;
		КонецЕсли;	
		
		
		РезультатНормативы.Вывести(ОбластьСтрока);  
		
	КонецЦикла;
	
	
	ЭтотОбъект.РезультатНормативы.ФиксацияСверху = 9;
	ЭтотОбъект.РезультатНормативы.ФиксацияСлева = 3; 
	
	
	Отчет.ТаблицаОшибок.Сортировать("НомерВРеестреСРО, ПорядокСортировки");	
	
КонецПроцедуры


//&НаСервере
Процедура ПроверкаНаОшибку(КПК, НазваниеТаблицы, НомерСтроки, ЗначениеЛевое, ЗначениеПравое, ЗнакСравнения, ОписаниеУсловия, ОписаниеОшибки, ОписаниеОшибкиГрафа, КоличествоОшибокПоГрафе, СтрокаРазделитель, КодОшибки = "")
	
	Разница = ЗначениеЛевое - ЗначениеПравое;
	Если ?(Разница > 0, Разница, -Разница) > 1 Тогда		
		Если ОписаниеОшибки = "" Тогда
			ОписаниеОшибки = Строка(ЗначениеЛевое) + " " + ЗнакСравнения + " " + Строка(ЗначениеПравое);
		КонецЕсли;
		
		ОписаниеОшибкиГрафа = ОписаниеОшибкиГрафа + ?(ОписаниеОшибкиГрафа="", "", СтрокаРазделитель) + ОписаниеУсловия + "  |  " + ОписаниеОшибки;  
		ДобавитьОшибкуВТаблицу(НомерСтроки, КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, КодОшибки);         			
		
		КоличествоОшибокПоГрафе = КоличествоОшибокПоГрафе + 1; 
	Иначе
		ОписаниеОшибки = "";
	КонецЕсли; 
	//	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьТаблицыОшибок()
	ТабличныйДокумент = Новый ТабличныйДокумент; 	
	
	// Инициализируем таблицу для последующей обработки
	МассивДеревоКПК = Новый Массив;
	
	ПоказатьТаблицуОшибок(ТабличныйДокумент,, МассивДеревоКПК);
	
	ПараметрыДляПередачи = Новый Структура;
	ПараметрыДляПередачи.Вставить("ТабличныйДокумент", ТабличныйДокумент);
	ПараметрыДляПередачи.Вставить("МассивДеревоКПК", МассивДеревоКПК);
	
	//ФормаОшибок = ПолучитьФорму("ВнешнийОтчет.ПроверкаОтчетностиСРассылкойПисем.Форма.ФормаОписанияОшибок", ПараметрыДляПередачи, ЭтаФорма);
	ФормаОшибок = ПолучитьФорму("Отчет.СРО_ПроверкаОтчетностиСРассылкойПисем.Форма.ФормаОписанияОшибок", ПараметрыДляПередачи, ЭтаФорма);
	ФормаОшибок.Открыть();
	
	
КонецПроцедуры


&НаСервере
Процедура ДобавитьОшибкуВТаблицу(НомерСтроки, КПК, НазваниеТаблицы, ОписаниеУсловия, ОписаниеОшибки, КодОшибки = "")
	
	НоваяСтрока = Отчет.ТаблицаОшибок.Добавить();
	НоваяСтрока.НомерСтроки = НомерСтроки;
	НоваяСтрока.НомерВРеестреСРО = КПК.НомерВРеестреСРО;  
	НоваяСтрока.КПК = КПК;
	НоваяСтрока.НазваниеТаблицы = НазваниеТаблицы;
	НоваяСтрока.ОписаниеУсловия = ОписаниеУсловия;
	НоваяСтрока.ОписаниеОшибки = ОписаниеОшибки; 
	НоваяСтрока.КоличествоОшибок = 1;
	НоваяСтрока.ПорядокСортировки = Отчет.ТаблицаОшибок.Количество();
	НоваяСтрока.КодОшибки = КодОшибки;
	
КонецПроцедуры


&НаСервере
Процедура ВывестиТаблицы(СтруктураПараметров, СтруктураТабличныхДокументов)
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ВремТаблицаОшибок = ОтчетОбъект.ТаблицаОшибок;

	Если СтруктураТабличныхДокументов.Свойство("РезультатНадзорныеСоотношения") Тогда
		РезультатНадзорныеСоотношения = СтруктураТабличныхДокументов.РезультатНадзорныеСоотношения;
	КонецЕсли;
	
	Если СтруктураТабличныхДокументов.Свойство("РезультатНадзорныеСоотношения") Тогда
		РезультатКС = СтруктураТабличныхДокументов.РезультатКС;
	КонецЕсли;   	
	
	//	Если СтруктураТабличныхДокументов.Свойство("СтруктураТаблицФН") Тогда
	Если СтруктураТабличныхДокументов.Свойство("ТабДокФН1") Тогда
		РезультатФН1 = СтруктураТабличныхДокументов.ТабДокФН1;
	КонецЕсли;		
	
	Если СтруктураТабличныхДокументов.Свойство("ТабДокФН2") Тогда
		РезультатФН2 = СтруктураТабличныхДокументов.ТабДокФН2;
	КонецЕсли;		
	
	Если СтруктураТабличныхДокументов.Свойство("ТабДокФН3") Тогда
		РезультатФН3 = СтруктураТабличныхДокументов.ТабДокФН3;
	КонецЕсли;		
	
	Если СтруктураТабличныхДокументов.Свойство("ТабДокФН4") Тогда
		РезультатФН4 = СтруктураТабличныхДокументов.ТабДокФН4;
	КонецЕсли;		
	
	Если СтруктураТабличныхДокументов.Свойство("ТабДокФН5") Тогда
		РезультатФН5 = СтруктураТабличныхДокументов.ТабДокФН5;
	КонецЕсли;		
	
	Если СтруктураТабличныхДокументов.Свойство("ТаблицаФН6") Тогда
		РезультатФН6 = СтруктураТабличныхДокументов.ТаблицаФН6;
	КонецЕсли;		
	
	Если СтруктураТабличныхДокументов.Свойство("ТабДокФН7") Тогда
		РезультатФН7 = СтруктураТабличныхДокументов.ТабДокФН7;
	КонецЕсли;		
	
	Если СтруктураТабличныхДокументов.Свойство("ТабДокФН8") Тогда
		РезультатФН8 = СтруктураТабличныхДокументов.ТабДокФН8;
	КонецЕсли;	
	
	Если СтруктураТабличныхДокументов.Свойство("ТабДокФН_Расшифровка") Тогда
		РезультатФН_Расшифровка = СтруктураТабличныхДокументов.ТабДокФН_Расшифровка;
	КонецЕсли;	 	
	
	РезультатФН1.ФиксацияСверху = 2;
	РезультатФН2.ФиксацияСверху = 2;
	РезультатФН3.ФиксацияСверху = 2;
	РезультатФН4.ФиксацияСверху = 2;
	РезультатФН5.ФиксацияСверху = 2;
	РезультатФН6.ФиксацияСверху = 2;
	РезультатФН7.ФиксацияСверху = 2;
	РезультатФН8.ФиксацияСверху = 2;
	//	КонецЕсли; 	
	
	
	Если ВидОтчета = 0 Тогда		
		КолДопКолонок = 0;
	Иначе
		КолДопКолонок = 1;
	КонецЕсли;   	
	
	РезультатНадзорныеСоотношения.ФиксацияСверху = 4;
	РезультатНадзорныеСоотношения.ФиксацияСлева = 4 + КолДопКолонок; 
	
	РезультатКС = СтруктураТабличныхДокументов.РезультатКС;
	РезультатНормативы = СтруктураТабличныхДокументов.РезультатНормативы; 	 	
	
	ЗначениеВРеквизитФормы(ОтчетОбъект, "Отчет");
	
КонецПроцедуры

&НаСервере 
Процедура СформироватьНаСервере(ТабличныйДокумент)
	
	Отчет.ТаблицаОшибок.Очистить(); 
	
	РезультатНадзорныеСоотношения.Очистить();
	РезультатКС.Очистить();
	РезультатНормативы.Очистить();
	
	
	НеВыводим_ОКУД0420820 = Ложь;
	
	Если НачалоГода(ПериодОтчета.ДатаОкончания) = НачалоКвартала(ПериодОтчета.ДатаОкончания) Тогда		
		// 1 квартала не выводим эту ппроверку
		НеВыводим_ОКУД0420820 = Истина;
	КонецЕсли;	
	
	МассивКПК = Новый Массив;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МассивКПК", ?(ВидОтчета = 0, МассивКПК, СписокКПК.ВыгрузитьЗначения()));
	СтруктураПараметров.Вставить("ДатаНачалаОтчета", ПериодОтчета.ДатаНачала);
	СтруктураПараметров.Вставить("ДатаОкончанияОтчета", КонецКвартала(ПериодОтчета.ДатаОкончания)); 	
	СтруктураПараметров.Вставить("ОтчетностьСРО", Отчет.ОтчетностьСРО); 	
	СтруктураПараметров.Вставить("ПредварительнаяПроверка", Отчет.ПредварительнаяПроверка); 
	СтруктураПараметров.Вставить("ВидОтчета", ВидОтчета); 
	СтруктураПараметров.Вставить("ВыводитьТолькоКПКСОтчетностью", ВыводитьТолькоКПКСОтчетностью);     	
	СтруктураПараметров.Вставить("ТаблицаОшибок", Отчет.ТаблицаОшибок.Выгрузить());  	
	СтруктураПараметров.Вставить("ОтчетВЦБ", ОтчетВЦБ); 
	СтруктураПараметров.Вставить("ФормированиеОтчетаПользователю", Ложь); 
	
	СтруктураПараметров.Вставить("ТипОтчета",Перечисления.ТипыОчетаПроверки.ПоРазделам);			
//	СтруктураПараметров.Вставить("ВидОтчета", ВидОтчета);  	
	
	ВремСтруктураТабличныхДокументов = Отчеты.СРО_ПроверкаОтчетностиСРассылкойПисем.СформироватьТабличныеДокументы(СТруктураПараметров);

	Если ТипЗнч(ВремСтруктураТабличныхДокументов) = Тип("Структура") Тогда
		
		СтруктураТабличныхДокументов = ВремСтруктураТабличныхДокументов;      		
		ВывестиТаблицы(СтруктураТабличныхДокументов, СтруктураТабличныхДокументов);       		
		
	ИначеЕсли ТипЗнч(ВремСтруктураТабличныхДокументов) = Тип("Массив") Тогда
		
		СтруктураТабличныхДокументов = ВремСтруктураТабличныхДокументов[0];
		ВывестиТаблицы(СтруктураТабличныхДокументов, СтруктураТабличныхДокументов);
		
	КонецЕсли; 	
	
КонецПроцедуры


&НаКлиенте
Процедура Сформировать(Команда) 
	
	ТабличныйДокумент = Новый ТабличныйДокумент; 	                                                 	
	СформироватьНаСервере(ТабличныйДокумент);
	
	
	//	ТабличныйДокумент.Показать("Проверка отчетности");
	
	//	ТабДокОшибки.Показать(); 	
	
КонецПроцедуры


&НаКлиенте
процедура ОбновитьПредставлениеПериода()
	
	Если ВидОтчета = 0 Тогда
		//НачалоПериода = НачалоКвартала(ДатаОкончанияОтчетногоПериода);
		//ОкончаниеПериода = КонецКвартала(ДатаОкончанияОтчетногоПериода); 	
		Элементы.ДекорацияПериод.Заголовок =	ПредставлениеПериода(ПериодОтчета.ДатаНачала, ПериодОтчета.ДатаОкончания);
		
	КонецЕсли;
	
	Элементы.УменьшитьПериод.Видимость = ВидОтчета = 0;
	Элементы.УвеличитьПериод.Видимость = ВидОтчета = 0;
	Элементы.ДекорацияПериод.Видимость = ВидОтчета = 0;
	Элементы.ВыводитьТолькоКПКСОтчетностью.Видимость = ВидОтчета = 0;
	
	
	Элементы.ПериодОтчета.Видимость = ВидОтчета <> 0;
	Элементы.СписокКПК.Видимость = ВидОтчета <> 0; 	
		
	ВидКодовТриггеров = 0;
	
	Если НачалоДня(ПериодОтчета.ДатаОкончания) >= Дата(2021,4, 1) Тогда
		ВидКодовТриггеров = 1;
	КонецЕсли; 	

	Если НачалоДня(ПериодОтчета.ДатаНачала) >= Дата(2021,10, 1) Тогда
		ОтборПоКодуДокумента = 2;

	ИначеЕсли НачалоДня(ПериодОтчета.ДатаНачала) >= Дата(2020,4, 1) Тогда
		ОтборПоКодуДокумента = 1;
		
		//Если НачалоДня(ПериодОтчета.ДатаОкончания) >= Дата(2021,4, 1) Тогда
		//	ВидКодовТриггеров = 1;
		//КонецЕсли; 		
	Иначе	
		ОтборПоКодуДокумента = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииОтчетногоПериода(Режим)
	
	Знак = ?(Режим = "Увеличить", 1, -1);   	
	
	//Если ВидОтчета = 0 Тогда
	КоличествоМесяцев = 3;		
	ДатаОкончанияОтчетногоПериода =  НачалоДня(КонецКвартала(ДобавитьМесяц(ДатаОкончанияОтчетногоПериода, КоличествоМесяцев * Знак)));	
	ПериодОтчета.ДатаНачала = НачалоКвартала(ДатаОкончанияОтчетногоПериода);
	ПериодОтчета.ДатаОкончания = КонецКвартала(ДатаОкончанияОтчетногоПериода);
	
	//	
	//Иначе
	//	КоличествоМесяцев = 12;
	//	ДатаОкончанияОтчетногоПериода =  ДобавитьМесяц(ДатаОкончанияОтчетногоПериода, КоличествоМесяцев * Знак);			
	//	НачалоПериода = НачалоГода(ДатаОкончанияОтчетногоПериода);
	//	ОкончаниеПериода = КонецГода(ДатаОкончанияОтчетногоПериода);
	//	
	//КонецЕсли;
	
	ОбновитьПредставлениеПериода();	 
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьПериод(Команда)
	ПриИзмененииОтчетногоПериода("Уменьшить");
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьПериод(Команда)
	ПриИзмененииОтчетногоПериода("Увеличить");
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(ДатаОкончанияОтчетногоПериода) Тогда
		ДатаОкончанияОтчетногоПериода =  КонецКвартала(ДобавитьМесяц(ТекущаяДата(), -3));
	КонецЕсли;
	
	ОбновитьПредставлениеПериода();
	
	Если ВидОтбора_КПК_УправлениеГУ = "" Тогда
		ВидОтбора_КПК_УправлениеГУ = "КПК";		
	КонецЕсли;
	
	ВидОтбора_КПК_УправлениеГУПриИзменении("");
	
КонецПроцедуры


&НаКлиенте
Процедура ВидОтчетаПриИзменении(Элемент)
	ОбновитьПредставлениеПериода(); 
	
	ВидОтбора_КПК_УправлениеГУПриИзменении("");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультатТаблицыОшибокСОтборами(КПК, НаименованиеТаблицы) 	
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаОшибок.КПК КАК КПК,
	|	ТаблицаОшибок.НазваниеТаблицы КАК НазваниеТаблицы,
	|	ТаблицаОшибок.ОписаниеОшибки КАК ОписаниеОшибки,
	|	ТаблицаОшибок.ОписаниеУсловия КАК ОписаниеУсловия,
	|	ТаблицаОшибок.НомерСтроки КАК НомерСтроки,
	|	ТаблицаОшибок.КоличествоОшибок КАК КоличествоОшибок,
	|	ТаблицаОшибок.КодОшибки КАК КодОшибки,   
	|	ТаблицаОшибок.ПорядокСортировки КАК ПорядокСортировки
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТаблицаОшибок КАК ТаблицаОшибок
	|ГДЕ
	|	Истина
	|	#УсловияОтбора#
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.КПК КАК КПК,
	|	ВТ.НазваниеТаблицы КАК НазваниеТаблицы,
	|	ВТ.ОписаниеОшибки КАК ОписаниеОшибки,
	|	ВТ.ОписаниеУсловия КАК ОписаниеУсловия,
	|	ВТ.НомерСтроки КАК НомерСтроки,
	|	СУММА(ВТ.КоличествоОшибок) КАК КоличествоОшибок,
	|	ВТ.КодОшибки КАК КодОшибки,
	|	ВТ.ПорядокСортировки КАК ПорядокСортировки
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.КПК,
	|	ВТ.НазваниеТаблицы,
	|	ВТ.ОписаниеОшибки,
	|	ВТ.ОписаниеУсловия,
	|	ВТ.НомерСтроки,
	|	ВТ.КодОшибки,
	|	ВТ.ПорядокСортировки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	ПорядокСортировки
	|ИТОГИ
	|	СУММА(КоличествоОшибок)
	|ПО
	|	КПК,
	|	НазваниеТаблицы";  	
	
	
	Запрос.УстановитьПараметр("ТаблицаОшибок", Отчет.ТаблицаОшибок.Выгрузить());
	
	УсловияОтбора = "";       
	Если КПК <> Неопределено Тогда
		УсловияОтбора = УсловияОтбора + " И ТаблицаОшибок.КПК = &КПК";
		Запрос.УстановитьПараметр("КПК", КПК);
	КонецЕсли;
	
	Если НаименованиеТаблицы <> Неопределено Тогда
		УсловияОтбора = УсловияОтбора + " И ТаблицаОшибок.НазваниеТаблицы = &НазваниеТаблицы";		
		Запрос.УстановитьПараметр("НазваниеТаблицы", НаименованиеТаблицы);
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#УсловияОтбора#", УсловияОтбора); 
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатЗапроса; 	
	
КонецФункции


&НаСервере
Процедура ПоказатьТаблицуОшибок(ТабличныйДокумент, ПараметрыОтчета = Неопределено, МассивДеревоКПК = Неопределено)
	
	Если ПараметрыОтчета = Неопределено Тогда
		КПК = Неопределено;
		НаименованиеТаблицы = Неопределено;
	Иначе
		КПК = ПараметрыОтчета.ДокументОтчетности.КПК;
		НаименованиеТаблицы = ПараметрыОтчета.НаименованиеТаблицы;
	КонецЕсли;
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	Макет = ОтчетОбъект.ПолучитьМакет("РасшифровкаОшибков");
	
	Если ВидОтчета = 0 Тогда
		НачалоПериода = НачалоКвартала(ДатаОкончанияОтчетногоПериода);
		ОкончаниеПериода = КонецКвартала(ДатаОкончанияОтчетногоПериода);
	Иначе
		НачалоПериода = НачалоГода(ДатаОкончанияОтчетногоПериода);
		ОкончаниеПериода = КонецГода(ДатаОкончанияОтчетногоПериода);
	КонецЕсли;
	
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьКПК = Макет.ПолучитьОбласть("КПК");
	ОбластьНазваниеТаблицы = Макет.ПолучитьОбласть("НазваниеТаблицы");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	//Если СтруктураДеревоКПК <> Неопределено Тогда	
	//	СтруктураДеревоКПК = Новый ДеревоЗначений;
	//	СтруктураДеревоКПК.Колонки.Добавить("КПК");
	//	СтруктураДеревоКПК.Колонки.Добавить("Раздел"); 	
	//КонецЕсли;
	
	
	ОбластьШапка.Параметры.ПредставлениеПериода =  ПредставлениеПериода(НачалоПериода, ОкончаниеПериода);
	
	ОбластьШапка.Параметры.ОтборПоКПК = ?(ЗначениеЗаполнено(КПК), "Отбор по " + СокрЛП(КПК.Наименование), "Без отбора по КПК");	       
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	// Выводим результаты запроса
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
	
	РезультатЗапроса =  ПолучитьРезультатТаблицыОшибокСОтборами(КПК, НаименованиеТаблицы); 
	
	Если РезультатЗапроса <> Неопределено Тогда       		
		
		// По КПК    	
		ВыборкаПоКПК = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоКПК.Следующий() Цикл               		
			ОбластьКПК.Параметры.НомерСтроки	    = ВыборкаПоКПК.НомерСтроки;
			ОбластьКПК.Параметры.НомерВРеестреСРО   = ВыборкаПоКПК.КПК.НомерВРеестреСРО;   				
			ОбластьКПК.Параметры.КраткоеНазваниеКПК = СокрЛП(ВыборкаПоКПК.КПК.НаименованиеКраткое);	
			ОбластьКПК.Параметры.КоличествоОшибок = СокрЛП(ВыборкаПоКПК.КоличествоОшибок);	
			ТабличныйДокумент.Вывести(ОбластьКПК, 1);
			
			ВыборкаПоТаблицам = ВыборкаПоКПК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			// Дерево  
			
			
			МассивРазделовОшибок = Новый Массив;
			Пока ВыборкаПоТаблицам.Следующий() Цикл
				НазваниеТаблицы = СокрЛП(ВыборкаПоТаблицам.НазваниеТаблицы);
				
				ОбластьНазваниеТаблицы.Параметры.НазваниеТаблицы = НазваниеТаблицы;	
				ОбластьНазваниеТаблицы.Параметры.КоличествоОшибок = СокрЛП(ВыборкаПоТаблицам.КоличествоОшибок);	
				ТабличныйДокумент.Вывести(ОбластьНазваниеТаблицы, 2); 
				
				// Дерево  
				Если МассивДеревоКПК <> Неопределено Тогда
					МассивРазделовОшибок.Добавить(НазваниеТаблицы);
					
					//СтрокаДереваРаздел = СтрокаДереваКПК.Строки.Добавить();
					//СтрокаДереваРаздел.Раздел = СокрЛП(ВыборкаПоТаблицам.НазваниеТаблицы); 			
				КонецЕсли;
				
				Выборка =  ВыборкаПоТаблицам.Выбрать();
				
				Пока Выборка.Следующий() Цикл 			
					ОбластьСтрока.Параметры.ОписаниеУсловия	   = Выборка.ОписаниеУсловия;
					ОбластьСтрока.Параметры.ОписаниеОшибки     = Выборка.ОписаниеОшибки; 
					ОбластьСтрока.Параметры.КодОшибки     = Выборка.КодОшибки; 
					
					ТабличныйДокумент.Вывести(ОбластьСтрока, 3);
				Конеццикла;
			КонецЦикла;
			
			// Дерево 			
			Если МассивРазделовОшибок.Количество() > 0 Тогда
				
				МассивДанныхКПКРазделы = Новый Структура;
				МассивДанныхКПКРазделы.Вставить("КПК", ВыборкаПоКПК.КПК);
				МассивДанныхКПКРазделы.Вставить("МассивРазделовОшибок", МассивРазделовОшибок);
				
				МассивДеревоКПК.Добавить(МассивДанныхКПКРазделы);
			КонецЕсли;
			
			
		КонецЦикла;
	КонецЕсли;
	
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();  		
	
КонецПроцедуры


&НаСервере
Функция ПолучитьКПКДокумента(ВыбДокумент)
	Если ТипЗнч(ВыбДокумент) = Тип("ДокументСсылка.ОтчетностьКПК") 
		ИЛИ ТипЗнч(ВыбДокумент) = Тип("ДокументОбъект.ОтчетностьКПК") Тогда
		Возврат ВыбДокумент.КПК;
	Иначе
		Возврат Неопределено;		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура РезультатНадзорныеСоотношенияОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	//СтандартнаяОбработка = Ложь;
	//
	//Если ТипЗнч(Расшифровка) = Тип("Строка") Тогда
	//	ПоказатьОповещениеПользователя(Расшифровка);
	//Иначе
	
	Если ТипЗнч(Расшифровка) = Тип("ДокументСсылка.ОтчетностьКПК") Тогда
		СтандартнаяОбработка = Ложь;
		
		КПК = ПолучитьКПКДокумента(Расшифровка);   
		ОбработкаРасшифровки("НадзорныеСоотношения", КПК, Расшифровка);
	КонецЕсли;  	
	
	
КонецПроцедуры


&НаКлиенте
Процедура РезультатНормативыОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	
	
	Если ТипЗнч(Расшифровка) = Тип("ДокументСсылка.ОтчетностьКПК") Тогда
		СтандартнаяОбработка = Ложь;
		ОбработкаРасшифровки("Нормативы", Расшифровка);
	КонецЕсли;  	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРасшифровки(НаименованиеТаблицы, КПК, ДокументОтчетности=Неопределено)
	СписокДействий = Новый СписокЗначений;
	СписокДействий.Добавить("ОткрытьСправочник", "Открыть справочник КПК");
	СписокДействий.Добавить("ОткрытьДокументОтчетности", "Открыть документ отчетности");
	СписокДействий.Добавить(НаименованиеТаблицы, "Ошибки """+НаименованиеТаблицы+"""");
	
	ДополнительныеПараметры = Новый Структура("КПК, ДокументОтчетности, НаименованиеТаблицы", КПК, ДокументОтчетности, НаименованиеТаблицы);
	
	ОповещениеПослеВыбораДействиярасшифровки = Новый ОписаниеОповещения("ПослеВыбораДействияРасшифровки", ЭтаФорма, ДополнительныеПараметры);		
	СписокДействий.ПоказатьВыборЭлемента(ОповещениеПослеВыбораДействиярасшифровки, "", СписокДействий[0]);
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДействияРасшифровки(Элемент, Параметры) Экспорт
	
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.Значение = "ОткрытьСправочник" Тогда
		Пар = Новый Структура("Ключ", Параметры.КПК);
		ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаЭлемента", Пар);
	ИначеЕсли Элемент.Значение = "ОткрытьДокументОтчетности" Тогда
		Пар = Новый Структура("Ключ", Параметры.ДокументОтчетности);
		ОткрытьФорму("Документ.ОтчетностьКПК.Форма.ФормаДокумента", Пар);
		
	Иначе
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ПоказатьТаблицуОшибок(ТабличныйДокумент, Параметры);
		
		ТабличныйДокумент.Показать("Ошибки");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатКСОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("ДокументСсылка.ОтчетностьКПК") Тогда
		СтандартнаяОбработка = Ложь;
		
		ОбработкаРасшифровки("КС", Расшифровка);
	КонецЕсли;  	
	
	
КонецПроцедуры

//&НаСервере
//Процедура СводныйОтчетОРезультатахПроверкиНаСервере()
//	
//	СформироватьСводныйОтчетОрезультатахПроведенныхМероприятий(ТабличныйДокумент);
//КонецПроцедуры

&НаКлиенте
Процедура СводныйОтчетОРезультатахПроверки(Команда)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	СформироватьСводныйОтчетОрезультатахПроведенныхМероприятий(ТабличныйДокумент);
	
	ТабличныйДокумент.Показать("Сводный отчет о результатах проведенных контрольных мероприятий");
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьФайлыРассылкиВКПК(Команда)
	
	//	ВремТаблицаОшибок = ПолучитьТаблицуОшибокНаСервере(); 	
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТаблицаОшибок", Отчет.ТаблицаОшибок);
	ДопПараметры.Вставить("НачалоПериодаОтчета", ПериодОтчета.ДатаНачала);
	ДопПараметры.Вставить("ОкончаниеПериодаОтчета", КонецДня(ПериодОтчета.ДатаОкончания));
	
	//ТабличныйДокумент.Показать();
	//ОткрытьФорму("ВнешнийОтчет.ПроверкаОтчетностиСРассылкойПисем.Форма.ФормаДляРассылки", ДопПараметры, ЭтаФорма);   
	ОткрытьФорму("Отчет.СРО_ПроверкаОтчетностиСРассылкойПисем.Форма.ФормаДляРассылки", ДопПараметры, ЭтаФорма);      
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуОшибокНаСервере() 	
	
	ВремТЗ = Отчет.ТаблицаОшибок.Выгрузить();                                          				   
	
	ВремТЗ.Свернуть("КПК, НазваниеТаблицы, ОписаниеУсловия, НомерВРеестреСРО, КодОшибки", "КоличествоОшибок, ПорядокСортировки");
	
	ПорядокСортировки = 0;
	Для Каждого ТекСтрока ИЗ ВремТЗ Цикл
		
		ПорядокСортировки = ПорядокСортировки + 1;      		
		ТекСтрока.ПорядокСортировки = ПорядокСортировки;		
		
	КонецЦикла;
	
	Возврат ВремТЗ;	
	
КонецФункции

&НаКлиенте
Процедура ПериодОтчетаПриИзменении(Элемент)	
	ОбновитьПредставлениеПериода();
КонецПроцедуры

&НаКлиенте
Процедура ВидОтбора_КПК_УправлениеГУПриИзменении(Элемент)
	
	Если ВидОтчета = 0 Тогда
		Элементы.СписокУправленийГУ.Видимость = Ложь;		
		Элементы.СписокКПК.Видимость = Ложь;
		Элементы.ВидОтбора_КПК_УправлениеГУ.Видимость = Ложь;
	Иначе	
		Элементы.СписокУправленийГУ.Видимость = НЕ ВидОтбора_КПК_УправлениеГУ = "КПК";		
		Элементы.СписокКПК.Видимость = ВидОтбора_КПК_УправлениеГУ = "КПК";		
		Элементы.ВидОтбора_КПК_УправлениеГУ.Видимость = Истина;

	КонецЕсли;

КонецПроцедуры



//&НаКлиенте
//Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
//	// Вставить содержимое обработчика.
//КонецПроцедуры

