&НаСервере
Процедура ВывестиТаблицуПоказателей()   
	
	
	Если НЕ Объект.Ссылка.Пустая() Тогда   	
		ТабДокРаздел1.Очистить();
		// Выводим табличный документ Раздел 1	
		ТабДокРаздел1 = Документы.ОтчетОбОперацияхСДС.ВывестиРаздел(Объект.Ссылка ,"Раздел1"); 
		
		ТабДокРаздел2.Очистить();
		ТабДокРаздел2 = Документы.ОтчетОбОперацияхСДС.ВывестиРаздел(Объект.Ссылка ,"Раздел2");  
	КонецЕсли;
	
КонецПроцедуры					
					
&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	//Если ТекущаяСтраница.Имя = "ГруппаРаздел1" Тогда
	//	ВывестиТаблицуПоказателей("Раздел1", ТаблицаПоказателей);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)     			
	ВывестиТаблицуПоказателей() ;	
КонецПроцедуры
