
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ВремТаблицаДляРассылки = Параметры.ТаблицаДляРассылки;
	//
	//НомерПоПорядку = 0;
	//
	//Для Каждого ТекСтрока ИЗ ВремТаблицаДляРассылки Цикл
	//	НомерПоПорядку = НомерПоПорядку + 1;
	//	
	//	НоваяСтрока = ТаблицаДляРассылки.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	//	НоваяСтрока.НомерПоПорядку = НомерПоПорядку;
	//	
	//КонецЦикла;
	//
	//ВремТаблицаДляРассылкиКопия = РеквизитФормыВЗначение("ТаблицаДляРассылкиКопия");
	//
	//Для Каждого ТекСтрока из ТаблицаДляРассылки ЦИкл
	//	НоваяСтрока =  ВремТаблицаДляРассылкиКопия.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	//КонецЦикла;
	//
	//ЗначениеВРеквизитФормы(ВремТаблицаДляРассылкиКопия, "ТаблицаДляРассылкиКопия");


КонецПроцедуры

&НаСервере
Процедура ОтметитьПоТаблицеНаСервере()
	ИтогоОтмечено = 0;
	Для НомерСтроки = 1 по 10000 Цикл   		
		
		НомерВРеестреСРО = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(1,"ЧГ=")).Текст);
		КПКНаименование = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(2,"ЧГ=")).Текст);
		КПКИНН = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(3,"ЧГ=")).Текст);		
		КПКОГРН = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(4,"ЧГ=")).Текст);			
		
		Если КПКНаименование = "" И КПКИНН = "" И КПКОГРН = "" Тогда
			Прервать;
		КонецЕсли;

				
		КПК = Неопределено;
		
		СтруктураПоискаКПК = Новый Структура;
		СтруктураПоискаКПК.Вставить("КПКИНН", КПКИНН);
		СтруктураПоискаКПК.Вставить("КПКОГРН", КПКОГРН);
		СтруктураПоискаКПК.Вставить("НомерВРеестреСРО", НомерВРеестреСРО); 		
		
		НайденКПК  = СРО_ЗагрузкаОтчетности.НайтиКПК(СтруктураПоискаКПК, КПК);
		
		Если КПК = Неопределено Тогда                                                            			
			Сообщить("Не найден КПК " + КПКНаименование + " ИНН " + КПКИНН + " ОГРН " + КПКОГРН);
			Продолжить;			
		КонецЕсли;
		
		НайденныеСтроки = ТаблицаДляРассылки.НайтиСтроки(Новый Структура("КПК", КПК));		

		Если НайденныеСтроки.Количество() =0 Тогда 
			Сообщить(НомерВРеестреСРО + " " + КПКНаименование + " ИНН " + КПКИНН + " ОГРН " + КПКОГРН + " не найден в отчете");
			Продолжить;
		КонецЕсли;
		
		ИтогоОтмечено = ИтогоОтмечено + 1;
		НайденнаяСтрока = НайденныеСтроки[0];
		НайденнаяСтрока.Флаг = Истина;
		
	КонецЦикла;;
	
	Сообщить("Итого отмечено: " + Строка(ИтогоОтмечено));
		
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьПоТаблице(Команда)
	ОтметитьПоТаблицеНаСервере();
КонецПроцедуры

&НаСервере

Функция ПолучитьМассивОтмеченныхКПК()
	
	МассивКПК = Новый Массив;
	
	НайденныеСтроки = ТаблицаДляРассылки.НайтиСтроки(Новый Структура("Флаг", Истина));
	
	Для Каждого ТекСтрока Из НайденныеСтроки Цикл
		МассивКПК.Добавить(ТекСтрока.КПК);
	КонецЦикла;
	
	Возврат МассивКПК;
	
КонецФункции

&НаКлиенте
Процедура Завершить(Команда)
	
	МассивКПК = ПолучитьМассивОтмеченныхКПК();
	ОповеститьОВыборе(МассивКПК);
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультатЗапроса()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК КПК,
	|	Контрагенты.НомерВРеестреСРО КАК НомерВРеестреСРО
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ПометкаУдаления = ЛОЖЬ
	|	И Контрагенты.ДатаИсключенияИзСРО = &ПустаяДата
	|	И Контрагенты.ДатаВступленияВСРО <> &ПустаяДата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагенты.НомерВРеестреСРО";
	
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;	
	
КонецФункции


&НаСервере
Процедура ВыводитьВсеКПКПриИзмененииНаСервере()
	Если ВыводитьВсеКПК Тогда
		
		РезультатЗапроса = ПолучитьРезультатЗапроса();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ТаблицаДляРассылки.Очистить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			НомерПоПорядку = 0;
			
			ПОка Выборка.Следующий() Цикл
				
				НомерПоПорядку = НомерПоПорядку + 1;
				
				НоваяСтрока = ТаблицаДляРассылки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				НоваяСтрока.НомерПоПорядку = НомерПоПорядку;
				
			КонецЦикла;    			
			
			ВремТаблицаДляРассылки = РеквизитФормыВЗначение("ТаблицаДляРассылки");
			
			НайденныеСтроки = ТаблицаДляРассылкиКопия.НайтиСтроки(НОвый СТруктура("Флаг", Истина)); 
			
			Для Каждого НайденнаяСтрока ИЗ НайденныеСтроки Цикл
				НайденныеСтрокиРассылки = ВремТаблицаДляРассылки.НайтиСтроки(НОвый СТруктура("КПК", НайденнаяСтрока.КПК)); 
				
				Для каждого НайденнаяСтрокаРассылки ИЗ НайденныеСтрокиРассылки цикл
					НайденнаяСтрокаРассылки.Флаг = Истина;
				КонецЦикла;

			КонецЦикла;           
			
			ЗначениеВРеквизитФормы(ВремТаблицаДляРассылки, "ТаблицаДляРассылки");  		

		КонецЕсли; 	
		
	Иначе
		
		ВремТаблицаДляРассылки = РеквизитФормыВЗначение("ТаблицаДляРассылки");
		ВремТаблицаДляРассылки.Очистить();
	
		Для Каждого ТекСтрока из ТаблицаДляРассылкиКопия ЦИкл
			НоваяСтрока =  ВремТаблицаДляРассылки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(ВремТаблицаДляРассылки, "ТаблицаДляРассылки"); 
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыводитьВсеКПКПриИзменении(Элемент)
	ВыводитьВсеКПКПриИзмененииНаСервере();
КонецПроцедуры
